AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t ADCEN      : 1;            /*!< This bit enables the ADC module. While the ADC is enabled, the
                                                     ADCCFG and SLOT Configuration regsiter settings must remain
                                                     stable and unchanged. All configuration register settings,
                                                     slot configuration settings and window comparison settings
                                                     should be written prior to setting the ADCEN bit to '1'.                  */
            uint32_t            : 1;
      __IOM uint32_t RPTEN      : 1;            /*!< This bit enables Repeating Scan Mode.                                     */
      __IOM uint32_t LPMODE     : 1;            /*!< Select power mode to enter between active scans.                          */
      __IOM uint32_t CKMODE     : 1;            /*!< Clock mode register                                                       */
            uint32_t            : 7;
      __IOM uint32_t DFIFORDEN  : 1;            /*!< Destructive FIFO Read Enable. Setting this will enable FIFO
                                                     pop upon reading the FIFOPR register.                                     */
            uint32_t            : 3;
      __IOM uint32_t TRIGSEL    : 3;            /*!< Select the ADC trigger source.                                            */
      __IOM uint32_t TRIGPOL    : 1;            /*!< This bit selects the ADC trigger polarity for external off chip
                                                     triggers.                                                                 */
      __IOM uint32_t RPTTRIGSEL : 1;            /*!< This bit selects which periodic trigger to use with RPTEN =
                                                     1.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t CLKSEL     : 2;            /*!< Select the source and frequency for the general purpose ADC
                                                     clock. HFRC_24MHZ is the only valid GP ADC clock selection
                                                     and must be configured for proper operation.                              */
            uint32_t            : 6;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< This register indicates the basic power status for the ADC.
                                                     For detailed power status, see the power control power
                                                     status register. ADC power mode 0 indicates the ADC is
                                                     in its full power state and is ready to process scans.
                                                     ADC Power mode 1 indicates the ADC enabled and in a low
                                                     power state.                                                              */

    struct {
      __IOM uint32_t PWDSTAT    : 1;            /*!< Indicates the power-status of the ADC.                                    */
            uint32_t            : 31;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t SWT;                         /*!< This register enables initiating an ADC scan through software.            */

    struct {
      __IOM uint32_t SWT        : 8;            /*!< Writing 0x37 to this register generates a software trigger.               */
            uint32_t            : 24;
    } SWT_b;
  } ;

  union {
    __IOM uint32_t SL0CFG;                      /*!< Slot 0 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN0      : 1;            /*!< This bit enables slot 0 for ADC conversions.                              */
      __IOM uint32_t WCEN0      : 1;            /*!< This bit enables the window compare function for slot 0.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL0     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE0    : 2;            /*!< Set the Precision Mode For Slot 0.                                        */
      __IOM uint32_t TRKCYC0    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL0     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL0CFG_b;
  } ;

  union {
    __IOM uint32_t SL1CFG;                      /*!< Slot 1 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN1      : 1;            /*!< This bit enables slot 1 for ADC conversions.                              */
      __IOM uint32_t WCEN1      : 1;            /*!< This bit enables the window compare function for slot 1.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL1     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE1    : 2;            /*!< Set the Precision Mode For Slot 1.                                        */
      __IOM uint32_t TRKCYC1    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL1     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL1CFG_b;
  } ;

  union {
    __IOM uint32_t SL2CFG;                      /*!< Slot 2 Configuration                                                      */

