AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t ADCEN      : 1;            /*!< This bit enables the AUDADC module. While the AUDADC is enabled,
                                                     the ADCCFG and SLOT Configuration regsiter settings must
                                                     remain stable and unchanged. All configuration register
                                                     settings, slot configuration settings and window comparison
                                                     settings should be written prior to setting the ADCEN bit
                                                     to '1'.                                                                   */
            uint32_t            : 1;
      __IOM uint32_t RPTEN      : 1;            /*!< This bit enables Repeating Scan Mode.                                     */
      __IOM uint32_t LPMODE     : 1;            /*!< Select power mode to enter between active scans.                          */
      __IOM uint32_t CKMODE     : 1;            /*!< Clock mode register                                                       */
            uint32_t            : 7;
      __IOM uint32_t DFIFORDEN  : 1;            /*!< Destructive FIFO Read Enable. Setting this will enable FIFO
                                                     pop upon reading the FIFOPR register.                                     */
      __IOM uint32_t SAMPMODE   : 1;            /*!< Audio ADC sampling mode. Changes to this control bit are applied
                                                     when the audio ADC is not performing conversions. This
                                                     is the only control bit which is properly synchronized
                                                     to AUDADC operation.                                                      */
            uint32_t            : 2;
      __IOM uint32_t TRIGSEL    : 3;            /*!< Select the AUDADC trigger source.                                         */
      __IOM uint32_t TRIGPOL    : 1;            /*!< This bit selects the AUDADC trigger polarity for external off
                                                     chip triggers.                                                            */
      __IOM uint32_t RPTTRIGSEL : 1;            /*!< This bit selects which periodic trigger to use with RPTEN =
                                                     1.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t CLKSEL     : 2;            /*!< Select the source and frequency for the AUDADC clock. All values
                                                     not enumerated below are undefined.Whenever changing the
                                                     clock source to HFRC2, the MISC_HFRC2FRC bit in the CLKGEN
                                                     module must first be set. The sequence for changing the
                                                     clock source to HFRC2 is to first force HFRC2 on by setting
                                                     the CLKGEN_MISC_HFRC2FRC bit, select the HFRC2 clock in
                                                     this field, and then engage the peripheral. The HFRC2FRC
                                                     bit should remain set while the HFRC2 is being used.If
                                                     HFRC2 is the current clock source, then shutting the module
                                                     down cleanly requires switching to HFRC and then disabling
                                                     the HFRC2 by clearing the CLKGEN_MISC_HFRC2FRC bit.                       */
            uint32_t            : 6;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< This register indicates the basic power status for the AUDADC.
                                                     For detailed power status, see the power control power
                                                     status register. AUDADC power mode 0 indicates the AUDADC
                                                     is in its full power state and is ready to process scans.
                                                     AUDADC Power mode 1 indicates the AUDADC enabled and in
                                                     a low power state.                                                        */

    struct {
      __IOM uint32_t PWDSTAT    : 1;            /*!< Indicates the power-status of the AUDADC.                                 */
            uint32_t            : 31;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t SWT;                         /*!< This register enables initiating an AUDADC scan through software.         */

    struct {
      __IOM uint32_t SWT        : 8;            /*!< Writing 0x37 to this register generates a software trigger.               */
            uint32_t            : 24;
    } SWT_b;
  } ;

  union {
    __IOM uint32_t SL0CFG;                      /*!< Slot 0 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN0      : 1;            /*!< This bit enables slot 0 for AUDADC conversions.                           */
      __IOM uint32_t WCEN0      : 1;            /*!< This bit enables the window compare function for slot 0.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL0     : 4;            /*!< Select one of the 14 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE0    : 2;            /*!< Set the Precision Mode For Slot 0.                                        */
      __IOM uint32_t TRKCYC0    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of AUDADC clock cycles. (Note that a value of 0
                                                     in this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL0     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL0CFG_b;
  } ;

  union {
    __IOM uint32_t SL1CFG;                      /*!< Slot 1 Configuration                                                      */

