AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t METALO     : 4;            /*!< Meta data about this sample which represents the lower 4 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t LGDATA     : 12;           /*!< Low-gain PGA sample data                                                  */
      __IOM uint32_t METAHI     : 3;            /*!< Meta data about this sample which represents the upper 3 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t MIC        : 1;            /*!< Which audio channel this data is from encoded as int(slot number/2).
                                                     In other words, this is 1 if data is from slots 2 or 3,
                                                     or 0 if from slots 0 or 1.                                                */
      __IOM uint32_t HGDATA     : 12;           /*!< High-gain PGA sample data                                                 */
    } FIFO_b;
  } ;

  union {
    __IOM uint32_t FIFOPR;                      /*!< This is a pop-on-read mirrored copy of the ADCFIFO register
                                                     with the only difference being that reading this register
                                                     will result in a simultaneous FIFO POP which is also achieved
                                                     by writing to the ADCFIFO Register. Note: The DFIFORDEN
                                                     bit must be set in the CFG register for the the destructive
                                                     read to be enabled.                                                       */

    struct {
      __IOM uint32_t METALOPR   : 4;            /*!< Meta data about this sample which represents the lower 4 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t LGDATAPR   : 12;           /*!< Low-gain PGA sample data                                                  */
      __IOM uint32_t METAHIPR   : 3;            /*!< Meta data about this sample which represents the upper 3 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t MICPR      : 1;            /*!< Which audio channel this data is from encoded as int(slot number/2).
                                                     In other words, this is 1 if data is from slots 2 or 3,
                                                     or 0 if from slots 0 or 1.                                                */
      __IOM uint32_t HGDATAPR   : 12;           /*!< High-gain PGA sample data                                                 */
    } FIFOPR_b;
  } ;

  union {
    __IOM uint32_t INTTRIGTIMER;                /*!< AUDADC-Internal Repeating Trigger Timer Configuration                     */

    struct {
      __IOM uint32_t TIMERMAX   : 10;           /*!< Trigger counter count max, used as initial condition to trigger.
                                                     Also used repeatedly each time counter reaches it to restart
                                                     trigger timer at zero. To update this value, first disable
                                                     the INTTRIGTIMER by setting TIMEREN to DIS, change TIMERMAX,
                                                     and then reenable it INTTRIGTIMER by setting TIMEREN to
                                                     EN again.                                                                 */
            uint32_t            : 6;
      __IOM uint32_t CLKDIV     : 3;            /*!< Configure number of divide-by-2 of clock source as input to
                                                     trigger counter. (Max value of 5.) A value of 0 in this
                                                     register would not divide down the AUDADC input clock.
                                                     A value of 1 would divide the AUDADC input clock frequency
                                                     by 2. A value of 5 would divide the AUDADC input clock
                                                     frequency by 2^5 = 32. To update this value, first disable
                                                     the INTTRIGTIMER by setting TIMEREN to DIS, change CLKDIV,
                                                     and then reenable it INTTRIGTIMER by setting TIMEREN to
                                                     EN again.                                                                 */
            uint32_t            : 12;
      __IOM uint32_t TIMEREN    : 1;            /*!< AUDADC-internal trigger timer enable.                                     */
    } INTTRIGTIMER_b;
  } ;

  union {
    __IOM uint32_t FIFOSTAT;                    /*!< This register contains status of the data FIFO.                           */

    struct {
      __IOM uint32_t FIFOCNT    : 8;            /*!< Number of valid entries in the AUDADC FIFO.                               */
            uint32_t            : 24;
    } FIFOSTAT_b;
  } ;

  union {
    __IOM uint32_t DATAOFFSET;                  /*!< ERROR: reg_brief VALUE MISSING                                            */

    struct {
      __IOM uint32_t OFFSET     : 13;           /*!< Add this signed offset to data before being written to the FIFO.
                                                     This enables the user to convert unsigned samples to signed
                                                     or remove a DC offset on the samples. Note that this does
                                                     NOT affect the comparator limits, which still operate on
                                                     original unsigned samples.                                                */
            uint32_t            : 19;
    } DATAOFFSET_b;
  } ;
  __IM  uint32_t  RESERVED[5];

  union {
    __IOM uint32_t ZXCFG;                       /*!< Zero Crossing Comparator Configuration                                    */

