AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t ZXEN       : 1;            /*!< Enable the ZX comparator                                                  */
            uint32_t            : 3;
      __IOM uint32_t ZXCHANSEL  : 1;            /*!< Select which slots to use for zero crossing measurement. 0 enables
                                                     zero crossing detection on slots 0 and 2. 1 enables zero
                                                     crossing detection on slots 1 and 3.                                      */
            uint32_t            : 27;
    } ZXCFG_b;
  } ;

  union {
    __IOM uint32_t ZXLIM;                       /*!< Zero Crossing Comparator Limits                                           */

    struct {
      __IOM uint32_t LZXC       : 12;           /*!< Sets the lower integer sample limit for the ZX comparator. Note
                                                     that these values are raw AUDADC values whose bounds are
                                                     specified by PRMODE but not maniupulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value. Samples must enter the range between
                                                     UZXC and LZXC in order for a zero crossing to be recognized.              */
            uint32_t            : 4;
      __IOM uint32_t UZXC       : 12;           /*!< Sets the upper integer sample limit for the ZX comparator. Note
                                                     that these values are raw AUDADC values whose bounds are
                                                     specified by PRMODE but not maniupulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value. Samples must enter the range between
                                                     UZXC and LZXC in order for a zero crossing to be recognized.              */
            uint32_t            : 4;
    } ZXLIM_b;
  } ;

  union {
    __IOM uint32_t GAINCFG;                     /*!< PGA Gain Configuration                                                    */

    struct {
      __IOM uint32_t PGACTRLEN  : 1;            /*!< Enable PGA gain updates.                                                  */
            uint32_t            : 3;
      __IOM uint32_t UPDATEMODE : 1;            /*!< PGA update mode                                                           */
            uint32_t            : 27;
    } GAINCFG_b;
  } ;

  union {
    __IOM uint32_t GAIN;                        /*!< PGA Gain Codes                                                            */

    struct {
      __IOM uint32_t LGA        : 7;            /*!< Specifies the low gain code (0 to 60 decimal specifies -6.0
                                                     dB to 24.0 dB in half-dB increments) for channel A (slot
                                                     0).                                                                       */
            uint32_t            : 1;
      __IOM uint32_t HGADELTA   : 7;            /*!< Specifies the high gain code (0 to 60 decimal specifies 0 dB
                                                     to 30.0 dB in half-dB increments) as the delta from the
                                                     LGA field for channel A (slot 1). Note that HGADELTA must
                                                     be LE (24 - LGA) dB.                                                      */
            uint32_t            : 1;
      __IOM uint32_t LGB        : 7;            /*!< Specifies the low gain code (0 to 60 decimal specifies -6.0
                                                     dB to 24.0 dB in half-dB increments) for channel B (slot
                                                     2).                                                                       */
            uint32_t            : 1;
      __IOM uint32_t HGBDELTA   : 7;            /*!< Specifies the high gain code (0 to 60 decimal specifies 0 dB
                                                     to 30.0 dB in half-dB increments) as the delta from the
                                                     LGB field for channel B (slot 3). Note that HGBDELTA must
                                                     be LE (24 - LGB) dB.                                                      */
            uint32_t            : 1;
    } GAIN_b;
  } ;
  __IM  uint32_t  RESERVED1[13];

  union {
    __IOM uint32_t SATCFG;                      /*!< Saturation Comparator Configuration                                       */

    struct {
      __IOM uint32_t SATEN      : 1;            /*!< Enable the saturation comparator                                          */
            uint32_t            : 3;
      __IOM uint32_t SATCHANSEL : 1;            /*!< Select which slots to use for saturation measurement. 0 enables
                                                     saturation on slots 0 and 2. 1 enables saturation on slots
                                                     1 and 3.                                                                  */
            uint32_t            : 27;
    } SATCFG_b;
  } ;

  union {
    __IOM uint32_t SATLIM;                      /*!< Saturation Comparator Limits                                              */

    struct {
      __IOM uint32_t LSATC      : 12;           /*!< Sets the lower integer sample limit for the saturation comparator.
                                                     Note that these values are raw AUDADC values whose bounds
                                                     are specified by PRMODE but not manipulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value.                                                      */
            uint32_t            : 4;
      __IOM uint32_t USATC      : 12;           /*!< Sets the upper integer sample limit for the saturation comparator.
                                                     Note that these values are raw AUDADC values whose bounds
                                                     are specified by PRMODE but not manipulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value.                                                      */
            uint32_t            : 4;
    } SATLIM_b;
  } ;

  union {
    __IOM uint32_t SATMAX;                      /*!< Saturation Comparator Event Counter Limits                                */

