AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FRCHFRC    : 1;            /*!< Force HFRC On .                                                           */
            uint32_t            : 2;
      __IOM uint32_t USEHFRC2FQ96MHZ : 1;       /*!< Use HFRC-96MHz or HFRC2-96MHz for DSP                                     */
      __IOM uint32_t USEHFRC2FQ192MHZ : 1;      /*!< Use HFRC-192MHz or HFRC2-192MHz for MCU                                   */
      __IOM uint32_t FRCHFRC2   : 1;            /*!< Force HFRC2 On.Setting this bit forces HFRC2 to remain on, including
                                                     in deep sleep. When changing a module's clock source to
                                                     HFRC2, this bit must be set and remain set when any module
                                                     is using HFRC2 as its clock.                                              */
      __IOM uint32_t PWRONCLKENDISP : 1;        /*!< For Apollo4 revB, disables display clock enable during reset
                                                     basically reverting to revA behavior.                                     */
            uint32_t            : 11;
      __IOM uint32_t CLKGENMISCSPARES : 8;      /*!< This field is used for the clock gating workaround.                       */
            uint32_t            : 6;
    } MISC_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ0;                     /*!< This register controls hf2adj enable, fast_start enable, fast_start_delay
                                                     setting and counter input offset.                                         */

    struct {
      __IOM uint32_t HF2ADJEN   : 1;            /*!< HF2ADJ control                                                            */
      __IOM uint32_t HF2ADJFASTSTREN : 1;       /*!< Fast_start_delay control                                                  */
      __IOM uint32_t HF2ADJFASTSTRDLY : 13;     /*!< Fast_start_delay value setting                                            */
      __IOM uint32_t HF2ADJCNTINOFFSET : 14;    /*!< Counter input offset                                                      */
      __IOM uint32_t HF2ADJXTHSMUXSEL : 1;      /*!< 0=XTHS 1=EXTREF select                                                    */
            uint32_t            : 2;
    } HF2ADJ0_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ1;                     /*!< This register controls hf2adj trimming enable and trimming offset.        */

    struct {
      __IOM uint32_t HF2ADJTRIMEN : 3;          /*!< HF2ADJ output selection                                                   */
      __IOM uint32_t HF2ADJTRIMOFFSET : 11;     /*!< HF2ADJ trimming offset. (signed number)                                   */
            uint32_t            : 18;
    } HF2ADJ1_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ2;                     /*!< This register controls xtal32m divider ratio and HF2ADJ ration
                                                     setting.                                                                  */

    struct {
      __IOM uint32_t HF2ADJXTALDIVRATIO : 2;    /*!< XTAL32MHz divider ratio for HF2ADJ.                                       */
      __IOM uint32_t HF2ADJRATIO : 29;          /*!< HF2ADJ ratio setting.                                                     */
            uint32_t            : 1;
    } HF2ADJ2_b;
  } ;

  union {
    __IOM uint32_t HF2VAL;                      /*!< This register provides the read back of the HF2TUNE                       */

    struct {
      __IOM uint32_t HF2ADJTRIMOUT : 11;        /*!< HF2ADJ trimming output                                                    */
            uint32_t            : 21;
    } HF2VAL_b;
  } ;
  __IM  uint32_t  RESERVED4[8];

  union {
    __IOM uint32_t LFRCCTRL;                    /*!< LFRC control                                                              */

    struct {
      __IOM uint32_t LFRCOUT    : 1;            /*!< Disable LFRC output                                                       */
      __IOM uint32_t LFRCPWD    : 1;            /*!< Power down LFRC                                                           */
            uint32_t            : 30;
    } LFRCCTRL_b;
  } ;
  __IM  uint32_t  RESERVED5[2];

  union {
    __IOM uint32_t DISPCLKCTRL;                 /*!< Provides ability to select the PLL reference clock, and derivative
                                                     of the display clock                                                      */

    struct {
      __IOM uint32_t PLLCLKSEL  : 2;            /*!< Selection for PLL reference clock.                                        */
            uint32_t            : 1;
      __IOM uint32_t PLLCLKEN   : 1;            /*!< Enable for the PLL clock through clkgen                                   */
      __IOM uint32_t DISPCLKSEL : 2;            /*!< Selection for PLL reference clock.                                        */
            uint32_t            : 1;
      __IOM uint32_t DCCLKEN    : 1;            /*!< Enable for the PLL clock through clkgen                                   */
            uint32_t            : 24;
    } DISPCLKCTRL_b;
  } ;
} CLKGEN_Type;                                  /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                            CPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CM4 Complex Registers (Cache, TCM, DAXI) (CPU)
  */

typedef struct {                                /*!< CPU Structure                                                             */

  union {
    __IOM uint32_t CACHECFG;                    /*!< CM4 Cache Control                                                         */

