AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Enables the CM4 cache controller and enables power to the cache
                                                     SRAMs. The ICACHE_ENABLE and DCACHE_ENABLE should be set
                                                     to enable caching for each type of access.                                */
      __IOM uint32_t LRU        : 1;            /*!< Sets the cache repleacment policy. 0=LRR (least recently replaced),
                                                     1=LRU (least recently used). LRR minimizes writes to the
                                                     TAG SRAM.                                                                 */
      __IOM uint32_t NC0ENABLE  : 1;            /*!< Enable Non-cacheable region 0. See NCR0 registers to define
                                                     the region.                                                               */
      __IOM uint32_t NC1ENABLE  : 1;            /*!< Enable Non-cacheable region 1. See NCR1 registers to define
                                                     the region.                                                               */
      __IOM uint32_t CONFIG     : 4;            /*!< Sets the cache configuration                                              */
      __IOM uint32_t IENABLE    : 1;            /*!< Enable CM4 Instruction Caching                                            */
      __IOM uint32_t DENABLE    : 1;            /*!< Enable CM4 Data Caching.                                                  */
      __IOM uint32_t CLKGATE    : 1;            /*!< Enable clock gating of cache TAG RAM. Software should enable
                                                     this bit for optimal power efficiency.                                    */
      __IOM uint32_t LS         : 1;            /*!< Enable LS (light sleep) of cache RAMs. Software should DISABLE
                                                     this bit since cache activity is too high to benefit from
                                                     LS usage.                                                                 */
      __IOM uint32_t NC1CACHELOCK : 1;          /*!< Only valid when Cache Mode D is set. When high sets the mode
                                                     of the the NC1 region such that all accesse to this region
                                                     are cached in to the upper half of the cache. When set
                                                     low then NCR1 is non cacheable.                                           */
      __IOM uint32_t NC0CACHELOCK : 1;          /*!< Only valid when Cache Mode D is set. When high sets the mode
                                                     of the the NC0 region such that all accesse to this region
                                                     are cached in to the lower half of the cache. When set
                                                     low then NCR0 is non cacheable.                                           */
            uint32_t            : 6;
      __IOM uint32_t DATACLKGATE : 1;           /*!< Enable aggressive clock gating of entire data array. This bit
                                                     should be set to 1 for optimal power efficiency.                          */
            uint32_t            : 3;
      __IOM uint32_t ENABLEMONITOR : 1;         /*!< Enable Cache Monitoring Stats. Cache monitoring consumes additional
                                                     power and should only be enabled when profiling code and
                                                     counters will increment when this bit is set. Counter values
                                                     will be retained when this is set to 0, allowing software
                                                     to enable/disable counting for multiple code segments.                    */
            uint32_t            : 7;
    } CACHECFG_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t CACHECTRL;                   /*!< Cache Control                                                             */

    struct {
      __IOM uint32_t INVALIDATE : 1;            /*!< Writing a 1 to this bitfield invalidates the CM4 cache contents.          */
      __IOM uint32_t RESETSTAT  : 1;            /*!< Reset Cache Statistics. When written to a 1, the cache monitor
                                                     counters will be cleared. The monitor counters can be reset
                                                     only when the CACHECFG.ENABLE_MONITOR bit is set.                         */
      __IOM uint32_t CACHEREADY : 1;            /*!< Cache Ready Status (enabled and not processing an invalidate
                                                     operation)                                                                */
            uint32_t            : 29;
    } CACHECTRL_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t NCR0START;                   /*!< CM4 Cache Noncachable Region 0 Start                                      */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< Start address for non-cacheable region 0                                  */
            uint32_t            : 3;
    } NCR0START_b;
  } ;

  union {
    __IOM uint32_t NCR0END;                     /*!< CM4 Cache Noncachable Region 0 End                                        */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< End address for non-cacheable region 0                                    */
            uint32_t            : 3;
    } NCR0END_b;
  } ;

  union {
    __IOM uint32_t NCR1START;                   /*!< CM4 Cache Noncachable Region 1 Start                                      */

