AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< Start address for non-cacheable region 1                                  */
            uint32_t            : 3;
    } NCR1START_b;
  } ;

  union {
    __IOM uint32_t NCR1END;                     /*!< CM4 Cache Noncachable Region 1 End                                        */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< End address for non-cacheable region 1                                    */
            uint32_t            : 3;
    } NCR1END_b;
  } ;
  __IM  uint32_t  RESERVED2[12];

  union {
    __IOM uint32_t DAXICFG;                     /*!< DAXI Config                                                               */

    struct {
      __IOM uint32_t FLUSHLEVEL : 1;            /*!< When set to 0 and 3 or 4 buffers are enabled, the DAXI will
                                                     attempt to maintain two free buffers. When set to 1 and
                                                     3 or 4 buffers are enabled, the DAXI will attempt to maintain
                                                     three free buffers. When set to 0 and 2 buffers are enabled,
                                                     the DAXI will attempt to maintain one free buffer. When
                                                     set to 1 and 2 buffers are enabled, the DAXI will attempt
                                                     to maintain two free buffers. Not applicable when only
                                                     1 buffer is enabled.                                                      */
            uint32_t            : 7;
      __IOM uint32_t BUFFERENABLE : 2;          /*!< Enables DAXI buffers                                                      */
            uint32_t            : 6;
      __IOM uint32_t AGINGCOUNTER : 8;          /*!< Specifies the relative time that DAXI buffers may remain unused
                                                     before being flushed. Counter is based on CPU clock cycles
                                                     and buffers will generally be flushed in 1-2 AGINGCOUNTER
                                                     timesteps.                                                                */
            uint32_t            : 8;
    } DAXICFG_b;
  } ;

  union {
    __IOM uint32_t DAXICTRL;                    /*!< DAXI Control                                                              */

    struct {
      __IOM uint32_t DAXIFLUSHWRITE : 1;        /*!< Writing a 1 to this bitfield forces a flush of WRITE or MODIFIED
                                                     buffers                                                                   */
      __IOM uint32_t DAXIINVALIDATE : 1;        /*!< Writing a 1 to this bitfield invalidates any SHARED data buffers          */
            uint32_t            : 30;
    } DAXICTRL_b;
  } ;
  __IM  uint32_t  RESERVED3[10];

  union {
    __IOM uint32_t ICODEFAULTADDR;              /*!< ICODE bus address which was present when a bus fault occurred.            */

    struct {
      __IOM uint32_t ICODEFAULTADDR : 32;       /*!< The ICODE bus address observed when a Bus Fault occurred. Once
                                                     an address is captured in this field, it is held until
                                                     the corresponding Fault Observed bit is cleared in the
                                                     FAULTSTATUS register.                                                     */
    } ICODEFAULTADDR_b;
  } ;

  union {
    __IOM uint32_t DCODEFAULTADDR;              /*!< DCODE bus address which was present when a bus fault occurred.            */

    struct {
      __IOM uint32_t DCODEFAULTADDR : 32;       /*!< The DCODE bus address observed when a Bus Fault occurred. Once
                                                     an address is captured in this field, it is held until
                                                     the corresponding Fault Observed bit is cleared in the
                                                     FAULTSTATUS register.                                                     */
    } DCODEFAULTADDR_b;
  } ;

  union {
    __IOM uint32_t SYSFAULTADDR;                /*!< System bus address which was present when a bus fault occurred.           */

    struct {
      __IOM uint32_t SYSFAULTADDR : 32;         /*!< SYS bus address observed when a Bus Fault occurred. Once an
                                                     address is captured in this field, it is held until the
                                                     corresponding Fault Observed bit is cleared in the FAULTSTATUS
                                                     register.                                                                 */
    } SYSFAULTADDR_b;
  } ;

  union {
    __IOM uint32_t FAULTSTATUS;                 /*!< Reflects the status of the bus decoders' fault detection. Any
                                                     write to this register will clear all of the status bits
                                                     within the register.                                                      */

    struct {
      __IOM uint32_t ICODEFAULT : 1;            /*!< The ICODE Bus Decoder Fault Detected bit. When set, a fault
                                                     has been detected, and the ICODEFAULTADDR register will
                                                     contain the bus address which generated the fault.                        */
      __IOM uint32_t DCODEFAULT : 1;            /*!< DCODE Bus Decoder Fault Detected bit. When set, a fault has
                                                     been detected, and the DCODEFAULTADDR register will contain
                                                     the bus address which generated the fault.                                */
      __IOM uint32_t SYSFAULT   : 1;            /*!< SYS Bus Decoder Fault Detected bit. When set, a fault has been
                                                     detected, and the SYSFAULTADDR register will contain the
                                                     bus address which generated the fault.                                    */
            uint32_t            : 29;
    } FAULTSTATUS_b;
  } ;

  union {
    __IOM uint32_t FAULTCAPTUREEN;              /*!< Enable the fault capture registers                                        */

