AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FAULTCAPTUREEN : 1;        /*!< Fault Capture Enable field. When set, the Fault Capture monitors
                                                     are enabled and addresses which generate a hard fault are
                                                     captured into the FAULTADDR registers.                                    */
            uint32_t            : 31;
    } FAULTCAPTUREEN_b;
  } ;
  __IM  uint32_t  RESERVED4[11];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTSET_b;
  } ;

  union {
    __IOM uint32_t WRITEERRADDR;                /*!< DAXI Write Error Address                                                  */

    struct {
      __IOM uint32_t WERRADDR   : 32;           /*!< This address will be approximate since multiple write transactions
                                                     might be in flight at any given time. However, it should
                                                     be accurate when debugging/single-stepping                                */
    } WRITEERRADDR_b;
  } ;
  __IM  uint32_t  RESERVED5[11];

  union {
    __IOM uint32_t DMON0;                       /*!< Data Cache Total Accesses                                                 */

    struct {
      __IOM uint32_t DACCESS    : 32;           /*!< Total accesses to data cache. All performance metrics should
                                                     be relative to the number of accesses performed.                          */
    } DMON0_b;
  } ;

  union {
    __IOM uint32_t DMON1;                       /*!< Data Cache Tag Lookups                                                    */

    struct {
      __IOM uint32_t DLOOKUP    : 32;           /*!< Total tag lookups from data cache.                                        */
    } DMON1_b;
  } ;

  union {
    __IOM uint32_t DMON2;                       /*!< Data Cache Hits                                                           */

    struct {
      __IOM uint32_t DHIT       : 32;           /*!< Cache hits from lookup operations.                                        */
    } DMON2_b;
  } ;

  union {
    __IOM uint32_t DMON3;                       /*!< Data Cache Line Hits                                                      */

    struct {
      __IOM uint32_t DLINE      : 32;           /*!< Cache hits from line cache                                                */
    } DMON3_b;
  } ;

  union {
    __IOM uint32_t IMON0;                       /*!< Instruction Cache Total Accesses                                          */

    struct {
      __IOM uint32_t IACCESS    : 32;           /*!< Total accesses to Instruction cache                                       */
    } IMON0_b;
  } ;

  union {
    __IOM uint32_t IMON1;                       /*!< Instruction Cache Tag Lookups                                             */

    struct {
      __IOM uint32_t ILOOKUP    : 32;           /*!< Total tag lookups from Instruction cache                                  */
    } IMON1_b;
  } ;

  union {
    __IOM uint32_t IMON2;                       /*!< Instruction Cache Hits                                                    */

    struct {
      __IOM uint32_t IHIT       : 32;           /*!< Cache hits from lookup operations                                         */
    } IMON2_b;
  } ;

  union {
    __IOM uint32_t IMON3;                       /*!< Instruction Cache Line Hits                                               */

    struct {
      __IOM uint32_t ILINE      : 32;           /*!< Cache hits from line cache                                                */
    } IMON3_b;
  } ;
} CPU_Type;                                     /*!< Size = 288 (0x120)                                                        */



/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Embedded security and cryptographic services (CRYPTO)
  */

