AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t AESIV00    : 32;           /*!< bits 31:0 of AES_IV0 register.                                            */
    } AESIV00_b;
  } ;

  union {
    __IOM uint32_t AESIV01;                     /*!< bits 63:32 of AES_IV0 128b register.For the description of AES_IV0,
                                                     see the AES_IV_0_0 register description                                   */

    struct {
      __IOM uint32_t AESIV01    : 32;           /*!< bits 63:32 of AES_IV0 register.                                           */
    } AESIV01_b;
  } ;

  union {
    __IOM uint32_t AESIV02;                     /*!< bits 95:64 of AES_IV0 128b register.For the description of AES_IV0,
                                                     see the AES_IV_0_0 register description                                   */

    struct {
      __IOM uint32_t AESIV02    : 32;           /*!< bits 95:64 of AES_IV0 register.                                           */
    } AESIV02_b;
  } ;

  union {
    __IOM uint32_t AESIV03;                     /*!< bits 127:96 of AES_IV0 128b register.For the description of
                                                     AES_IV0, see the AES_IV_0_0 register description                          */

    struct {
      __IOM uint32_t AESIV03    : 32;           /*!< bits 127:96 of AES_IV0 register.                                          */
    } AESIV03_b;
  } ;

  union {
    __IOM uint32_t AESIV10;                     /*!< bits 31:0 of AES_IV1 128b register.AES IV1 is used as the AES
                                                     IV (Initialization Value) register as the second tunnel
                                                     stage IV register in tunneling operations.The IV register
                                                     should be loaded according to the AES mode:in AES CBC_CBC-MAC
                                                     - the AES IV register should be loaded with the IV (initialization
                                                     vector).in XTS-AES - the AES IV register should be loaded
                                                     with the T value (unless the HW T calculation mode is active,
                                                     in which the T value is calculated by the HW.                             */

    struct {
      __IOM uint32_t AESIV10    : 32;           /*!< bits 31:0 of AES_IV1 register.                                            */
    } AESIV10_b;
  } ;

  union {
    __IOM uint32_t AESIV11;                     /*!< bits 63:32 of AES_IV1 128b register.For the description of AES_IV1,
                                                     see the AES_IV_1_0 register description                                   */

    struct {
      __IOM uint32_t AESIV11    : 32;           /*!< bits 63:32 of AES_IV1 register.                                           */
    } AESIV11_b;
  } ;

  union {
    __IOM uint32_t AESIV12;                     /*!< bits 95:64 of AES_IV1 128b register.For the description of AES_IV1,
                                                     see the AES_IV_1_0 register description                                   */

    struct {
      __IOM uint32_t AESIV12    : 32;           /*!< bits 95:64 of AES_IV1 register.                                           */
    } AESIV12_b;
  } ;

  union {
    __IOM uint32_t AESIV13;                     /*!< bits 127:96 of AES_IV1 128b register.For the description of
                                                     AES_IV1, see the AES_IV_1_0 register description                          */

    struct {
      __IOM uint32_t AESIV13    : 32;           /*!< bits 127:96 of AES_IV1 register.                                          */
    } AESIV13_b;
  } ;

  union {
    __IOM uint32_t AESCTR00;                    /*!< bits 31:0 of AES_CTR0 128b register.AES CTR0 is used as the
                                                     AES CTR (counter) register in non-tunneling operations,
                                                     and as the first tunnel stage CTR register in tunneling
                                                     operations.The CTR register should be loaded according
                                                     to the AES mode:in AES CTR_GCTR - the AES CTR register
                                                     should be loaded with the counter value.in XTS-AES - the
                                                     AES CTR register should be loaded with the i value (in
                                                     order to calculate the T value from it, if HW T calculation
                                                     is supported).                                                            */

    struct {
      __IOM uint32_t AESCTR00   : 32;           /*!< bits 31:0 of AES_CTR0 register.                                           */
    } AESCTR00_b;
  } ;

  union {
    __IOM uint32_t AESCTR01;                    /*!< bits 63:32 of AES_CTR0 128b register.For the description of
                                                     AES_CTR0, see the AES_CTR_0_0 register description.                       */

    struct {
      __IOM uint32_t AESCTR01   : 32;           /*!< bits 63:32 of AES_CTR0 register.                                          */
    } AESCTR01_b;
  } ;

  union {
    __IOM uint32_t AESCTR02;                    /*!< bits 95:64 of AES_CTR0 128b register.For the description of
                                                     AES_CTR0, see the AES_CTR_0_0 register description.                       */

    struct {
      __IOM uint32_t AESCTR02   : 32;           /*!< bits 95:64 of AES_CTR0 register.                                          */
    } AESCTR02_b;
  } ;

  union {
    __IOM uint32_t AESCTR03;                    /*!< bits 127:96 of AES_CTR0 128b register.For the description of
                                                     AES_CTR0, see the AES_CTR_0_0 register description.                       */

