AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t GHASHIV01  : 32;           /*!< Bits 63:32 of GHASH_IV0 register of the GHASH module.                     */
    } GHASHIV01_b;
  } ;

  union {
    __IOM uint32_t GHASHIV02;                   /*!< Bits 95:64 of GHASH_IV0 register. GHASH IV0 is used as the GHASH
                                                     IV (Initialization Value) register.                                       */

    struct {
      __IOM uint32_t GHASHIV02  : 32;           /*!< Bits 95:64 of GHASH_IV0 register of the GHASH module.                     */
    } GHASHIV02_b;
  } ;

  union {
    __IOM uint32_t GHASHIV03;                   /*!< Bits 127:96 of GHASH_IV0 register.GHASH IV0 is used as the GHASH
                                                     IV (Initialization Value) register.                                       */

    struct {
      __IOM uint32_t GHASHIV03  : 32;           /*!< Bits 127:96 of GHASH_IV0 register of the GHASH module.                    */
    } GHASHIV03_b;
  } ;

  union {
    __IOM uint32_t GHASHBUSY;                   /*!< The GHASH module GHASH_BUSY Register. This register is set when
                                                     the GHASH core is active.                                                 */

    struct {
      __IOM uint32_t GHASHBUSY  : 1;            /*!< GHASH_BUSY Register. This register is set when the GHASH core
                                                     is active                                                                 */
            uint32_t            : 31;
    } GHASHBUSY_b;
  } ;

  union {
    __IOM uint32_t GHASHINIT;                   /*!< Writing to this address sets the GHASH engine to be ready to
                                                     a new GHASH operation.                                                    */

    struct {
      __IOM uint32_t GHASHINIT  : 1;            /*!< Writing to this address sets the GHASH engine to be ready to
                                                     a new GHASH operation.                                                    */
            uint32_t            : 31;
    } GHASHINIT_b;
  } ;
  __IM  uint32_t  RESERVED34[30];

  union {
    __IOM uint32_t HOSTRGFIRR;                  /*!< The Interrupt Request register. Each bit of this register holds
                                                     the interrupt status of a single interrupt source.                        */

    struct {
            uint32_t            : 4;
      __IOM uint32_t SRAMTODININT : 1;          /*!< The SRAM to DIN DMA done interrupt status. This interrupt is
                                                     asserted when all data was delivered to DIN buffer from
                                                     SRAM.                                                                     */
      __IOM uint32_t DOUTTOSRAMINT : 1;         /*!< The DOUT to SRAM DMA done interrupt status. This interrupt is
                                                     asserted when all data was delivered to SRAM buffer from
                                                     DOUT.                                                                     */
      __IOM uint32_t MEMTODININT : 1;           /*!< The memory to DIN DMA done interrupt status. This interrupt
                                                     is asserted when all data was delivered to DIN buffer from
                                                     memory.                                                                   */
      __IOM uint32_t DOUTTOMEMINT : 1;          /*!< The DOUT to memory DMA done interrupt status. This interrupt
                                                     is asserted when all data was delivered to memory buffer
                                                     from DOUT.                                                                */
      __IOM uint32_t AHBERRINT  : 1;            /*!< The AXI error interrupt status.                                           */
      __IOM uint32_t PKAEXPINT  : 1;            /*!< The PKA end of operation interrupt status.                                */
      __IOM uint32_t RNGINT     : 1;            /*!< The RNG interrupt status.                                                 */
      __IOM uint32_t SYMDMACOMPLETED : 1;       /*!< The GPR interrupt status.                                                 */
            uint32_t            : 20;
    } HOSTRGFIRR_b;
  } ;

  union {
    __IOM uint32_t HOSTRGFIMR;                  /*!< The Interrupt Mask register. Each bit of this register holds
                                                     the mask of a single interrupt source.                                    */

    struct {
            uint32_t            : 4;
      __IOM uint32_t SRAMTODINMASK : 1;         /*!< The SRAM to DIN DMA done interrupt mask.                                  */
      __IOM uint32_t DOUTTOSRAMMASK : 1;        /*!< The DOUT to SRAM DMA done interrupt mask.                                 */
      __IOM uint32_t MEMTODINMASK : 1;          /*!< The memory to DIN DMA done interrupt mask.                                */
      __IOM uint32_t DOUTTOMEMMASK : 1;         /*!< The DOUT to memory DMA done interrupt mask.                               */
      __IOM uint32_t AXIERRMASK : 1;            /*!< The AXI error interrupt mask.                                             */
      __IOM uint32_t PKAEXPMASK : 1;            /*!< The PKA end of operation interrupt mask.                                  */
      __IOM uint32_t RNGINTMASK : 1;            /*!< The RNG interrupt mask.                                                   */
      __IOM uint32_t SYMDMACOMPLETEDMASK : 1;   /*!< The GPR interrupt mask.                                                   */
            uint32_t            : 20;
    } HOSTRGFIMR_b;
  } ;

  union {
    __IOM uint32_t HOSTRGFICR;                  /*!< Interrupt Clear Register.                                                 */

