AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t HOSTRGFCCSWRST : 1;        /*!< Writing 1 to this field generates a general reset to CryptoCell.          */
            uint32_t            : 31;
    } HOSTRGFCCSWRST_b;
  } ;
  __IM  uint32_t  RESERVED54[48];

  union {
    __IOM uint32_t AIBFUSEPROGCOMPLETED;        /*!< This register reflects the fuse_aib_prog_completed input, which
                                                     indicates that the fuse programming was completed.Note:
                                                     This is a special register, affected by internal logic.
                                                     Test result of this register is NA.                                       */

    struct {
      __IOM uint32_t AIBFUSEPROGCOMPLETED : 1;  /*!< Indicates if the fuse programming operation has been completed.           */
            uint32_t            : 31;
    } AIBFUSEPROGCOMPLETED_b;
  } ;

  union {
    __IOM uint32_t NVMDEBUGSTATUS;              /*!< AIB debug status register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
            uint32_t            : 1;
      __IOM uint32_t NVMSM      : 3;            /*!< Main nvm fsm                                                              */
            uint32_t            : 28;
    } NVMDEBUGSTATUS_b;
  } ;

  union {
    __IOM uint32_t LCSISVALID;                  /*!< Indicates that the LCS register holds a valid value.Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

    struct {
      __IOM uint32_t LCSISVALIDREG : 1;         /*!< Indicates whether LCS is valid.                                           */
            uint32_t            : 31;
    } LCSISVALID_b;
  } ;

  union {
    __IOM uint32_t NVMISIDLE;                   /*!< Indicates that the LCS register holds a valid value.Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

    struct {
      __IOM uint32_t NVMISIDLEREG : 1;          /*!< Indicates whether the NVM manager finishes its operation, calculates
                                                     the LCS, reads the HW keys, compares the number of zeros
                                                     and clears the keys                                                       */
            uint32_t            : 31;
    } NVMISIDLE_b;
  } ;

  union {
    __IOM uint32_t LCSREG;                      /*!< The lifecycle state register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t LCSREG     : 3;            /*!< Indicates the LCS (Lifecycle State) value.                                */
            uint32_t            : 5;
      __IOM uint32_t ERRORKDRZEROCNT : 1;       /*!< Indication that the number of zeroes in the loaded KDR is not
                                                     equal to the value set in the manufacture flag.                           */
      __IOM uint32_t ERRORPROVZEROCNT : 1;      /*!< Indication that the number of zeroes in the loaded KCP is not
                                                     equal to the value set in the OEM flag.                                   */
      __IOM uint32_t ERRORKCEZEROCNT : 1;       /*!< Indication that the number of zeroes in the loaded KCE is not
                                                     equal to the value set in the OEM flag.                                   */
      __IOM uint32_t ERRORKPICVZEROCNT : 1;     /*!< Indication that the number of zeroes in the loaded KPICV is
                                                     not equal to the value set in the manufacture flag.                       */
      __IOM uint32_t ERRORKCEICVZEROCNT : 1;    /*!< Indication that the number of zeroes in the loaded KCEICV is
                                                     not equal to the value set in the manufacture flag.                       */
            uint32_t            : 19;
    } LCSREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKDRREG;            /*!< This register interface is used to update the RKEK(KDR) registers
                                                     when the device is in CM or DM mode , it is Write-once
                                                     (per warm boot) in RMA LCS, The RKEK is updated by shifting
                                                     .                                                                         */

    struct {
      __IOM uint32_t HOSTSHADOWKDRREG : 1;      /*!< This field is used to update the KDR registers when the device
                                                     is in CM , DM or RMA mode, The KDR is updated by shifting
                                                     .                                                                         */
            uint32_t            : 31;
    } HOSTSHADOWKDRREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCPREG;            /*!< This register interface is used to update the KCP registers
                                                     when the device is in CM or DM mode, The KCP is updated
                                                     by shifting                                                               */

