AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t HOSTSHADOWKCPREG : 1;      /*!< This field is used to update the KCP registers when the device
                                                     is in CM or DM mode, The KCP is updated by shifting                       */
            uint32_t            : 31;
    } HOSTSHADOWKCPREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCEREG;            /*!< This register interface is used to update the KCE registers
                                                     when the device is in CM or DM mode, The KCE is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKCEREG : 1;      /*!< This field is used to update the KCE registers when the device
                                                     is in CM or DM mode, The KCE is updated by shifting                       */
            uint32_t            : 31;
    } HOSTSHADOWKCEREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKPICVREG;          /*!< This register interface is used to update the KPICV registers
                                                     when the device is in CM or DM mode, The KPICV is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKPICVREG : 1;    /*!< This field is used to update the KPICV registers when the device
                                                     is in CM or DM mode, The KPICV is updated by shifting                     */
            uint32_t            : 31;
    } HOSTSHADOWKPICVREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCEICVREG;         /*!< This register interface is used to update the KCEICV registers
                                                     when the device is in CM or DM mode, The KCEICV is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKCEICVREG : 1;   /*!< This field is used to update the KCEICV registers when the device
                                                     is in CM or DM mode, The KCEICV is updated by shifting                    */
            uint32_t            : 31;
    } HOSTSHADOWKCEICVREG_b;
  } ;

  union {
    __IOM uint32_t OTPADDRWIDTHDEF;             /*!< OTP_ADDR_WIDTH parameter, that will define the integrated OTP
                                                     address width (address in words). The supported sizes are
                                                     6 (for 2 Kbits),7,8,9,11 (for 64 Kbits). The default value
                                                     in the provided RTL will be 6.Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t OTPADDRWIDTHDEF : 4;       /*!< Holds the OTP_ADDR_WIDTH_DEF value.                                       */
            uint32_t            : 28;
    } OTPADDRWIDTHDEF_b;
  } ;
} CRYPTO_Type;                                  /*!< Size = 7984 (0x1f30)                                                      */



/* =========================================================================================================================== */
/* ================                                            DC                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Display Controller (DC)
  */

typedef struct {                                /*!< DC Structure                                                              */

  union {
    __IOM uint32_t MODE;                        /*!< General control register that activates the NEMAp|dc400 controller
                                                     and various parameters, sets the timing signals' polarity,
                                                     activates the global look-up table for gamma correction
                                                     and chooses the output display formats to meet LCD color
                                                     specifications.                                                           */

    struct {
      __IOM uint32_t TSTMODEN   : 1;            /*!< When set to 1, test mode is enabled                                       */
      __IOM uint32_t DBLHORSCANEN : 1;          /*!< When set to 1, double horizontal scan is enabled                          */
      __IOM uint32_t LVDSINTEN  : 1;            /*!< When set to 1, LVDS interface is enabled                                  */
      __IOM uint32_t YUYVEN     : 1;            /*!< When set to 1, the following output color formats are enabled
                                                     : Byte-3 beat Interface enabled, Byte-4 beat (RGBX) Interface
                                                     enabled, Two phase serial 12-bit enabled, YUYV (16-bit
                                                     mode) enabled, BT.656 enabled, JDI MIP enabled                            */
      __IOM uint32_t DBITYPEBEN : 1;            /*!< When set to 1, DBI Type-B interface is enabled                            */
      __IOM uint32_t DISPFMT    : 4;            /*!< Display data format                                                       */
      __IOM uint32_t COLFMT     : 1;            /*!< Output color format:                                                      */
      __IOM uint32_t LVDSPADSEN : 1;            /*!< When set to 1, LVDS output pads are enabled                               */
      __IOM uint32_t PLLCLKNDIV : 1;            /*!< When set to 1, PLL_CLK is not divided                                     */
      __IOM uint32_t RSVD0      : 5;            /*!< This field is reserved.                                                   */
      __IOM uint32_t FRAMEUPDTEN : 1;           /*!< When set to 1, single frame update is enabled                             */
      __IOM uint32_t RSVD1      : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t BLANKFRC   : 1;            /*!< When set to 1, forces output to blank                                     */
      __IOM uint32_t GAMARAMPEN : 1;            /*!< When set to 1, gamma ramp is enabled                                      */
      __IOM uint32_t RSVD2      : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t PIXCLKPOL  : 1;            /*!< Defines Pixel Clock out polarity                                          */
      __IOM uint32_t VSYNCEN    : 1;            /*!< When set to 1, VSYNC for a single cycle per line is enabled               */
      __IOM uint32_t DITHEREN   : 1;            /*!< When set to 1, dithering is enabled                                       */
      __IOM uint32_t RSVD3      : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t DEPOL      : 1;            /*!< Defines DE polarity                                                       */
      __IOM uint32_t HSYNCPOL   : 1;            /*!< Defines HSYNC polarity                                                    */
      __IOM uint32_t VSYNCPOL   : 1;            /*!< Defines VSYNC polarity                                                    */
      __IOM uint32_t RSVD4      : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t CUSOREN    : 1;            /*!< When set to 1, programmable cursor is enabled                             */
      __IOM uint32_t DC400ACT   : 1;            /*!< When set to 1, the dc400 controller is activated                          */
    } MODE_b;
  } ;

  union {
    __IOM uint32_t CLKCTRL;                     /*!< Setup proper timing with divisor control bits and specify the
                                                     number of lines to be prefetched before the start of frame.               */

