AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t LAYER1YOFF : 16;           /*!< Specify the pixel offset of the starting Y dimension of layer
                                                     1                                                                         */
      __IOM uint32_t LAYER1XOFF : 16;           /*!< Specify the pixel offset of the starting X dimension of layer
                                                     1                                                                         */
    } LAYER1STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER1SIZEXY;                /*!< X and Y size of layer 1.                                                  */

    struct {
      __IOM uint32_t LAYER1PIXSZEY : 16;        /*!< Specify the pixel size of the layer 1 in the Y dimension                  */
      __IOM uint32_t LAYER1PIXSZEX : 16;        /*!< Specify the pixel size of the layer 1 in the X dimension                  */
    } LAYER1SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER1ADDR;                  /*!< The start address of the framebuffer to be accessed by layer
                                                     1.                                                                        */

    struct {
      __IOM uint32_t LAYER1STARTADDRFBUF : 32;  /*!< Specify the start address of framebuffer for each layer 1.                */
    } LAYER1ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER1STRIDE;                /*!< Specify the stride and the AXI bus burst of layer 1.                      */

    struct {
      __IOM uint32_t LAYER1STRIDEDIST : 16;     /*!< Specify the stride, which is the distance from line to line
                                                     in bytes for each layer 1 memory                                          */
      __IOM uint32_t LAYER1AXIBURSTBITS : 3;    /*!< Specify the AXI bits per burst in layer 1                                 */
      __IOM uint32_t LAYER1AXIFIFOTHLD : 2;     /*!< Specify the AXI fifo threshold burst start in layer 1                     */
      __IOM uint32_t RSVD       : 11;           /*!< This field is reserved.                                                   */
    } LAYER1STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER1RESXY;                 /*!< X and Y dimensions for the resolution of layer 1.                         */

    struct {
      __IOM uint32_t LAYER1PIXRESY : 16;        /*!< Specify the layer n pixel resolution in the Y dimension                   */
      __IOM uint32_t LAYER1PIXRESX : 16;        /*!< Specify the layer n pixel resolution in the X dimension                   */
    } LAYER1RESXY_b;
  } ;

  union {
    __IOM uint32_t LAYER1SCALEX;                /*!< Scale X factor of layer 1.                                                */

    struct {
      __IOM uint32_t LAYER1XFACTOR : 32;        /*!< Specify the scale X factor of layer n (4.14 fixed point number)           */
    } LAYER1SCALEX_b;
  } ;

  union {
    __IOM uint32_t LAYER1SCALEY;                /*!< Scale Y factor of layer 1.                                                */

    struct {
      __IOM uint32_t LAYER1YFACTOR : 32;        /*!< Specify the scale Y factor of layer n (4.14 fixed point number)           */
    } LAYER1SCALEY_b;
  } ;

  union {
    __IOM uint32_t LAYER2MODE;                  /*!< Activate and set-up layer 2.                                              */

    struct {
      __IOM uint32_t LAYER2COLORMODE : 5;       /*!< Color mode                                                                */
      __IOM uint32_t RSVD0      : 3;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER2SBLEND : 4;          /*!< Source blending function                                                  */
      __IOM uint32_t LAYER2DBLEND : 4;          /*!< Destination blending function                                             */
      __IOM uint32_t LAYER2ALPHA : 8;           /*!< Alpha layer global value (0x00-0xFF range)                                */
      __IOM uint32_t RSVD1      : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER2GAMMA : 1;           /*!< When set to 1, Gamma Look Up Table is enabled                             */
      __IOM uint32_t LAYER2HLOCK : 1;           /*!< When set to 1, HLOCK signal on AHB DMAs is asserted                       */
      __IOM uint32_t LAYER2PREMULT : 1;         /*!< When set to 1, premultiply image alpha is enabled                         */
      __IOM uint32_t LAYER2BFILTER : 1;         /*!< When set to 1, bilinear filtering is enabled                              */
      __IOM uint32_t LAYER2FORCE : 1;           /*!< When set to 1, force alpha with global alpha is enabled                   */
      __IOM uint32_t LAYER2EN   : 1;            /*!< When set to 1, layer n is enabled                                         */
    } LAYER2MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER2STARTXY;               /*!< X and Y start dimensions of layer 2.                                      */

    struct {
      __IOM uint32_t LAYER2YOFF : 16;           /*!< Specify the pixel offset of the starting Y dimension of layer
                                                     2                                                                         */
      __IOM uint32_t LAYER2XOFF : 16;           /*!< Specify the pixel offset of the starting X dimension of layer
                                                     2                                                                         */
    } LAYER2STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER2SIZEXY;                /*!< X and Y size of layer 2.                                                  */

    struct {
      __IOM uint32_t LAYER2PIXSZEY : 16;        /*!< Specify the pixel size of the layer 2 in the Y dimension                  */
      __IOM uint32_t LAYER2PIXSZEX : 16;        /*!< Specify the pixel size of the layer 2 in the X dimension                  */
    } LAYER2SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER2ADDR;                  /*!< The start address of the framebuffer to be accessed by layer
                                                     2.                                                                        */

