AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DCID       : 32;           /*!< Fixed value for DC ID                                                     */
    } IDREG_b;
  } ;

  union {
    __IOM uint32_t INTERRUPT;                   /*!< Register interrupts enabled, level or edge enabled.                       */

    struct {
      __IOM uint32_t INTVSYNCEN : 1;            /*!< When set to 1, VSYNC interrupt enabled                                    */
      __IOM uint32_t INTHSYNCEN : 1;            /*!< When set to 1, HSYNC interrupt enabled                                    */
      __IOM uint32_t INTMMUERR  : 1;            /*!< When set to 1, MMU error interrupt enabled                                */
      __IOM uint32_t INTTEEN    : 1;            /*!< When set to 1, TE interrupt enabled                                       */
            uint32_t            : 27;
      __IOM uint32_t INTTRIGGER : 1;            /*!< Interrupt request trigger control                                         */
    } INTERRUPT_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< DSI Status register (interrupt and pending activity)                      */

    struct {
      __IOM uint32_t STATNOTBLANK : 1;          /*!< Indicates that the controller is not in active vertical blanking          */
      __IOM uint32_t STATDE     : 1;            /*!< Indicates the DE signal status (0 or 1) at the current time
                                                     of reading                                                                */
      __IOM uint32_t STATHSYNC  : 1;            /*!< Indicates the HSYNC signal status (0 or 1) at the current time
                                                     of reading                                                                */
      __IOM uint32_t STATVSYNC  : 1;            /*!< Indicates the VSYNC signal status and the tearing e?ect signal
                                                     status (0 or 1) at the current time of reading                            */
      __IOM uint32_t STATCSYNC  : 1;            /*!< Indicates the CSYNC signal status (0 or 1) at the current time
                                                     of reading                                                                */
      __IOM uint32_t STATLAST   : 1;            /*!< Indicates that the last row is currently displayed                        */
      __IOM uint32_t STATUF     : 1;            /*!< Indicates current underflow                                               */
      __IOM uint32_t STATSTICKY : 1;            /*!< Indicates sticky underflow. This bit clears when interrupt register
                                                     is written                                                                */
      __IOM uint32_t STATTEAR   : 1;            /*!< Indicates DBI Type-B tearing effect                                       */
            uint32_t            : 1;
      __IOM uint32_t STATDBIRGB : 1;            /*!< Indicates pending RGB data in DBI interface                               */
      __IOM uint32_t STATDBIPENDCOM : 1;        /*!< Indicates pending commands in DBI interface                               */
      __IOM uint32_t STATDBIPENDTRANS : 1;      /*!< Indicates pending output transaction in DBI interface                     */
            uint32_t            : 19;
    } STATUS_b;
  } ;

  union {
    __IOM uint32_t COLMOD;                      /*!< Color mode status register indicating formats/back pressure
                                                     are enabled.                                                              */

    struct {
      __IOM uint32_t CLMDTSC4TSC6 : 1;          /*!< Indicates that the TSc4/TSc6 propietary color format is enabled           */
      __IOM uint32_t CLMDTLYUV420 : 1;          /*!< Indicates that the TLYUV420 color format is enabled                       */
      __IOM uint32_t CLMDVYUV420 : 1;           /*!< Indicates that the V_YUV420 color format is enabled                       */
      __IOM uint32_t CLMDBGRA8888 : 1;          /*!< Indicates that the BGRA8888 32-bit color format is enabled                */
      __IOM uint32_t CLMDABGR8888 : 1;          /*!< Indicates that the ABGR8888 32-bit color format is enabled                */
      __IOM uint32_t CLMDYUY2   : 1;            /*!< Indicates that the YUY2 color format is enabled                           */
      __IOM uint32_t CLMDRGB888 : 1;            /*!< Indicates that the RGB888 24-bit color format is enabled                  */
      __IOM uint32_t CLMDYUYV   : 1;            /*!< Indicates that the YUYV color format is enabled                           */
      __IOM uint32_t CLMDL4     : 1;            /*!< Indicates that the L4 color format is enabled                             */
      __IOM uint32_t CLMDL1     : 1;            /*!< Indicates that the L1 color format is enabled                             */
      __IOM uint32_t CLMDL8     : 1;            /*!< Indicates that the L8 color format is enabled                             */
      __IOM uint32_t CLMDARGB8888 : 1;          /*!< Indicates that the ARGB8888 32-bit color format is enabled                */
      __IOM uint32_t CLMDRGB565 : 1;            /*!< Indicates that the RGB565 16-bit color format is enabled                  */
      __IOM uint32_t CLMDRGB332 : 1;            /*!< Indicates that the RGB332 8-bit color format is enabled                   */
      __IOM uint32_t CLMDRGBA8888 : 1;          /*!< Indicates that the RGBA8888 32-bit color format is enabled                */
      __IOM uint32_t CLMDRGBA5551 : 1;          /*!< Indicates that the RGBA5551 16-bit color format is enabled                */
      __IOM uint32_t CLMDLUT8   : 1;            /*!< Indicates that the LUT8 color format is enabled                           */
            uint32_t            : 14;
      __IOM uint32_t CLMDBKPRESSURE : 1;        /*!< Indicates that back pressure support for the DBI Type B interface
                                                     is enabled                                                                */
    } COLMOD_b;
  } ;
  __IM  uint32_t  RESERVED3[32];

  union {
    __IOM uint32_t CRC;                         /*!< if cyclic redundancy errors occur, they are written in the CRC
                                                     register.                                                                 */

