AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t PBITS      : 4;            /*!< Polarity bits                                                             */
            uint32_t            : 28;
    } POLARITY_b;
  } ;

  union {
    __IOM uint32_t CLKLANESWT;                  /*!< High speed to low power switching time in terms ofbyte clock
                                                     (txbyteclkhs)                                                             */

    struct {
      __IOM uint32_t HISPLPSW   : 16;           /*!< High speed to low power switching time in terms byte clock (txbyteclkhs).
                                                     This value is based on the byte clock (txbyteclkhs) and
                                                     low power clock frequency; HS to LP switch count = Tclk_trail
                                                     + THS_Exit + 3 byteclk Tclk_trail = programmed value of
                                                     cln_cnt_hs_trail in AHB Reg 70h bit (23:16) THS_Exit =
                                                     programmed value of cln_cnt_hs_exit in AHB Reg 70h bit
                                                     (31:24) Typical value - Number of byte clocks request to
                                                     switch from high speed mode to low power mode after txrequesths_clk
                                                     is de-asserted.                                                           */
      __IOM uint32_t LOWPWR2HI  : 16;           /*!< This value is based on the byte clock (txbyteclkhs) and low
                                                     power clock frequency (txclkesc)LP to HS switch count =
                                                     4 * Tlpx + (programmed Tclk_prep + extracount (1 byteclk)
                                                     ) + (programmed Tclk_zero + extracount (1 byteclk) ) +
                                                     Tclk_pre + 2 byteclk Tlpx = Low power clock equivalence
                                                     in terms of byte clock programmed in AHB reg 68h Tclk_prep
                                                     = programmed value of cln_cnt_prep in AHB Reg 70h bit (7:0)
                                                     Tclk_zero = programmed value of cln_cnt_zero in AHB Reg
                                                     70h bit (15:8) Tclk_pre = 8 UI Typical value x96 Number
                                                     of byte clocks required to switch from low power mode to
                                                     high speed mode after txrequesths_clk is asserted.                        */
    } CLKLANESWT_b;
  } ;

  union {
    __IOM uint32_t LPBYTECLK;                   /*!< Low power clock equivalence in terms of byte clock.                       */

    struct {
      __IOM uint32_t VALBYTECLK : 16;           /*!< The value programmed in this register is equal to the number
                                                     of byte clocks occupied in one low power clock; this value
                                                     is based on the byte clock (txbyteclkhs) and low power
                                                     clock frequency (txclkesc)                                                */
            uint32_t            : 16;
    } LPBYTECLK_b;
  } ;

  union {
    __IOM uint32_t DPHYPARAM;                   /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed preparation time.                                          */

    struct {
      __IOM uint32_t HSPREP     : 8;            /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed preparation time. This corresponds to the
                                                     THS-PREP parameter specified in the DPHY specificaton                     */
      __IOM uint32_t HSZERO     : 8;            /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed drive zero time. This corresponds to the
                                                     THS-ZERO parameter specified in the DPHY specification                    */
      __IOM uint32_t HSTRAIL    : 8;            /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed trail time; this corresponds to the THS-TRAIL
                                                     parameter specified in the DPHY specification                             */
      __IOM uint32_t HSEXIT     : 8;            /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed exit time; this corresponds to the THS-EXIT
                                                     parameter specified in the DPHY specification                             */
    } DPHYPARAM_b;
  } ;

  union {
    __IOM uint32_t CLKLANETIMPARM;              /*!< This field provides the timing requirement in byte clocks                 */

    struct {
      __IOM uint32_t HSPREP     : 8;            /*!< This field provides the timing requirement in byte corresponds
                                                     to the TCLK-PREP parameter specified in the DPHY specificatio             */
      __IOM uint32_t HSZERO     : 8;            /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed drive zero time; this corresponds to the
                                                     TCLK-ZERO parameter specified in the DPHY specification                   */
      __IOM uint32_t HSTRAIL    : 8;            /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed trail time; This corresponds to the TCLK-TRAIL
                                                     parameter specified in the DPHY specification                             */
      __IOM uint32_t HSEXIT     : 8;            /*!< This field provides the timing requirement in byte clocks for
                                                     the high speed exit time; This corresponds to the THS-EXIT
                                                     parameter specified in the DPHY specification.                            */
    } CLKLANETIMPARM_b;
  } ;

  union {
    __IOM uint32_t RSTENBDFE;                   /*!< This field provides the reset (enable) to the DFE                         */

