AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< This field provides the reset (enable) to the DFE.                        */
            uint32_t            : 31;
    } RSTENBDFE_b;
  } ;

  union {
    __IOM uint32_t AFETRIM0;                    /*!< Afe Trim reg0                                                             */

    struct {
      __IOM uint32_t AFETRIM0   : 32;           /*!< Afe Trim reg0.                                                            */
    } AFETRIM0_b;
  } ;

  union {
    __IOM uint32_t AFETRIM1;                    /*!< Afe Trim reg1                                                             */

    struct {
      __IOM uint32_t AFETRIM1   : 32;           /*!< Afe Trim reg1.                                                            */
    } AFETRIM1_b;
  } ;

  union {
    __IOM uint32_t AFETRIM2;                    /*!< Afe Trim reg2                                                             */

    struct {
      __IOM uint32_t AFETRIM2   : 32;           /*!< Afe Trim reg2.                                                            */
    } AFETRIM2_b;
  } ;

  union {
    __IOM uint32_t AFETRIM3;                    /*!< Afe Trim reg3                                                             */

    struct {
      __IOM uint32_t AFETRIM3   : 32;           /*!< Afe Trim reg3.                                                            */
    } AFETRIM3_b;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t ERRORAUTORCOV;               /*!< Errir ayti recivert register                                              */

    struct {
      __IOM uint32_t ECCMULERRCLR : 1;          /*!< if this bit is set to 1, Ecc_mul_err_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t INVLDDTCLR : 1;            /*!< If this bit is set to 1, Invld_dt_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t HICONTCLR  : 1;            /*!< If this bit is set to 1, Hi_cont_clr error recover action is
                                                     taken immediately by DSI TX                                               */
      __IOM uint32_t LOCONTCLR  : 1;            /*!< If this bit is set to 1, lo_cont_clr error recovery action is
                                                     taken immediately by DSI TX                                               */
      __IOM uint32_t HSRXTIMEOUTCLR : 1;        /*!< If this bit is set to 1, Hs_rx_timeout_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t LPRXTIMEOUTCLR : 1;        /*!< If this bit is set to 1, lp_rx_timeout_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
            uint32_t            : 26;
    } ERRORAUTORCOV_b;
  } ;

  union {
    __IOM uint32_t MIPIDIRDPIDIFF;              /*!< Mipi direction DPI difference                                             */

    struct {
      __IOM uint32_t MIPIDIR    : 1;            /*!< This field provides the direction of MIPI bus;                            */
            uint32_t            : 14;
      __IOM uint32_t DPIHIGH    : 1;            /*!< This field provides information to check DPI line time is greater
                                                     or DSI line time is greater                                               */
      __IOM uint32_t DPIDIFF    : 16;           /*!< This field provides the difference in one line time between
                                                     DPI and DSI                                                               */
    } MIPIDIRDPIDIFF_b;
  } ;

  union {
    __IOM uint32_t DATALANEPOLSWAP;             /*!< Data lane polarity swap register                                          */

    struct {
      __IOM uint32_t DATALNPOLSWAP : 4;         /*!< Data lane Polarity sw                                                     */
            uint32_t            : 28;
    } DATALANEPOLSWAP_b;
  } ;
} DSI_Type;                                     /*!< Size = 164 (0xa4)                                                         */



/* =========================================================================================================================== */
/* ================                                            DSP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DSP Control Interface (DSP)
  */

typedef struct {                                /*!< DSP Structure                                                             */
  __IM  uint32_t  RESERVED[16];

  union {
    __IOM uint32_t MUTEX0;                      /*!< MUTEX 0                                                                   */

    struct {
      __IOM uint32_t MUTEX0     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX0_b;
  } ;

  union {
    __IOM uint32_t MUTEX1;                      /*!< MUTEX 1                                                                   */

    struct {
      __IOM uint32_t MUTEX1     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX1_b;
  } ;

  union {
    __IOM uint32_t MUTEX2;                      /*!< MUTEX 2                                                                   */

