AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t MUTEX2     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX2_b;
  } ;

  union {
    __IOM uint32_t MUTEX3;                      /*!< MUTEX 3                                                                   */

    struct {
      __IOM uint32_t MUTEX3     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX3_b;
  } ;

  union {
    __IOM uint32_t MUTEX4;                      /*!< MUTEX 4                                                                   */

    struct {
      __IOM uint32_t MUTEX4     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX4_b;
  } ;

  union {
    __IOM uint32_t MUTEX5;                      /*!< MUTEX 5                                                                   */

    struct {
      __IOM uint32_t MUTEX5     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX5_b;
  } ;

  union {
    __IOM uint32_t MUTEX6;                      /*!< MUTEX 6                                                                   */

    struct {
      __IOM uint32_t MUTEX6     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX6_b;
  } ;

  union {
    __IOM uint32_t MUTEX7;                      /*!< MUTEX 7                                                                   */

    struct {
      __IOM uint32_t MUTEX7     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX7_b;
  } ;
  __IM  uint32_t  RESERVED1[8];

  union {
    __IOM uint32_t CPUMBINTSET;                 /*!< CPU Mailbox Interrupt Set                                                 */

    struct {
      __IOM uint32_t CPUMBINTSET : 32;          /*!< CPU Mailbox interrupt Set. The corresponding data bit will set
                                                     the interrupt.                                                            */
    } CPUMBINTSET_b;
  } ;

  union {
    __IOM uint32_t CPUMBINTCLR;                 /*!< CPU Mailbox Interrupt Clear                                               */

    struct {
      __IOM uint32_t CPUMBINTCLR : 32;          /*!< CPU Mailbox interrupt Clear. The corresponding data bit will
                                                     clear the interrupt.                                                      */
    } CPUMBINTCLR_b;
  } ;

  union {
    __IOM uint32_t CPUMBINTSTAT;                /*!< CPU Mailbox Interrupt Status                                              */

    struct {
      __IOM uint32_t CPUMBINTSTAT : 32;         /*!< CPU CPU Mailbox interrupt status                                          */
    } CPUMBINTSTAT_b;
  } ;

  union {
    __IOM uint32_t CPUCPUMBDATA;                /*!< CPU CPU Mailbox Data                                                      */

    struct {
      __IOM uint32_t CPUCPUMBDATA : 32;         /*!< CPU CPU Mailbox data                                                      */
    } CPUCPUMBDATA_b;
  } ;

  union {
    __IOM uint32_t DSP0CPUMBDATA;               /*!< DSP0 to CPU Mailbox Data                                                  */

    struct {
      __IOM uint32_t DSP0CPUMBDATA : 32;        /*!< DSP0 to CPU Mailbox data                                                  */
    } DSP0CPUMBDATA_b;
  } ;

  union {
    __IOM uint32_t DSP1CPUMBDATA;               /*!< DSP1 to CPU Mailbox Data                                                  */

    struct {
      __IOM uint32_t DSP1CPUMBDATA : 32;        /*!< DSP1 to CPU Mailbox data                                                  */
    } DSP1CPUMBDATA_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t DSP0MBINTSET;                /*!< DSP0 Mailbox Interrupt Set                                                */

    struct {
      __IOM uint32_t DSP0MBINTSET : 32;         /*!< DSP0 Mailbox interrupt Set. The corresponding data bit will
                                                     set the interrupt.                                                        */
    } DSP0MBINTSET_b;
  } ;

  union {
    __IOM uint32_t DSP0MBINTCLR;                /*!< DSP0 Mailbox Interrupt Clear                                              */

    struct {
      __IOM uint32_t DSP0MBINTCLR : 32;         /*!< DSP0 Mailbox interrupt Clear. The corresponding data bit will
                                                     clear the interrupt.                                                      */
    } DSP0MBINTCLR_b;
  } ;

  union {
    __IOM uint32_t DSP0MBINTSTAT;               /*!< DSP 0 Mailbox Interrupt Status                                            */

    struct {
      __IOM uint32_t DSP0MBINTSTAT : 32;        /*!< DSP 0 CPU Mailbox interrupt                                               */
    } DSP0MBINTSTAT_b;
  } ;

  union {
    __IOM uint32_t CPUDSP0MBDATA;               /*!< CPU to DSP 0 Mailbox Data                                                 */

