AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP0RAWIRQSTAT63to32 : 32; /*!< DSP 0 Raw IRQ63-32 Status                                                 */
    } DSP0RAWIRQSTAT63to32_b;
  } ;

  union {
    __IOM uint32_t DSP0RAWIRQSTAT95to64;        /*!< DSP 0 Raw IRQ95-64 Status                                                 */

    struct {
      __IOM uint32_t DSP0RAWIRQSTAT95to64 : 32; /*!< DSP 0 Raw IRQ95-64 Status                                                 */
    } DSP0RAWIRQSTAT95to64_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t DSP0L2LVLINT;                /*!< DSP 0 L2 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP0L2LVLINT : 19;         /*!< DSP 0 L2 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP0L2LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP0L3LVLINT;                /*!< DSP 0 L3 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP0L3LVLINT : 19;         /*!< DSP 0 L3 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP0L3LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP0L4LVLINT;                /*!< DSP 0 L4 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP0L4LVLINT : 19;         /*!< DSP 0 L4 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP0L4LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP0L5LVLINT;                /*!< DSP 0 L5 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP0L5LVLINT : 19;         /*!< DSP 0 L5 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP0L5LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP0IDMATRIGCTL;             /*!< DSP 0 IDMA Trigger Control and Status                                     */

    struct {
      __IOM uint32_t DSP0IDMATRIGSTAT : 1;      /*!< DSP 0 iDMA Trigger Status                                                 */
            uint32_t            : 3;
      __IOM uint32_t DSP0IDMATRIGPULSE : 1;     /*!< DSP 0 iDMA Trigger Pulse - When written a '1', this will cause
                                                     a single step enable (valid only when IDMATRIG is set to
                                                     SSTEP)                                                                    */
            uint32_t            : 27;
    } DSP0IDMATRIGCTL_b;
  } ;
  __IM  uint32_t  RESERVED6[3];

  union {
    __IOM uint32_t DSP0INTORMASK31TO0A;         /*!< DSP0 Interrupt OR Mask A for IRQ31-0                                      */

    struct {
      __IOM uint32_t DSP0INTMCUIOORMASKA : 32;  /*!< DSP0 MCU IO Interrupt OR Mask A                                           */
    } DSP0INTORMASK31TO0A_b;
  } ;

  union {
    __IOM uint32_t DSP0INTORMASK63TO32A;        /*!< DSP0 Interrupt OR Mask A for IRQ63-32                                     */

    struct {
      __IOM uint32_t DSP0TMRORMASKA : 10;       /*!< DSP0 Timer Interrupt OR Mask A                                            */
            uint32_t            : 2;
      __IOM uint32_t DSP0I2SORMASKA : 4;        /*!< DSP0 I2S Interrupt OR Mask A                                              */
      __IOM uint32_t DSP0PDMORMASKA : 4;        /*!< DSP0 PDM Interrupt OR Mask A                                              */
            uint32_t            : 4;
      __IOM uint32_t DSP0GPIOORMASKA : 6;       /*!< DSP0 GPIO Interrupt OR Mask A                                             */
            uint32_t            : 2;
    } DSP0INTORMASK63TO32A_b;
  } ;

  union {
    __IOM uint32_t DSP0INTORMASK95TO64A;        /*!< DSP0 Interrupt OR Mask A for IRQ95-64                                     */

    struct {
      __IOM uint32_t DSP0MBINTORMASKA : 32;     /*!< DSP0 Mailbox Interrupt OR Mask A                                          */
    } DSP0INTORMASK95TO64A_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t DSP0INTORMASK31to0B;         /*!< DSP0 Interrupt OR Mask B for IRQ31-0                                      */

    struct {
      __IOM uint32_t DSP0INTMCUIOORMASKB : 32;  /*!< DSP0 MCU IO Interrupt OR Mask B                                           */
    } DSP0INTORMASK31to0B_b;
  } ;

  union {
    __IOM uint32_t DSP0INTORMASK63TO32B;        /*!< DSP0 Interrupt OR Mask A for IRQ63-32                                     */

    struct {
      __IOM uint32_t DSP0TMRORMASKB : 10;       /*!< DSP0 Timer Interrupt OR Mask B                                            */
            uint32_t            : 2;
      __IOM uint32_t DSP0I2SORMASKB : 4;        /*!< DSP0 I2S Interrupt OR Mask B                                              */
      __IOM uint32_t DSP0PDMORMASKB : 4;        /*!< DSP0 PDM Interrupt OR Mask B                                              */
            uint32_t            : 4;
      __IOM uint32_t DSP0GPIOORMASKB : 6;       /*!< DSP0 GPIO Interrupt OR Mask B                                             */
            uint32_t            : 2;
    } DSP0INTORMASK63TO32B_b;
  } ;

  union {
    __IOM uint32_t DSP0INTORMASK95TO64B;        /*!< DSP0 Interrupt OR Mask B for IRQ95-64                                     */

    struct {
      __IOM uint32_t DSP0MBINTORMASKB : 32;     /*!< DSP0 Mailbox Interrupt OR Mask B                                          */
    } DSP0INTORMASK95TO64B_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t DSP0INTENIRQ31TO0;           /*!< DSP0 INT Enable for IRQ31-0                                               */

    struct {
      __IOM uint32_t DSP0INTENIRQ31TO0 : 32;    /*!< DSP0 INT Enable for IRQ31-0                                               */
    } DSP0INTENIRQ31TO0_b;
  } ;

  union {
    __IOM uint32_t DSP0INTENIRQ63TO32;          /*!< DSP0 INT Enable for IRQ63-32                                              */

