AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP0INTENIRQ63TO32 : 32;   /*!< DSP0 INT Enable for IRQ63-32                                              */
    } DSP0INTENIRQ63TO32_b;
  } ;

  union {
    __IOM uint32_t DSP0INTENIRQ95TO64;          /*!< DSP0 INT Enable for IRQ95-64                                              */

    struct {
      __IOM uint32_t DSP0INTENIRQ95TO64 : 32;   /*!< DSP0 INT Enable for IRQ95-64                                              */
    } DSP0INTENIRQ95TO64_b;
  } ;
  __IM  uint32_t  RESERVED9[37];

  union {
    __IOM uint32_t DSP1CONTROL;                 /*!< DSP 1 control settings                                                    */

    struct {
      __IOM uint32_t DSP1STATVECSEL : 1;        /*!< DSP 1 StatVectorSel                                                       */
      __IOM uint32_t DSP1BRESET : 1;            /*!< DSP1 BReset. This is the reset used for Xtensa core. S/w must
                                                     clear this reset to use Dsp.                                              */
      __IOM uint32_t DSP1DRESET : 1;            /*!< DSP1 DReset. This is the reset used for debug functionality
                                                     like OCD/TRAX etc.                                                        */
      __IOM uint32_t DSP1RUNSTALL : 1;          /*!< DSP 1 RunStall. When asserted, DSP 1 will stall until bit is
                                                     cleared.                                                                  */
      __IOM uint32_t DSP1IDMATRIG : 2;          /*!< DSP 1 IDMA Trigger Control                                                */
            uint32_t            : 2;
      __IOM uint32_t DSP1IDMAXTRIGSRC : 23;     /*!< DSP 1 IDMA Cross Trigger Source. All enabled sources are ANDed
                                                     to generate a trigger enable.
                                                     Bit30-12:IRQ18-0 Bit11: IDMATRIGPULSE, Bit10: DSP Timer1,
                                                     Bit9: DSP Timer0, Bit8: alternate DSP iDMA trigger out                    */
            uint32_t            : 1;
    } DSP1CONTROL_b;
  } ;

  union {
    __IOM uint32_t DSP1RESETVEC;                /*!< DSP 1 Reset Vector                                                        */

    struct {
      __IOM uint32_t DSP1RESETVEC : 32;         /*!< DSP 1 Reset Vector Address.                                               */
    } DSP1RESETVEC_b;
  } ;

  union {
    __IOM uint32_t DSP1IRQMASK;                 /*!< DSP 1 IRQ Mask                                                            */

    struct {
      __IOM uint32_t DSP1IRQMASK : 23;          /*!< DSP 1 IRQ Mask                                                            */
            uint32_t            : 9;
    } DSP1IRQMASK_b;
  } ;

  union {
    __IOM uint32_t DSP1WAKEMASK;                /*!< DSP 1 IRQ Wake Mask                                                       */

    struct {
      __IOM uint32_t DSP1WAKEMASK : 23;         /*!< DSP 1 IRQ Wake Mask                                                       */
            uint32_t            : 9;
    } DSP1WAKEMASK_b;
  } ;

  union {
    __IOM uint32_t DSP1RAWIRQSTAT31to0;         /*!< DSP 1 Raw IRQ31-0 Status                                                  */

    struct {
      __IOM uint32_t DSP1RAWIRQSTAT31to0 : 32;  /*!< DSP 1 Raw IRQ31-0 Status                                                  */
    } DSP1RAWIRQSTAT31to0_b;
  } ;

  union {
    __IOM uint32_t DSP1RAWIRQSTAT63to32;        /*!< DSP 1 Raw IRQ63-32 Status                                                 */

    struct {
      __IOM uint32_t DSP1RAWIRQSTAT63to32 : 32; /*!< DSP 1 Raw IRQ63-32 Status                                                 */
    } DSP1RAWIRQSTAT63to32_b;
  } ;

  union {
    __IOM uint32_t DSP1RAWIRQSTAT95to64;        /*!< DSP 1 Raw IRQ95-64 Status                                                 */

    struct {
      __IOM uint32_t DSP1RAWIRQSTAT95to64 : 32; /*!< DSP 1 Raw IRQ95-64 Status                                                 */
    } DSP1RAWIRQSTAT95to64_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t DSP1L2LVLINT;                /*!< DSP 1 L2 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L2LVLINT : 19;         /*!< DSP 1 L2 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L2LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1L3LVLINT;                /*!< DSP 1 L3 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L3LVLINT : 19;         /*!< DSP 1 L3 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L3LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1L4LVLINT;                /*!< DSP 1 L4 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L4LVLINT : 19;         /*!< DSP 1 L4 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L4LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1L5LVLINT;                /*!< DSP 1 L5 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L5LVLINT : 19;         /*!< DSP 1 L5 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L5LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1IDMATRIGCTL;             /*!< DSP 1 IDMA Trigger Control and Status                                     */

    struct {
      __IOM uint32_t DSP1IDMATRIGSTAT : 1;      /*!< DSP 1 iDMA Trigger Status                                                 */
            uint32_t            : 3;
      __IOM uint32_t DSP1IDMATRIGPULSE : 1;     /*!< DSP 1 iDMA Trigger Pulse - When written a '1', this will cause
                                                     a single step enable (valid only when IDMATRIG is set to
                                                     SSTEP)                                                                    */
            uint32_t            : 27;
    } DSP1IDMATRIGCTL_b;
  } ;
  __IM  uint32_t  RESERVED11[3];

  union {
    __IOM uint32_t DSP1INTORMASK31TO0A;         /*!< DSP1 Interrupt OR Mask A for IRQ31-0                                      */

