AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL1    : 4;            /*!< Function select for GPIO pin 1                                            */
      __IOM uint32_t INPEN1     : 1;            /*!< Input enable for GPIO 1                                                   */
      __IOM uint32_t RDZERO1    : 1;            /*!< Return 0 for read data on GPIO 1                                          */
      __IOM uint32_t IRPTEN1    : 2;            /*!< Interrupt enable for GPIO 1                                               */
      __IOM uint32_t OUTCFG1    : 2;            /*!< Pin IO mode selection for GPIO pin 1                                      */
      __IOM uint32_t DS1        : 2;            /*!< Drive strength selection for GPIO 1                                       */
      __IOM uint32_t SR1        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG1   : 3;            /*!< Pullup/Pulldown configuration for GPIO 1                                  */
      __IOM uint32_t NCESRC1    : 6;            /*!< IOMSTR/MSPI N Chip Select 1, DISP control signals DE, CSX, and
                                                     CS. Polarity is determined by CE_POLARITY field                           */
      __IOM uint32_t NCEPOL1    : 1;            /*!< Polarity select for NCE for GPIO 1                                        */
            uint32_t            : 3;
      __IOM uint32_t FIEN1      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN1      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG1_b;
  } ;

  union {
    __IOM uint32_t PINCFG2;                     /*!< Controls the operation of GPIO pin 2.                                     */

    struct {
      __IOM uint32_t FNCSEL2    : 4;            /*!< Function select for GPIO pin 2                                            */
      __IOM uint32_t INPEN2     : 1;            /*!< Input enable for GPIO 2                                                   */
      __IOM uint32_t RDZERO2    : 1;            /*!< Return 0 for read data on GPIO 2                                          */
      __IOM uint32_t IRPTEN2    : 2;            /*!< Interrupt enable for GPIO 2                                               */
      __IOM uint32_t OUTCFG2    : 2;            /*!< Pin IO mode selection for GPIO pin 2                                      */
      __IOM uint32_t DS2        : 2;            /*!< Drive strength selection for GPIO 2                                       */
      __IOM uint32_t SR2        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG2   : 3;            /*!< Pullup/Pulldown configuration for GPIO 2                                  */
      __IOM uint32_t NCESRC2    : 6;            /*!< IOMSTR/MSPI N Chip Select 2, DISP control signals DE, CSX, and
                                                     CS. Polarity is determined by CE_POLARITY field                           */
      __IOM uint32_t NCEPOL2    : 1;            /*!< Polarity select for NCE for GPIO 2                                        */
            uint32_t            : 3;
      __IOM uint32_t FIEN2      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN2      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG2_b;
  } ;

  union {
    __IOM uint32_t PINCFG3;                     /*!< Controls the operation of GPIO pin 3.                                     */

    struct {
      __IOM uint32_t FNCSEL3    : 4;            /*!< Function select for GPIO pin 3                                            */
      __IOM uint32_t INPEN3     : 1;            /*!< Input enable for GPIO 3                                                   */
      __IOM uint32_t RDZERO3    : 1;            /*!< Return 0 for read data on GPIO 3                                          */
      __IOM uint32_t IRPTEN3    : 2;            /*!< Interrupt enable for GPIO 3                                               */
      __IOM uint32_t OUTCFG3    : 2;            /*!< Pin IO mode selection for GPIO pin 3                                      */
      __IOM uint32_t DS3        : 2;            /*!< Drive strength selection for GPIO 3                                       */
      __IOM uint32_t SR3        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG3   : 3;            /*!< Pullup/Pulldown configuration for GPIO 3                                  */
      __IOM uint32_t NCESRC3    : 6;            /*!< IOMSTR/MSPI N Chip Select 3, DISP control signals DE, CSX, and
                                                     CS. Polarity is determined by CE_POLARITY field                           */
      __IOM uint32_t NCEPOL3    : 1;            /*!< Polarity select for NCE for GPIO 3                                        */
            uint32_t            : 3;
      __IOM uint32_t FIEN3      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN3      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG3_b;
  } ;

  union {
    __IOM uint32_t PINCFG4;                     /*!< Controls the operation of GPIO pin 4.                                     */

