AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL16   : 4;            /*!< Function select for GPIO pin 16                                           */
      __IOM uint32_t INPEN16    : 1;            /*!< Input enable for GPIO 16                                                  */
      __IOM uint32_t RDZERO16   : 1;            /*!< Return 0 for read data on GPIO 16                                         */
      __IOM uint32_t IRPTEN16   : 2;            /*!< Interrupt enable for GPIO 16                                              */
      __IOM uint32_t OUTCFG16   : 2;            /*!< Pin IO mode selection for GPIO pin 16                                     */
      __IOM uint32_t DS16       : 2;            /*!< Drive strength selection for GPIO 16                                      */
      __IOM uint32_t SR16       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG16  : 3;            /*!< Pullup/Pulldown configuration for GPIO 16                                 */
      __IOM uint32_t NCESRC16   : 6;            /*!< IOMSTR/MSPI N Chip Select 16, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL16   : 1;            /*!< Polarity select for NCE for GPIO 16                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN16     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN16     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG16_b;
  } ;

  union {
    __IOM uint32_t PINCFG17;                    /*!< Controls the operation of GPIO pin 17.                                    */

    struct {
      __IOM uint32_t FNCSEL17   : 4;            /*!< Function select for GPIO pin 17                                           */
      __IOM uint32_t INPEN17    : 1;            /*!< Input enable for GPIO 17                                                  */
      __IOM uint32_t RDZERO17   : 1;            /*!< Return 0 for read data on GPIO 17                                         */
      __IOM uint32_t IRPTEN17   : 2;            /*!< Interrupt enable for GPIO 17                                              */
      __IOM uint32_t OUTCFG17   : 2;            /*!< Pin IO mode selection for GPIO pin 17                                     */
      __IOM uint32_t DS17       : 2;            /*!< Drive strength selection for GPIO 17                                      */
      __IOM uint32_t SR17       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG17  : 3;            /*!< Pullup/Pulldown configuration for GPIO 17                                 */
      __IOM uint32_t NCESRC17   : 6;            /*!< IOMSTR/MSPI N Chip Select 17, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL17   : 1;            /*!< Polarity select for NCE for GPIO 17                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN17     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN17     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG17_b;
  } ;

  union {
    __IOM uint32_t PINCFG18;                    /*!< Controls the operation of GPIO pin 18.                                    */

    struct {
      __IOM uint32_t FNCSEL18   : 4;            /*!< Function select for GPIO pin 18                                           */
      __IOM uint32_t INPEN18    : 1;            /*!< Input enable for GPIO 18                                                  */
      __IOM uint32_t RDZERO18   : 1;            /*!< Return 0 for read data on GPIO 18                                         */
      __IOM uint32_t IRPTEN18   : 2;            /*!< Interrupt enable for GPIO 18                                              */
      __IOM uint32_t OUTCFG18   : 2;            /*!< Pin IO mode selection for GPIO pin 18                                     */
      __IOM uint32_t DS18       : 2;            /*!< Drive strength selection for GPIO 18                                      */
      __IOM uint32_t SR18       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG18  : 3;            /*!< Pullup/Pulldown configuration for GPIO 18                                 */
      __IOM uint32_t NCESRC18   : 6;            /*!< IOMSTR/MSPI N Chip Select 18, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL18   : 1;            /*!< Polarity select for NCE for GPIO 18                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN18     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN18     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG18_b;
  } ;

  union {
    __IOM uint32_t PINCFG19;                    /*!< Controls the operation of GPIO pin 19.                                    */

