AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL19   : 4;            /*!< Function select for GPIO pin 19                                           */
      __IOM uint32_t INPEN19    : 1;            /*!< Input enable for GPIO 19                                                  */
      __IOM uint32_t RDZERO19   : 1;            /*!< Return 0 for read data on GPIO 19                                         */
      __IOM uint32_t IRPTEN19   : 2;            /*!< Interrupt enable for GPIO 19                                              */
      __IOM uint32_t OUTCFG19   : 2;            /*!< Pin IO mode selection for GPIO pin 19                                     */
      __IOM uint32_t DS19       : 2;            /*!< Drive strength selection for GPIO 19                                      */
      __IOM uint32_t SR19       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG19  : 3;            /*!< Pullup/Pulldown configuration for GPIO 19                                 */
      __IOM uint32_t NCESRC19   : 6;            /*!< IOMSTR/MSPI N Chip Select 19, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL19   : 1;            /*!< Polarity select for NCE for GPIO 19                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN19     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN19     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG19_b;
  } ;

  union {
    __IOM uint32_t PINCFG20;                    /*!< Controls the operation of GPIO pin 20.                                    */

    struct {
      __IOM uint32_t FNCSEL20   : 4;            /*!< Function select for GPIO pin 20                                           */
      __IOM uint32_t INPEN20    : 1;            /*!< Input enable for GPIO 20                                                  */
      __IOM uint32_t RDZERO20   : 1;            /*!< Return 0 for read data on GPIO 20                                         */
      __IOM uint32_t IRPTEN20   : 2;            /*!< Interrupt enable for GPIO 20                                              */
      __IOM uint32_t OUTCFG20   : 2;            /*!< Pin IO mode selection for GPIO pin 20                                     */
      __IOM uint32_t DS20       : 2;            /*!< Drive strength selection for GPIO 20                                      */
      __IOM uint32_t SR20       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG20  : 3;            /*!< Pullup/Pulldown configuration for GPIO 20                                 */
      __IOM uint32_t NCESRC20   : 6;            /*!< IOMSTR/MSPI N Chip Select 20, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL20   : 1;            /*!< Polarity select for NCE for GPIO 20                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN20     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN20     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG20_b;
  } ;

  union {
    __IOM uint32_t PINCFG21;                    /*!< Controls the operation of GPIO pin 21.                                    */

    struct {
      __IOM uint32_t FNCSEL21   : 4;            /*!< Function select for GPIO pin 21                                           */
      __IOM uint32_t INPEN21    : 1;            /*!< Input enable for GPIO 21                                                  */
      __IOM uint32_t RDZERO21   : 1;            /*!< Return 0 for read data on GPIO 21                                         */
      __IOM uint32_t IRPTEN21   : 2;            /*!< Interrupt enable for GPIO 21                                              */
      __IOM uint32_t OUTCFG21   : 2;            /*!< Pin IO mode selection for GPIO pin 21                                     */
      __IOM uint32_t DS21       : 2;            /*!< Drive strength selection for GPIO 21                                      */
      __IOM uint32_t SR21       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG21  : 3;            /*!< Pullup/Pulldown configuration for GPIO 21                                 */
      __IOM uint32_t NCESRC21   : 6;            /*!< IOMSTR/MSPI N Chip Select 21, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL21   : 1;            /*!< Polarity select for NCE for GPIO 21                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN21     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN21     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG21_b;
  } ;

  union {
    __IOM uint32_t PINCFG22;                    /*!< Controls the operation of GPIO pin 22.                                    */

