AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL67   : 4;            /*!< Function select for GPIO pin 67                                           */
      __IOM uint32_t INPEN67    : 1;            /*!< Input enable for GPIO 67                                                  */
      __IOM uint32_t RDZERO67   : 1;            /*!< Return 0 for read data on GPIO 67                                         */
      __IOM uint32_t IRPTEN67   : 2;            /*!< Interrupt enable for GPIO 67                                              */
      __IOM uint32_t OUTCFG67   : 2;            /*!< Pin IO mode selection for GPIO pin 67                                     */
      __IOM uint32_t DS67       : 2;            /*!< Drive strength selection for GPIO 67                                      */
      __IOM uint32_t SR67       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG67  : 3;            /*!< Pullup/Pulldown configuration for GPIO 67                                 */
      __IOM uint32_t NCESRC67   : 6;            /*!< IOMSTR/MSPI N Chip Select 67, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL67   : 1;            /*!< Polarity select for NCE for GPIO 67                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN67     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN67     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG67_b;
  } ;

  union {
    __IOM uint32_t PINCFG68;                    /*!< Controls the operation of GPIO pin 68.                                    */

    struct {
      __IOM uint32_t FNCSEL68   : 4;            /*!< Function select for GPIO pin 68                                           */
      __IOM uint32_t INPEN68    : 1;            /*!< Input enable for GPIO 68                                                  */
      __IOM uint32_t RDZERO68   : 1;            /*!< Return 0 for read data on GPIO 68                                         */
      __IOM uint32_t IRPTEN68   : 2;            /*!< Interrupt enable for GPIO 68                                              */
      __IOM uint32_t OUTCFG68   : 2;            /*!< Pin IO mode selection for GPIO pin 68                                     */
      __IOM uint32_t DS68       : 2;            /*!< Drive strength selection for GPIO 68                                      */
      __IOM uint32_t SR68       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG68  : 3;            /*!< Pullup/Pulldown configuration for GPIO 68                                 */
      __IOM uint32_t NCESRC68   : 6;            /*!< IOMSTR/MSPI N Chip Select 68, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL68   : 1;            /*!< Polarity select for NCE for GPIO 68                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN68     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN68     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG68_b;
  } ;

  union {
    __IOM uint32_t PINCFG69;                    /*!< Controls the operation of GPIO pin 69.                                    */

    struct {
      __IOM uint32_t FNCSEL69   : 4;            /*!< Function select for GPIO pin 69                                           */
      __IOM uint32_t INPEN69    : 1;            /*!< Input enable for GPIO 69                                                  */
      __IOM uint32_t RDZERO69   : 1;            /*!< Return 0 for read data on GPIO 69                                         */
      __IOM uint32_t IRPTEN69   : 2;            /*!< Interrupt enable for GPIO 69                                              */
      __IOM uint32_t OUTCFG69   : 2;            /*!< Pin IO mode selection for GPIO pin 69                                     */
      __IOM uint32_t DS69       : 2;            /*!< Drive strength selection for GPIO 69                                      */
      __IOM uint32_t SR69       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG69  : 3;            /*!< Pullup/Pulldown configuration for GPIO 69                                 */
      __IOM uint32_t NCESRC69   : 6;            /*!< IOMSTR/MSPI N Chip Select 69, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL69   : 1;            /*!< Polarity select for NCE for GPIO 69                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN69     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN69     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG69_b;
  } ;

  union {
    __IOM uint32_t PINCFG70;                    /*!< Controls the operation of GPIO pin 70.                                    */

