AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL88   : 4;            /*!< Function select for GPIO pin 88                                           */
      __IOM uint32_t INPEN88    : 1;            /*!< Input enable for GPIO 88                                                  */
      __IOM uint32_t RDZERO88   : 1;            /*!< Return 0 for read data on GPIO 88                                         */
      __IOM uint32_t IRPTEN88   : 2;            /*!< Interrupt enable for GPIO 88                                              */
      __IOM uint32_t OUTCFG88   : 2;            /*!< Pin IO mode selection for GPIO pin 88                                     */
      __IOM uint32_t DS88       : 2;            /*!< Drive strength selection for GPIO 88                                      */
      __IOM uint32_t SR88       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG88  : 3;            /*!< Pullup/Pulldown configuration for GPIO 88                                 */
      __IOM uint32_t NCESRC88   : 6;            /*!< IOMSTR/MSPI N Chip Select 88, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL88   : 1;            /*!< Polarity select for NCE for GPIO 88                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN88     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN88     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG88_b;
  } ;

  union {
    __IOM uint32_t PINCFG89;                    /*!< Controls the operation of GPIO pin 89.                                    */

    struct {
      __IOM uint32_t FNCSEL89   : 4;            /*!< Function select for GPIO pin 89                                           */
      __IOM uint32_t INPEN89    : 1;            /*!< Input enable for GPIO 89                                                  */
      __IOM uint32_t RDZERO89   : 1;            /*!< Return 0 for read data on GPIO 89                                         */
      __IOM uint32_t IRPTEN89   : 2;            /*!< Interrupt enable for GPIO 89                                              */
      __IOM uint32_t OUTCFG89   : 2;            /*!< Pin IO mode selection for GPIO pin 89                                     */
      __IOM uint32_t DS89       : 2;            /*!< Drive strength selection for GPIO 89                                      */
      __IOM uint32_t SR89       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG89  : 3;            /*!< Pullup/Pulldown configuration for GPIO 89                                 */
      __IOM uint32_t NCESRC89   : 6;            /*!< IOMSTR/MSPI N Chip Select 89, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL89   : 1;            /*!< Polarity select for NCE for GPIO 89                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN89     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN89     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG89_b;
  } ;

  union {
    __IOM uint32_t PINCFG90;                    /*!< Controls the operation of GPIO pin 90.                                    */

    struct {
      __IOM uint32_t FNCSEL90   : 4;            /*!< Function select for GPIO pin 90                                           */
      __IOM uint32_t INPEN90    : 1;            /*!< Input enable for GPIO 90                                                  */
      __IOM uint32_t RDZERO90   : 1;            /*!< Return 0 for read data on GPIO 90                                         */
      __IOM uint32_t IRPTEN90   : 2;            /*!< Interrupt enable for GPIO 90                                              */
      __IOM uint32_t OUTCFG90   : 2;            /*!< Pin IO mode selection for GPIO pin 90                                     */
      __IOM uint32_t DS90       : 2;            /*!< Drive strength selection for GPIO 90                                      */
      __IOM uint32_t SR90       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG90  : 3;            /*!< Pullup/Pulldown configuration for GPIO 90                                 */
      __IOM uint32_t NCESRC90   : 6;            /*!< IOMSTR/MSPI N Chip Select 90, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL90   : 1;            /*!< Polarity select for NCE for GPIO 90                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN90     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN90     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG90_b;
  } ;

  union {
    __IOM uint32_t PINCFG91;                    /*!< Controls the operation of GPIO pin 91.                                    */

