AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL107  : 4;            /*!< Function select for GPIO pin 107                                          */
      __IOM uint32_t INPEN107   : 1;            /*!< Input enable for GPIO 107                                                 */
      __IOM uint32_t RDZERO107  : 1;            /*!< Return 0 for read data on GPIO 107                                        */
      __IOM uint32_t IRPTEN107  : 2;            /*!< Interrupt enable for GPIO 107                                             */
      __IOM uint32_t OUTCFG107  : 2;            /*!< Pin IO mode selection for GPIO pin 107                                    */
            uint32_t            : 22;
    } PINCFG107_b;
  } ;

  union {
    __IOM uint32_t PINCFG108;                   /*!< Controls the operation of virtual GPIO pin 108.                           */

    struct {
      __IOM uint32_t FNCSEL108  : 4;            /*!< Function select for GPIO pin 108                                          */
      __IOM uint32_t INPEN108   : 1;            /*!< Input enable for GPIO 108                                                 */
      __IOM uint32_t RDZERO108  : 1;            /*!< Return 0 for read data on GPIO 108                                        */
      __IOM uint32_t IRPTEN108  : 2;            /*!< Interrupt enable for GPIO 108                                             */
      __IOM uint32_t OUTCFG108  : 2;            /*!< Pin IO mode selection for GPIO pin 108                                    */
            uint32_t            : 22;
    } PINCFG108_b;
  } ;

  union {
    __IOM uint32_t PINCFG109;                   /*!< Controls the operation of virtual GPIO pin 109.                           */

    struct {
      __IOM uint32_t FNCSEL109  : 4;            /*!< Function select for GPIO pin 109                                          */
      __IOM uint32_t INPEN109   : 1;            /*!< Input enable for GPIO 109                                                 */
      __IOM uint32_t RDZERO109  : 1;            /*!< Return 0 for read data on GPIO 109                                        */
      __IOM uint32_t IRPTEN109  : 2;            /*!< Interrupt enable for GPIO 109                                             */
      __IOM uint32_t OUTCFG109  : 2;            /*!< Pin IO mode selection for GPIO pin 109                                    */
            uint32_t            : 22;
    } PINCFG109_b;
  } ;

  union {
    __IOM uint32_t PINCFG110;                   /*!< Controls the operation of virtual GPIO pin 110.                           */

    struct {
      __IOM uint32_t FNCSEL110  : 4;            /*!< Function select for GPIO pin 110                                          */
      __IOM uint32_t INPEN110   : 1;            /*!< Input enable for GPIO 110                                                 */
      __IOM uint32_t RDZERO110  : 1;            /*!< Return 0 for read data on GPIO 110                                        */
      __IOM uint32_t IRPTEN110  : 2;            /*!< Interrupt enable for GPIO 110                                             */
      __IOM uint32_t OUTCFG110  : 2;            /*!< Pin IO mode selection for GPIO pin 110                                    */
            uint32_t            : 22;
    } PINCFG110_b;
  } ;

  union {
    __IOM uint32_t PINCFG111;                   /*!< Controls the operation of virtual GPIO pin 111.                           */

    struct {
      __IOM uint32_t FNCSEL111  : 4;            /*!< Function select for GPIO pin 111                                          */
      __IOM uint32_t INPEN111   : 1;            /*!< Input enable for GPIO 111                                                 */
      __IOM uint32_t RDZERO111  : 1;            /*!< Return 0 for read data on GPIO 111                                        */
      __IOM uint32_t IRPTEN111  : 2;            /*!< Interrupt enable for GPIO 111                                             */
      __IOM uint32_t OUTCFG111  : 2;            /*!< Pin IO mode selection for GPIO pin 111                                    */
            uint32_t            : 22;
    } PINCFG111_b;
  } ;

  union {
    __IOM uint32_t PINCFG112;                   /*!< Controls the operation of virtual GPIO pin 112.                           */

    struct {
      __IOM uint32_t FNCSEL112  : 4;            /*!< Function select for GPIO pin 112                                          */
      __IOM uint32_t INPEN112   : 1;            /*!< Input enable for GPIO 112                                                 */
      __IOM uint32_t RDZERO112  : 1;            /*!< Return 0 for read data on GPIO 112                                        */
      __IOM uint32_t IRPTEN112  : 2;            /*!< Interrupt enable for GPIO 112                                             */
      __IOM uint32_t OUTCFG112  : 2;            /*!< Pin IO mode selection for GPIO pin 112                                    */
            uint32_t            : 22;
    } PINCFG112_b;
  } ;

  union {
    __IOM uint32_t PINCFG113;                   /*!< Controls the operation of virtual GPIO pin 113.                           */

    struct {
      __IOM uint32_t FNCSEL113  : 4;            /*!< Function select for GPIO pin 113                                          */
      __IOM uint32_t INPEN113   : 1;            /*!< Input enable for GPIO 113                                                 */
      __IOM uint32_t RDZERO113  : 1;            /*!< Return 0 for read data on GPIO 113                                        */
      __IOM uint32_t IRPTEN113  : 2;            /*!< Interrupt enable for GPIO 113                                             */
      __IOM uint32_t OUTCFG113  : 2;            /*!< Pin IO mode selection for GPIO pin 113                                    */
            uint32_t            : 22;
    } PINCFG113_b;
  } ;

  union {
    __IOM uint32_t PINCFG114;                   /*!< Controls the operation of virtual GPIO pin 114.                           */

