AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL114  : 4;            /*!< Function select for GPIO pin 114                                          */
      __IOM uint32_t INPEN114   : 1;            /*!< Input enable for GPIO 114                                                 */
      __IOM uint32_t RDZERO114  : 1;            /*!< Return 0 for read data on GPIO 114                                        */
      __IOM uint32_t IRPTEN114  : 2;            /*!< Interrupt enable for GPIO 114                                             */
      __IOM uint32_t OUTCFG114  : 2;            /*!< Pin IO mode selection for GPIO pin 114                                    */
            uint32_t            : 22;
    } PINCFG114_b;
  } ;

  union {
    __IOM uint32_t PINCFG115;                   /*!< Controls the operation of virtual GPIO pin 115.                           */

    struct {
      __IOM uint32_t FNCSEL115  : 4;            /*!< Function select for GPIO pin 115                                          */
      __IOM uint32_t INPEN115   : 1;            /*!< Input enable for GPIO 115                                                 */
      __IOM uint32_t RDZERO115  : 1;            /*!< Return 0 for read data on GPIO 115                                        */
      __IOM uint32_t IRPTEN115  : 2;            /*!< Interrupt enable for GPIO 115                                             */
      __IOM uint32_t OUTCFG115  : 2;            /*!< Pin IO mode selection for GPIO pin 115                                    */
            uint32_t            : 22;
    } PINCFG115_b;
  } ;

  union {
    __IOM uint32_t PINCFG116;                   /*!< Controls the operation of virtual GPIO pin 116.                           */

    struct {
      __IOM uint32_t FNCSEL116  : 4;            /*!< Function select for GPIO pin 116                                          */
      __IOM uint32_t INPEN116   : 1;            /*!< Input enable for GPIO 116                                                 */
      __IOM uint32_t RDZERO116  : 1;            /*!< Return 0 for read data on GPIO 116                                        */
      __IOM uint32_t IRPTEN116  : 2;            /*!< Interrupt enable for GPIO 116                                             */
      __IOM uint32_t OUTCFG116  : 2;            /*!< Pin IO mode selection for GPIO pin 116                                    */
            uint32_t            : 22;
    } PINCFG116_b;
  } ;

  union {
    __IOM uint32_t PINCFG117;                   /*!< Controls the operation of virtual GPIO pin 117.                           */

    struct {
      __IOM uint32_t FNCSEL117  : 4;            /*!< Function select for GPIO pin 117                                          */
      __IOM uint32_t INPEN117   : 1;            /*!< Input enable for GPIO 117                                                 */
      __IOM uint32_t RDZERO117  : 1;            /*!< Return 0 for read data on GPIO 117                                        */
      __IOM uint32_t IRPTEN117  : 2;            /*!< Interrupt enable for GPIO 117                                             */
      __IOM uint32_t OUTCFG117  : 2;            /*!< Pin IO mode selection for GPIO pin 117                                    */
            uint32_t            : 22;
    } PINCFG117_b;
  } ;

  union {
    __IOM uint32_t PINCFG118;                   /*!< Controls the operation of virtual GPIO pin 118.                           */

    struct {
      __IOM uint32_t FNCSEL118  : 4;            /*!< Function select for GPIO pin 118                                          */
      __IOM uint32_t INPEN118   : 1;            /*!< Input enable for GPIO 118                                                 */
      __IOM uint32_t RDZERO118  : 1;            /*!< Return 0 for read data on GPIO 118                                        */
      __IOM uint32_t IRPTEN118  : 2;            /*!< Interrupt enable for GPIO 118                                             */
      __IOM uint32_t OUTCFG118  : 2;            /*!< Pin IO mode selection for GPIO pin 118                                    */
            uint32_t            : 22;
    } PINCFG118_b;
  } ;

  union {
    __IOM uint32_t PINCFG119;                   /*!< Controls the operation of virtual GPIO pin 119.                           */

    struct {
      __IOM uint32_t FNCSEL119  : 4;            /*!< Function select for GPIO pin 119                                          */
      __IOM uint32_t INPEN119   : 1;            /*!< Input enable for GPIO 119                                                 */
      __IOM uint32_t RDZERO119  : 1;            /*!< Return 0 for read data on GPIO 119                                        */
      __IOM uint32_t IRPTEN119  : 2;            /*!< Interrupt enable for GPIO 119                                             */
      __IOM uint32_t OUTCFG119  : 2;            /*!< Pin IO mode selection for GPIO pin 119                                    */
            uint32_t            : 22;
    } PINCFG119_b;
  } ;

  union {
    __IOM uint32_t PINCFG120;                   /*!< Controls the operation of virtual GPIO pin 120.                           */

    struct {
      __IOM uint32_t FNCSEL120  : 4;            /*!< Function select for GPIO pin 120                                          */
      __IOM uint32_t INPEN120   : 1;            /*!< Input enable for GPIO 120                                                 */
      __IOM uint32_t RDZERO120  : 1;            /*!< Return 0 for read data on GPIO 120                                        */
      __IOM uint32_t IRPTEN120  : 2;            /*!< Interrupt enable for GPIO 120                                             */
      __IOM uint32_t OUTCFG120  : 2;            /*!< Pin IO mode selection for GPIO pin 120                                    */
            uint32_t            : 22;
    } PINCFG120_b;
  } ;

  union {
    __IOM uint32_t PINCFG121;                   /*!< Controls the operation of virtual GPIO pin 121.                           */

