AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FNCSEL121  : 4;            /*!< Function select for GPIO pin 121                                          */
      __IOM uint32_t INPEN121   : 1;            /*!< Input enable for GPIO 121                                                 */
      __IOM uint32_t RDZERO121  : 1;            /*!< Return 0 for read data on GPIO 121                                        */
      __IOM uint32_t IRPTEN121  : 2;            /*!< Interrupt enable for GPIO 121                                             */
      __IOM uint32_t OUTCFG121  : 2;            /*!< Pin IO mode selection for GPIO pin 121                                    */
            uint32_t            : 22;
    } PINCFG121_b;
  } ;

  union {
    __IOM uint32_t PINCFG122;                   /*!< Controls the operation of virtual GPIO pin 122.                           */

    struct {
      __IOM uint32_t FNCSEL122  : 4;            /*!< Function select for GPIO pin 122                                          */
      __IOM uint32_t INPEN122   : 1;            /*!< Input enable for GPIO 122                                                 */
      __IOM uint32_t RDZERO122  : 1;            /*!< Return 0 for read data on GPIO 122                                        */
      __IOM uint32_t IRPTEN122  : 2;            /*!< Interrupt enable for GPIO 122                                             */
      __IOM uint32_t OUTCFG122  : 2;            /*!< Pin IO mode selection for GPIO pin 122                                    */
            uint32_t            : 22;
    } PINCFG122_b;
  } ;

  union {
    __IOM uint32_t PINCFG123;                   /*!< Controls the operation of virtual GPIO pin 123.                           */

    struct {
      __IOM uint32_t FNCSEL123  : 4;            /*!< Function select for GPIO pin 123                                          */
      __IOM uint32_t INPEN123   : 1;            /*!< Input enable for GPIO 123                                                 */
      __IOM uint32_t RDZERO123  : 1;            /*!< Return 0 for read data on GPIO 123                                        */
      __IOM uint32_t IRPTEN123  : 2;            /*!< Interrupt enable for GPIO 123                                             */
      __IOM uint32_t OUTCFG123  : 2;            /*!< Pin IO mode selection for GPIO pin 123                                    */
            uint32_t            : 22;
    } PINCFG123_b;
  } ;

  union {
    __IOM uint32_t PINCFG124;                   /*!< Controls the operation of virtual GPIO pin 124.                           */

    struct {
      __IOM uint32_t FNCSEL124  : 4;            /*!< Function select for GPIO pin 124                                          */
      __IOM uint32_t INPEN124   : 1;            /*!< Input enable for GPIO 124                                                 */
      __IOM uint32_t RDZERO124  : 1;            /*!< Return 0 for read data on GPIO 124                                        */
      __IOM uint32_t IRPTEN124  : 2;            /*!< Interrupt enable for GPIO 124                                             */
      __IOM uint32_t OUTCFG124  : 2;            /*!< Pin IO mode selection for GPIO pin 124                                    */
            uint32_t            : 22;
    } PINCFG124_b;
  } ;

  union {
    __IOM uint32_t PINCFG125;                   /*!< Controls the operation of virtual GPIO pin 125.                           */

    struct {
      __IOM uint32_t FNCSEL125  : 4;            /*!< Function select for GPIO pin 125                                          */
      __IOM uint32_t INPEN125   : 1;            /*!< Input enable for GPIO 125                                                 */
      __IOM uint32_t RDZERO125  : 1;            /*!< Return 0 for read data on GPIO 125                                        */
      __IOM uint32_t IRPTEN125  : 2;            /*!< Interrupt enable for GPIO 125                                             */
      __IOM uint32_t OUTCFG125  : 2;            /*!< Pin IO mode selection for GPIO pin 125                                    */
            uint32_t            : 22;
    } PINCFG125_b;
  } ;

  union {
    __IOM uint32_t PINCFG126;                   /*!< Controls the operation of virtual GPIO pin 126.                           */

    struct {
      __IOM uint32_t FNCSEL126  : 4;            /*!< Function select for GPIO pin 126                                          */
      __IOM uint32_t INPEN126   : 1;            /*!< Input enable for GPIO 126                                                 */
      __IOM uint32_t RDZERO126  : 1;            /*!< Return 0 for read data on GPIO 126                                        */
      __IOM uint32_t IRPTEN126  : 2;            /*!< Interrupt enable for GPIO 126                                             */
      __IOM uint32_t OUTCFG126  : 2;            /*!< Pin IO mode selection for GPIO pin 126                                    */
            uint32_t            : 22;
    } PINCFG126_b;
  } ;

  union {
    __IOM uint32_t PINCFG127;                   /*!< Controls the operation of virtual GPIO pin 127.                           */

    struct {
      __IOM uint32_t FNCSEL127  : 4;            /*!< Function select for GPIO pin 127                                          */
      __IOM uint32_t INPEN127   : 1;            /*!< Input enable for GPIO 127                                                 */
      __IOM uint32_t RDZERO127  : 1;            /*!< Return 0 for read data on GPIO 127                                        */
      __IOM uint32_t IRPTEN127  : 2;            /*!< Interrupt enable for GPIO 127                                             */
      __IOM uint32_t OUTCFG127  : 2;            /*!< Pin IO mode selection for GPIO pin 127                                    */
            uint32_t            : 22;
    } PINCFG127_b;
  } ;

  union {
    __IOM uint32_t PADKEY;                      /*!< Lock state of the PINCFG and GPIO configuration registers. Write
                                                     a value of 0x73 to unlock write access to the PAD and GPIO.               */

