AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t MCUN0GPIO96 : 1;           /*!< GPIO96 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO97 : 1;           /*!< GPIO97 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO98 : 1;           /*!< GPIO98 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO99 : 1;           /*!< GPIO99 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO100 : 1;          /*!< GPIO100 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO101 : 1;          /*!< GPIO101 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO102 : 1;          /*!< GPIO102 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO103 : 1;          /*!< GPIO103 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO104 : 1;          /*!< GPIO104 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO105 : 1;          /*!< GPIO105 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO106 : 1;          /*!< GPIO106 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO107 : 1;          /*!< GPIO107 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO108 : 1;          /*!< GPIO108 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO109 : 1;          /*!< GPIO109 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO110 : 1;          /*!< GPIO110 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO111 : 1;          /*!< GPIO111 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO112 : 1;          /*!< GPIO112 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO113 : 1;          /*!< GPIO113 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO114 : 1;          /*!< GPIO114 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO115 : 1;          /*!< GPIO115 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO116 : 1;          /*!< GPIO116 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO117 : 1;          /*!< GPIO117 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO118 : 1;          /*!< GPIO118 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO119 : 1;          /*!< GPIO119 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO120 : 1;          /*!< GPIO120 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO121 : 1;          /*!< GPIO121 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO122 : 1;          /*!< GPIO122 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO123 : 1;          /*!< GPIO123 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO124 : 1;          /*!< GPIO124 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO125 : 1;          /*!< GPIO125 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO126 : 1;          /*!< GPIO126 MCU N0-priority interrupt.                                        */
      __IOM uint32_t MCUN0GPIO127 : 1;          /*!< GPIO127 MCU N0-priority interrupt.                                        */
    } MCUN0INT3SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT0EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO0 : 1;            /*!< GPIO0 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO1 : 1;            /*!< GPIO1 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO2 : 1;            /*!< GPIO2 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO3 : 1;            /*!< GPIO3 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO4 : 1;            /*!< GPIO4 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO5 : 1;            /*!< GPIO5 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO6 : 1;            /*!< GPIO6 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO7 : 1;            /*!< GPIO7 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO8 : 1;            /*!< GPIO8 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO9 : 1;            /*!< GPIO9 MCU N1-priority interrupt.                                          */
      __IOM uint32_t MCUN1GPIO10 : 1;           /*!< GPIO10 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO11 : 1;           /*!< GPIO11 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO12 : 1;           /*!< GPIO12 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO13 : 1;           /*!< GPIO13 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO14 : 1;           /*!< GPIO14 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO15 : 1;           /*!< GPIO15 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO16 : 1;           /*!< GPIO16 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO17 : 1;           /*!< GPIO17 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO18 : 1;           /*!< GPIO18 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO19 : 1;           /*!< GPIO19 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO20 : 1;           /*!< GPIO20 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO21 : 1;           /*!< GPIO21 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO22 : 1;           /*!< GPIO22 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO23 : 1;           /*!< GPIO23 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO24 : 1;           /*!< GPIO24 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO25 : 1;           /*!< GPIO25 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO26 : 1;           /*!< GPIO26 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO27 : 1;           /*!< GPIO27 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO28 : 1;           /*!< GPIO28 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO29 : 1;           /*!< GPIO29 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO30 : 1;           /*!< GPIO30 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO31 : 1;           /*!< GPIO31 MCU N1-priority interrupt.                                         */
    } MCUN1INT0EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT0STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

