AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t MCUN1GPIO96 : 1;           /*!< GPIO96 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO97 : 1;           /*!< GPIO97 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO98 : 1;           /*!< GPIO98 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO99 : 1;           /*!< GPIO99 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO100 : 1;          /*!< GPIO100 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO101 : 1;          /*!< GPIO101 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO102 : 1;          /*!< GPIO102 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO103 : 1;          /*!< GPIO103 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO104 : 1;          /*!< GPIO104 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO105 : 1;          /*!< GPIO105 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO106 : 1;          /*!< GPIO106 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO107 : 1;          /*!< GPIO107 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO108 : 1;          /*!< GPIO108 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO109 : 1;          /*!< GPIO109 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO110 : 1;          /*!< GPIO110 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO111 : 1;          /*!< GPIO111 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO112 : 1;          /*!< GPIO112 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO113 : 1;          /*!< GPIO113 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO114 : 1;          /*!< GPIO114 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO115 : 1;          /*!< GPIO115 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO116 : 1;          /*!< GPIO116 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO117 : 1;          /*!< GPIO117 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO118 : 1;          /*!< GPIO118 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO119 : 1;          /*!< GPIO119 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO120 : 1;          /*!< GPIO120 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO121 : 1;          /*!< GPIO121 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO122 : 1;          /*!< GPIO122 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO123 : 1;          /*!< GPIO123 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO124 : 1;          /*!< GPIO124 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO125 : 1;          /*!< GPIO125 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO126 : 1;          /*!< GPIO126 MCU N1-priority interrupt.                                        */
      __IOM uint32_t MCUN1GPIO127 : 1;          /*!< GPIO127 MCU N1-priority interrupt.                                        */
    } MCUN1INT3SET_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT0EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP0N0GPIO0 : 1;           /*!< GPIO0 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO1 : 1;           /*!< GPIO1 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO2 : 1;           /*!< GPIO2 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO3 : 1;           /*!< GPIO3 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO4 : 1;           /*!< GPIO4 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO5 : 1;           /*!< GPIO5 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO6 : 1;           /*!< GPIO6 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO7 : 1;           /*!< GPIO7 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO8 : 1;           /*!< GPIO8 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO9 : 1;           /*!< GPIO9 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO10 : 1;          /*!< GPIO10 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO11 : 1;          /*!< GPIO11 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO12 : 1;          /*!< GPIO12 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO13 : 1;          /*!< GPIO13 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO14 : 1;          /*!< GPIO14 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO15 : 1;          /*!< GPIO15 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO16 : 1;          /*!< GPIO16 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO17 : 1;          /*!< GPIO17 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO18 : 1;          /*!< GPIO18 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO19 : 1;          /*!< GPIO19 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO20 : 1;          /*!< GPIO20 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO21 : 1;          /*!< GPIO21 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO22 : 1;          /*!< GPIO22 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO23 : 1;          /*!< GPIO23 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO24 : 1;          /*!< GPIO24 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO25 : 1;          /*!< GPIO25 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO26 : 1;          /*!< GPIO26 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO27 : 1;          /*!< GPIO27 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO28 : 1;          /*!< GPIO28 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO29 : 1;          /*!< GPIO29 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO30 : 1;          /*!< GPIO30 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO31 : 1;          /*!< GPIO31 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT0EN_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT0STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

