AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP0N0GPIO32 : 1;          /*!< GPIO32 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO33 : 1;          /*!< GPIO33 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO34 : 1;          /*!< GPIO34 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO35 : 1;          /*!< GPIO35 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO36 : 1;          /*!< GPIO36 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO37 : 1;          /*!< GPIO37 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO38 : 1;          /*!< GPIO38 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO39 : 1;          /*!< GPIO39 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO40 : 1;          /*!< GPIO40 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO41 : 1;          /*!< GPIO41 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO42 : 1;          /*!< GPIO42 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO43 : 1;          /*!< GPIO43 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO44 : 1;          /*!< GPIO44 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO45 : 1;          /*!< GPIO45 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO46 : 1;          /*!< GPIO46 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO47 : 1;          /*!< GPIO47 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO48 : 1;          /*!< GPIO48 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO49 : 1;          /*!< GPIO49 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO50 : 1;          /*!< GPIO50 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO51 : 1;          /*!< GPIO51 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO52 : 1;          /*!< GPIO52 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO53 : 1;          /*!< GPIO53 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO54 : 1;          /*!< GPIO54 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO55 : 1;          /*!< GPIO55 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO56 : 1;          /*!< GPIO56 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO57 : 1;          /*!< GPIO57 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO58 : 1;          /*!< GPIO58 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO59 : 1;          /*!< GPIO59 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO60 : 1;          /*!< GPIO60 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO61 : 1;          /*!< GPIO61 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO62 : 1;          /*!< GPIO62 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO63 : 1;          /*!< GPIO63 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT1STAT_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT1CLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP0N0GPIO32 : 1;          /*!< GPIO32 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO33 : 1;          /*!< GPIO33 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO34 : 1;          /*!< GPIO34 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO35 : 1;          /*!< GPIO35 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO36 : 1;          /*!< GPIO36 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO37 : 1;          /*!< GPIO37 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO38 : 1;          /*!< GPIO38 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO39 : 1;          /*!< GPIO39 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO40 : 1;          /*!< GPIO40 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO41 : 1;          /*!< GPIO41 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO42 : 1;          /*!< GPIO42 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO43 : 1;          /*!< GPIO43 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO44 : 1;          /*!< GPIO44 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO45 : 1;          /*!< GPIO45 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO46 : 1;          /*!< GPIO46 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO47 : 1;          /*!< GPIO47 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO48 : 1;          /*!< GPIO48 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO49 : 1;          /*!< GPIO49 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO50 : 1;          /*!< GPIO50 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO51 : 1;          /*!< GPIO51 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO52 : 1;          /*!< GPIO52 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO53 : 1;          /*!< GPIO53 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO54 : 1;          /*!< GPIO54 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO55 : 1;          /*!< GPIO55 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO56 : 1;          /*!< GPIO56 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO57 : 1;          /*!< GPIO57 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO58 : 1;          /*!< GPIO58 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO59 : 1;          /*!< GPIO59 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO60 : 1;          /*!< GPIO60 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO61 : 1;          /*!< GPIO61 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO62 : 1;          /*!< GPIO62 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO63 : 1;          /*!< GPIO63 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT1CLR_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT1SET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

