AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP0N0GPIO32 : 1;          /*!< GPIO32 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO33 : 1;          /*!< GPIO33 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO34 : 1;          /*!< GPIO34 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO35 : 1;          /*!< GPIO35 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO36 : 1;          /*!< GPIO36 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO37 : 1;          /*!< GPIO37 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO38 : 1;          /*!< GPIO38 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO39 : 1;          /*!< GPIO39 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO40 : 1;          /*!< GPIO40 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO41 : 1;          /*!< GPIO41 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO42 : 1;          /*!< GPIO42 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO43 : 1;          /*!< GPIO43 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO44 : 1;          /*!< GPIO44 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO45 : 1;          /*!< GPIO45 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO46 : 1;          /*!< GPIO46 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO47 : 1;          /*!< GPIO47 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO48 : 1;          /*!< GPIO48 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO49 : 1;          /*!< GPIO49 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO50 : 1;          /*!< GPIO50 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO51 : 1;          /*!< GPIO51 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO52 : 1;          /*!< GPIO52 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO53 : 1;          /*!< GPIO53 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO54 : 1;          /*!< GPIO54 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO55 : 1;          /*!< GPIO55 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO56 : 1;          /*!< GPIO56 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO57 : 1;          /*!< GPIO57 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO58 : 1;          /*!< GPIO58 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO59 : 1;          /*!< GPIO59 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO60 : 1;          /*!< GPIO60 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO61 : 1;          /*!< GPIO61 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO62 : 1;          /*!< GPIO62 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO63 : 1;          /*!< GPIO63 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT1SET_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT2EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP0N0GPIO64 : 1;          /*!< GPIO64 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO65 : 1;          /*!< GPIO65 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO66 : 1;          /*!< GPIO66 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO67 : 1;          /*!< GPIO67 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO68 : 1;          /*!< GPIO68 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO69 : 1;          /*!< GPIO69 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO70 : 1;          /*!< GPIO70 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO71 : 1;          /*!< GPIO71 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO72 : 1;          /*!< GPIO72 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO73 : 1;          /*!< GPIO73 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO74 : 1;          /*!< GPIO74 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO75 : 1;          /*!< GPIO75 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO76 : 1;          /*!< GPIO76 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO77 : 1;          /*!< GPIO77 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO78 : 1;          /*!< GPIO78 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO79 : 1;          /*!< GPIO79 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO80 : 1;          /*!< GPIO80 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO81 : 1;          /*!< GPIO81 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO82 : 1;          /*!< GPIO82 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO83 : 1;          /*!< GPIO83 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO84 : 1;          /*!< GPIO84 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO85 : 1;          /*!< GPIO85 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO86 : 1;          /*!< GPIO86 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO87 : 1;          /*!< GPIO87 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO88 : 1;          /*!< GPIO88 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO89 : 1;          /*!< GPIO89 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO90 : 1;          /*!< GPIO90 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO91 : 1;          /*!< GPIO91 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO92 : 1;          /*!< GPIO92 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO93 : 1;          /*!< GPIO93 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO94 : 1;          /*!< GPIO94 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO95 : 1;          /*!< GPIO95 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT2EN_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT2STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

