AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP0N1GPIO0 : 1;           /*!< GPIO0 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO1 : 1;           /*!< GPIO1 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO2 : 1;           /*!< GPIO2 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO3 : 1;           /*!< GPIO3 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO4 : 1;           /*!< GPIO4 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO5 : 1;           /*!< GPIO5 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO6 : 1;           /*!< GPIO6 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO7 : 1;           /*!< GPIO7 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO8 : 1;           /*!< GPIO8 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO9 : 1;           /*!< GPIO9 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO10 : 1;          /*!< GPIO10 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO11 : 1;          /*!< GPIO11 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO12 : 1;          /*!< GPIO12 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO13 : 1;          /*!< GPIO13 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO14 : 1;          /*!< GPIO14 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO15 : 1;          /*!< GPIO15 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO16 : 1;          /*!< GPIO16 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO17 : 1;          /*!< GPIO17 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO18 : 1;          /*!< GPIO18 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO19 : 1;          /*!< GPIO19 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO20 : 1;          /*!< GPIO20 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO21 : 1;          /*!< GPIO21 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO22 : 1;          /*!< GPIO22 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO23 : 1;          /*!< GPIO23 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO24 : 1;          /*!< GPIO24 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO25 : 1;          /*!< GPIO25 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO26 : 1;          /*!< GPIO26 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO27 : 1;          /*!< GPIO27 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO28 : 1;          /*!< GPIO28 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO29 : 1;          /*!< GPIO29 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO30 : 1;          /*!< GPIO30 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO31 : 1;          /*!< GPIO31 DSP0 N1-priority interrupt.                                        */
    } DSP0N1INT0SET_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT1EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP0N1GPIO32 : 1;          /*!< GPIO32 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO33 : 1;          /*!< GPIO33 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO34 : 1;          /*!< GPIO34 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO35 : 1;          /*!< GPIO35 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO36 : 1;          /*!< GPIO36 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO37 : 1;          /*!< GPIO37 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO38 : 1;          /*!< GPIO38 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO39 : 1;          /*!< GPIO39 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO40 : 1;          /*!< GPIO40 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO41 : 1;          /*!< GPIO41 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO42 : 1;          /*!< GPIO42 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO43 : 1;          /*!< GPIO43 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO44 : 1;          /*!< GPIO44 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO45 : 1;          /*!< GPIO45 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO46 : 1;          /*!< GPIO46 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO47 : 1;          /*!< GPIO47 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO48 : 1;          /*!< GPIO48 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO49 : 1;          /*!< GPIO49 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO50 : 1;          /*!< GPIO50 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO51 : 1;          /*!< GPIO51 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO52 : 1;          /*!< GPIO52 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO53 : 1;          /*!< GPIO53 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO54 : 1;          /*!< GPIO54 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO55 : 1;          /*!< GPIO55 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO56 : 1;          /*!< GPIO56 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO57 : 1;          /*!< GPIO57 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO58 : 1;          /*!< GPIO58 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO59 : 1;          /*!< GPIO59 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO60 : 1;          /*!< GPIO60 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO61 : 1;          /*!< GPIO61 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO62 : 1;          /*!< GPIO62 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO63 : 1;          /*!< GPIO63 DSP0 N1-priority interrupt.                                        */
    } DSP0N1INT1EN_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT1STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

