AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP1N0GPIO0 : 1;           /*!< GPIO0 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO1 : 1;           /*!< GPIO1 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO2 : 1;           /*!< GPIO2 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO3 : 1;           /*!< GPIO3 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO4 : 1;           /*!< GPIO4 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO5 : 1;           /*!< GPIO5 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO6 : 1;           /*!< GPIO6 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO7 : 1;           /*!< GPIO7 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO8 : 1;           /*!< GPIO8 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO9 : 1;           /*!< GPIO9 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO10 : 1;          /*!< GPIO10 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO11 : 1;          /*!< GPIO11 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO12 : 1;          /*!< GPIO12 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO13 : 1;          /*!< GPIO13 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO14 : 1;          /*!< GPIO14 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO15 : 1;          /*!< GPIO15 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO16 : 1;          /*!< GPIO16 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO17 : 1;          /*!< GPIO17 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO18 : 1;          /*!< GPIO18 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO19 : 1;          /*!< GPIO19 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO20 : 1;          /*!< GPIO20 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO21 : 1;          /*!< GPIO21 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO22 : 1;          /*!< GPIO22 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO23 : 1;          /*!< GPIO23 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO24 : 1;          /*!< GPIO24 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO25 : 1;          /*!< GPIO25 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO26 : 1;          /*!< GPIO26 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO27 : 1;          /*!< GPIO27 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO28 : 1;          /*!< GPIO28 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO29 : 1;          /*!< GPIO29 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO30 : 1;          /*!< GPIO30 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO31 : 1;          /*!< GPIO31 DSP1 N0-priority interrupt.                                        */
    } DSP1N0INT0SET_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT1EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP1N0GPIO32 : 1;          /*!< GPIO32 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO33 : 1;          /*!< GPIO33 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO34 : 1;          /*!< GPIO34 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO35 : 1;          /*!< GPIO35 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO36 : 1;          /*!< GPIO36 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO37 : 1;          /*!< GPIO37 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO38 : 1;          /*!< GPIO38 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO39 : 1;          /*!< GPIO39 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO40 : 1;          /*!< GPIO40 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO41 : 1;          /*!< GPIO41 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO42 : 1;          /*!< GPIO42 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO43 : 1;          /*!< GPIO43 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO44 : 1;          /*!< GPIO44 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO45 : 1;          /*!< GPIO45 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO46 : 1;          /*!< GPIO46 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO47 : 1;          /*!< GPIO47 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO48 : 1;          /*!< GPIO48 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO49 : 1;          /*!< GPIO49 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO50 : 1;          /*!< GPIO50 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO51 : 1;          /*!< GPIO51 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO52 : 1;          /*!< GPIO52 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO53 : 1;          /*!< GPIO53 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO54 : 1;          /*!< GPIO54 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO55 : 1;          /*!< GPIO55 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO56 : 1;          /*!< GPIO56 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO57 : 1;          /*!< GPIO57 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO58 : 1;          /*!< GPIO58 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO59 : 1;          /*!< GPIO59 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO60 : 1;          /*!< GPIO60 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO61 : 1;          /*!< GPIO61 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO62 : 1;          /*!< GPIO62 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO63 : 1;          /*!< GPIO63 DSP1 N0-priority interrupt.                                        */
    } DSP1N0INT1EN_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT1STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

