AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t C2SHADER   : 32;           /*!< Shader constant register 2                                                */
    } C2REG_b;
  } ;

  union {
    __IOM uint32_t C3REG;                       /*!< Shader constant register 3, the dirty Region Register                     */

    struct {
      __IOM uint32_t C3SHADER   : 32;           /*!< Shader constant register 3                                                */
    } C3REG_b;
  } ;
  __IM  uint32_t  RESERVED13[888];

  union {
    __IOM uint32_t IRQID;                       /*!< Signals interrupt when set (CHECK address!).                              */

    struct {
      __IOM uint32_t IRQID      : 32;           /*!< Signals interrupt when set (CHECK address!                                */
    } IRQID_b;
  } ;
} GPU_Type;                                     /*!< Size = 4084 (0xff4)                                                       */



/* =========================================================================================================================== */
/* ================                                           I2S0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2S ASRC Master/Slave Module (I2S0)
  */

typedef struct {                                /*!< I2S0 Structure                                                            */

  union {
    __IOM uint32_t RXDATA;                      /*!< Read only access to the i2S receive data                                  */

    struct {
      __IOM uint32_t RXSAMPLE   : 32;           /*!< 32b audio sample from the internal receive FIFO. MSB is always
                                                     in bit 31                                                                 */
    } RXDATA_b;
  } ;

  union {
    __IOM uint32_t RXCHANID;                    /*!< Read only received channel identification register                        */

    struct {
      __IOM uint32_t RXCHANID   : 8;            /*!< Channel ID value 0-255.                                                   */
            uint32_t            : 24;
    } RXCHANID_b;
  } ;

  union {
    __IOM uint32_t RXFIFOSTATUS;                /*!< Holds the number of samples currently in the receive FIFO, and
                                                     the empty condition flag                                                  */

    struct {
      __IOM uint32_t RXSAMPLECNT : 28;          /*!< The count of the number of samples currently in the receive
                                                     FIFO.                                                                     */
      __IOM uint32_t RXEMPTY    : 1;            /*!< Receive FIFO empty bit. a 1 indicates the receive FIFO is empty.          */
            uint32_t            : 3;
    } RXFIFOSTATUS_b;
  } ;

  union {
    __IOM uint32_t RXFIFOSIZE;                  /*!< Holds the size of the receive FIFO in samples                             */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< Size of the receive FIFO in units of i2S samples. Read only
                                                     value.                                                                    */
    } RXFIFOSIZE_b;
  } ;

  union {
    __IOM uint32_t RXUPPERLIMIT;                /*!< The number of samples required to be in the RX FIFO before asserting
                                                     the RX_FFi interrupt bit                                                  */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< When the I2S sample count stored within the receive FIFO reaches
                                                     this value or is larger, the interrupt RX_FFi bit is asserted.            */
    } RXUPPERLIMIT_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t TXDATA;                      /*!< Write only register to hold the i2S sample to transmit via the
                                                     write FIFO                                                                */

    struct {
      __IOM uint32_t TXSAMPLE   : 32;           /*!< 32b I2S sample to send out of the I2S module via the external
                                                     pins. All sample have the MSB in bit 31 regardless of number
                                                     of bits per sample and data justification                                 */
    } TXDATA_b;
  } ;

  union {
    __IOM uint32_t TXCHANID;                    /*!< Channel ID used for the next audio sample to be written to the
                                                     data transmission register                                                */

    struct {
      __IOM uint32_t TXCHANID   : 8;            /*!< Channel ID value 0-255.                                                   */
            uint32_t            : 24;
    } TXCHANID_b;
  } ;

  union {
    __IOM uint32_t TXFIFOSTATUS;                /*!< Holds the number of samples currently in the transmit FIFO,
                                                     and the full condition flag                                               */

    struct {
      __IOM uint32_t TXFIFOCNT  : 28;           /*!< The count of the number of samples currently in the transmit
                                                     FIFO.                                                                     */
      __IOM uint32_t TXFIFOFULL : 1;            /*!< Transmit FIFO full bit. a 1 indicates the transmit FIFO is full.          */
            uint32_t            : 3;
    } TXFIFOSTATUS_b;
  } ;

  union {
    __IOM uint32_t TXFIFOSIZE;                  /*!< Holds the size of the transmit FIFO in samples                            */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< Size of the transmit FIFO in units of I2S samples. Read only
                                                     value.                                                                    */
    } TXFIFOSIZE_b;
  } ;

  union {
    __IOM uint32_t TXLOWERLIMIT;                /*!< Minimum number of samples have been reached in the transmit
                                                     FIFO.                                                                     */

