AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< Command Complete interrupt. Asserted when the current operation
                                                     has completed. For repeated commands, this will only be
                                                     asserted when the final repeated command is completed.                    */
      __IOM uint32_t THR        : 1;            /*!< FIFO Threshold interrupt. For write operations, asserted when
                                                     the number of free bytes in the write FIFO equals or exceeds
                                                     the WTHR field.For read operations, asserted when the number
                                                     of valid bytes in the read FIFO equals of exceeds the value
                                                     set in the RTHR field.                                                    */
      __IOM uint32_t FUNDFL     : 1;            /*!< Read FIFO Underflow interrupt. This occurs when software tries
                                                     to pop from an empty fifo.                                                */
      __IOM uint32_t FOVFL      : 1;            /*!< Write FIFO Overflow interrupt. This occurs when software tries
                                                     to write to a full fifo. The current operation does not
                                                     stop.                                                                     */
      __IOM uint32_t NAK        : 1;            /*!< I2C NAK interrupt. Asserted when an unexpected NAK has been
                                                     received on the I2C bus.                                                  */
      __IOM uint32_t IACC       : 1;            /*!< illegal FIFO access interrupt. Asserted when there is a overflow
                                                     or underflow event                                                        */
      __IOM uint32_t ICMD       : 1;            /*!< illegal command interrupt. Asserted when a command is written
                                                     when an active command is in progress.                                    */
      __IOM uint32_t START      : 1;            /*!< START command interrupt. Asserted when another master on the
                                                     bus has signaled a START command.                                         */
      __IOM uint32_t STOP       : 1;            /*!< STOP command interrupt. Asserted when another master on the
                                                     bus has signaled a STOP command.                                          */
      __IOM uint32_t ARB        : 1;            /*!< Arbitration loss interrupt. Asserted when arbitration is enabled
                                                     and has been lost to another master on the bus. Also asserted
                                                     during I2C write operations when value of 1 expected on
                                                     bus, but 0 is observed. When asserted, the I2C state machine
                                                     will immediately go to idle. This interrupt condition is
                                                     cleared by the next command.                                              */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete. Processing of the DMA operation has completed
                                                     and the DMA submodule is returned into the idle state                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error encountered during the processing of the DMA command.
                                                     The DMA error could occur when the memory access specified
                                                     in the DMA operation is not available or incorrectly specified.           */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command queue is paused due to an active event enabled in the
                                                     PAUSEEN register. The interrupt is posted when the event
                                                     is enabled within the PAUSEEN register, the mask is active
                                                     in the CQIRQMASK field and the event occurs.                              */
      __IOM uint32_t CQUPD      : 1;            /*!< CQ write operation performed a register write with the register
                                                     address bit 0 set to 1. The low address bits in the CQ
                                                     address fields are unused and bit 0 can be used to trigger
                                                     an interrupt to indicate when this register write is performed
                                                     by the CQ operation.                                                      */
      __IOM uint32_t CQERR      : 1;            /*!< Error during command queue operations                                     */
            uint32_t            : 17;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< Command Complete interrupt. Asserted when the current operation
                                                     has completed. For repeated commands, this will only be
                                                     asserted when the final repeated command is completed.                    */
      __IOM uint32_t THR        : 1;            /*!< FIFO Threshold interrupt. For write operations, asserted when
                                                     the number of free bytes in the write FIFO equals or exceeds
                                                     the WTHR field.For read operations, asserted when the number
                                                     of valid bytes in the read FIFO equals of exceeds the value
                                                     set in the RTHR field.                                                    */
      __IOM uint32_t FUNDFL     : 1;            /*!< Read FIFO Underflow interrupt. This occurs when software tries
                                                     to pop from an empty fifo.                                                */
      __IOM uint32_t FOVFL      : 1;            /*!< Write FIFO Overflow interrupt. This occurs when software tries
                                                     to write to a full fifo. The current operation does not
                                                     stop.                                                                     */
      __IOM uint32_t NAK        : 1;            /*!< I2C NAK interrupt. Asserted when an unexpected NAK has been
                                                     received on the I2C bus.                                                  */
      __IOM uint32_t IACC       : 1;            /*!< illegal FIFO access interrupt. Asserted when there is a overflow
                                                     or underflow event                                                        */
      __IOM uint32_t ICMD       : 1;            /*!< illegal command interrupt. Asserted when a command is written
                                                     when an active command is in progress.                                    */
      __IOM uint32_t START      : 1;            /*!< START command interrupt. Asserted when another master on the
                                                     bus has signaled a START command.                                         */
      __IOM uint32_t STOP       : 1;            /*!< STOP command interrupt. Asserted when another master on the
                                                     bus has signaled a STOP command.                                          */
      __IOM uint32_t ARB        : 1;            /*!< Arbitration loss interrupt. Asserted when arbitration is enabled
                                                     and has been lost to another master on the bus. Also asserted
                                                     during I2C write operations when value of 1 expected on
                                                     bus, but 0 is observed. When asserted, the I2C state machine
                                                     will immediately go to idle. This interrupt condition is
                                                     cleared by the next command.                                              */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete. Processing of the DMA operation has completed
                                                     and the DMA submodule is returned into the idle state                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error encountered during the processing of the DMA command.
                                                     The DMA error could occur when the memory access specified
                                                     in the DMA operation is not available or incorrectly specified.           */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command queue is paused due to an active event enabled in the
                                                     PAUSEEN register. The interrupt is posted when the event
                                                     is enabled within the PAUSEEN register, the mask is active
                                                     in the CQIRQMASK field and the event occurs.                              */
      __IOM uint32_t CQUPD      : 1;            /*!< CQ write operation performed a register write with the register
                                                     address bit 0 set to 1. The low address bits in the CQ
                                                     address fields are unused and bit 0 can be used to trigger
                                                     an interrupt to indicate when this register write is performed
                                                     by the CQ operation.                                                      */
      __IOM uint32_t CQERR      : 1;            /*!< Error during command queue operations                                     */
            uint32_t            : 17;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

