AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DCMDCMPEN  : 1;            /*!< Trigger DMA upon command complete. Enables the trigger of the
                                                     DMA when a command is completed. When this event is triggered,
                                                     the number of words transferred will be the lesser of the
                                                     remaining TOTCOUNT bytes, or                                              */
      __IOM uint32_t DTHREN     : 1;            /*!< Trigger DMA upon THR level reached. For M2P DMA operations (IOM
                                                     writes), the trigger will assert when the write FIFO has
                                                     (WTHR/4) number of words free in the write FIFO, and will
                                                     transfer (WTHR/4) number of wordsor, if the number of words
                                                     left to transfer is less than the WTHR value, will transfer
                                                     the remaining byte count.For P2M DMA operations, the trigger
                                                     will assert when the read FIFO has (RTHR/4) words available
                                                     in the read FIFO, and will transfer (RTHR/4) words to SRAM.
                                                     This trigger will NOT assert when the transactioncompletes
                                                     and there are less than RTHR bytes left in the fifo, since
                                                     the RTHR has not been reached. In this case, the CMDCMP
                                                     trigger must also be enabled to transfer the remaining
                                                     read FIFO data to SRAM.                                                   */
            uint32_t            : 30;
    } DMATRIGEN_b;
  } ;

  union {
    __IOM uint32_t DMATRIGSTAT;                 /*!< Provides the status of trigger events that have occurred for
                                                     the transaction. Some of the bits are read only and some
                                                     can be reset via a write of 0.                                            */

    struct {
      __IOM uint32_t DCMDCMP    : 1;            /*!< Triggered DMA from Command complete event. Bit is read only
                                                     and can be cleared by disabling the DCMDCMP trigger enable
                                                     or by disabling DMA.                                                      */
      __IOM uint32_t DTHR       : 1;            /*!< Triggered DMA from THR event. Bit is read only and can be cleared
                                                     by disabling the DTHR trigger enable or by disabling DMA.                 */
      __IOM uint32_t DTOTCMP    : 1;            /*!< DMA triggered when DCMDCMP = 0, and the amount of data in the
                                                     FIFO was enough to complete the DMA operation (greater
                                                     than or equal to current TOTCOUNT) when the command completed.
                                                     This trigger is default active when the DCMDCMP trigger
                                                     isdisabled and there is enough data in the FIFO to complete
                                                     the DMA operation.                                                        */
            uint32_t            : 29;
    } DMATRIGSTAT_b;
  } ;

  union {
    __IOM uint32_t DMACFG;                      /*!< Configuration control of the DMA process, including the direction
                                                     of DMA, and enablement of DMA                                             */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable. Setting this bit to EN will start the DMA operation.
                                                     This should be the last DMA related register set prior
                                                     to issuing the command                                                    */
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 6;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power off module after DMA is complete. If this bit is active,
                                                     the module will request to power off the supply it is attached
                                                     to. If there are other units still requiring power from
                                                     the same domain, power down will not be performed.                        */
            uint32_t            : 22;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< Contains the number of bytes to be transferred for this DMA
                                                     transaction. This register is decremented as the data is
                                                     transferred, and will be 0 at the completion of the DMA
                                                     operation.                                                                */

    struct {
      __IOM uint32_t TOTCOUNT   : 12;           /*!< Triggered DMA from Command complete event occured. Bit is read
                                                     only and can be cleared by disabling the DTHR trigger enable
                                                     or by disabling DMA.                                                      */
            uint32_t            : 20;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< The source or destination address internal the SRAM for the
                                                     DMA data. For write operations, this can only be SRAM data
                                                     (ADDR bit 28 = 1); For read operations, this can ve either
                                                     SRAM or FLASH (ADDR bit 28 = 0)                                           */

