AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TARGADDR   : 29;           /*!< Bits [28:0] of the target byte address for source of DMA (either
                                                     read or write). The address can be any byte alignment,
                                                     and does not have to be word aligned. In cases of non-word
                                                     aligned addresses, the DMA logic will take care for ensuring
                                                     only the target bytes are read/written.                                   */
            uint32_t            : 3;
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< Status of the DMA operation currently in progress.                        */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress indicator. 1 will indicate that a DMA
                                                     transfer is active. The DMA transfer may be waiting on
                                                     data, transferring data, or waiting for priority.All of
                                                     these will be indicated with a 1. A 0 will indicate that
                                                     the DMA is fully complete and no further transactions will
                                                     be done. This bit is read only.                                           */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete. This signals the end of the DMA operation.
                                                     This bit can be cleared by writing to 0, and will also
                                                     be cleared when a new DMA is started.                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error. This active high bit signals an error was encountered
                                                     during the DMA operation. The bit can be cleared by writing
                                                     to 0. Once set, this bit will remain set until cleared
                                                     by software.                                                              */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;

  union {
    __IOM uint32_t CQCFG;                       /*!< Controls parameters and options for execution of the command
                                                     queue operation. To enable command queue, create this in
                                                     memory, set the address, and enable it with a write to
                                                     CQEN                                                                      */

    struct {
      __IOM uint32_t CQEN       : 1;            /*!< Command queue enable. When set, will enable the processing of
                                                     the command queue and fetches of address/data pairs will
                                                     proceed from the word address within the CQADDR register.
                                                     Can be disabledusing a CQ executed write to this bit as
                                                     well.                                                                     */
      __IOM uint32_t CQPRI      : 1;            /*!< Sets the Priority of the command queue dma request                        */
      __IOM uint32_t MSPIFLGSEL : 2;            /*!< Selects the MPSI modules used for sourcing the CQFLAG [11:8].             */
            uint32_t            : 28;
    } CQCFG_b;
  } ;

  union {
    __IOM uint32_t CQADDR;                      /*!< The SRAM address which will be fetched next execution of the
                                                     CQ operation. This register is updated as the CQ operation
                                                     progresses, and is the live version of the register. The
                                                     register can also bewritten by the Command Queue operation
                                                     itself, allowing the relocation of successive CQ fetches.
                                                     In this case, the new CQ address will be used for the next
                                                     CQ address/data fetch                                                     */

    struct {
            uint32_t            : 2;
      __IOM uint32_t CQADDR     : 27;           /*!< Bits 28:2 of target byte address for source of CQ . The buffer
                                                     must be aligned on a word boundary                                        */
            uint32_t            : 3;
    } CQADDR_b;
  } ;

  union {
    __IOM uint32_t CQSTAT;                      /*!< Provides the status of the command queue operation. If the command
                                                     queue is disabled, these bits will be cleared. The bits
                                                     are read only                                                             */

    struct {
      __IOM uint32_t CQTIP      : 1;            /*!< Command queue Transfer In Progress indicator. 1 will indicate
                                                     that a CQ transfer is active and this will remain active
                                                     even when paused waiting for external event.                              */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command queue operation is currently paused.                              */
      __IOM uint32_t CQERR      : 1;            /*!< Command queue processing Error. This active high bit signals
                                                     that an error was encountered during the CQ operation.                    */
            uint32_t            : 29;
    } CQSTAT_b;
  } ;

  union {
    __IOM uint32_t CQFLAGS;                     /*!< Command Queue Flag                                                        */

