AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t CQFLAGS    : 16;           /*!< Current flag status (read-only). Bits [7:0] are software controllable
                                                     and bits [15:8] are hardware status.                                      */
      __IOM uint32_t CQIRQMASK  : 16;           /*!< Mask the bits used to generate the command queue interrupt.
                                                     A '1' in the bit position will enable the pause event to
                                                     trigger the interrupt, if the CQWT_int interrupt is enabled.
                                                     Bits definitions are the same as CQPAUSE                                  */
    } CQFLAGS_b;
  } ;

  union {
    __IOM uint32_t CQSETCLEAR;                  /*!< Set/Clear the command queue software pause flags on a per-bit
                                                     basis. Contains 3 fields, allowing for setting, clearing
                                                     or toggling the value in the software flags. Priority when
                                                     the same bitis enabled in each field is toggle, then set,
                                                     then clear.                                                               */

    struct {
      __IOM uint32_t CQFSET     : 8;            /*!< Set CQFlag status bits. Will set to 1 the value of any SWFLAG
                                                     with a '1' in the corresponding bit position of this field                */
      __IOM uint32_t CQFTGL     : 8;            /*!< Toggle the indicated bit. Will toggle the value of any SWFLAG
                                                     with a '1' in the corresponding bit position of this field                */
      __IOM uint32_t CQFCLR     : 8;            /*!< Clear CQFlag status bits. Will clear to 0 any SWFLAG with a
                                                     '1' in the corresponding bit position of this field                       */
            uint32_t            : 8;
    } CQSETCLEAR_b;
  } ;

  union {
    __IOM uint32_t CQPAUSEEN;                   /*!< Enables a flag to pause an active command queue operation. If
                                                     a bit is '1' and the corresponding bit in the CQFLAG register
                                                     is '1', CQ processing will halt until either value is changed
                                                     to '0'.                                                                   */

    struct {
      __IOM uint32_t CQPEN      : 16;           /*!< Enables the specified event to pause command processing when
                                                     active                                                                    */
            uint32_t            : 16;
    } CQPAUSEEN_b;
  } ;

  union {
    __IOM uint32_t CQCURIDX;                    /*!< Current index value, targeted to be written by register write
                                                     operations within the command queue. This is compared to
                                                     the CQENDIDX and will stop the CQ operation if bit 15 of
                                                     the CQPAUSEEN is '1' andthis current index equals the CQENDIDX
                                                     register value. This will only pause when the values are
                                                     equal.                                                                    */

    struct {
      __IOM uint32_t CQCURIDX   : 8;            /*!< Holds 8 bits of data that will be compared with the CQENDIX
                                                     register field. If the values match, the IDXEQ pause event
                                                     will be activated, which will cause the pausing of command
                                                     quue operation if the IDXEQ bit is enabled in CQPAUSEEN.                  */
            uint32_t            : 24;
    } CQCURIDX_b;
  } ;

  union {
    __IOM uint32_t CQENDIDX;                    /*!< End index value, targeted to be written by software to indicate
                                                     the last valid register pair contained within the command
                                                     queue. rgister write operations within the command queue.This
                                                     is compared to the CQCURIDX and will stop the CQ operation
                                                     if bit 15 of the CQPAUSEEN is '1' andthis current index
                                                     equals the CQCURIDX register value. This will only pause
                                                     when the values are equal.                                                */

    struct {
      __IOM uint32_t CQENDIDX   : 8;            /*!< Holds 8 bits of data that will be compared with the CQCURIX
                                                     register field. If the values match, the IDXEQ pause event
                                                     will be activated, which will cause the pausing of command
                                                     quue operation if the IDXEQ bit is enabled in CQPAUSEEN.                  */
            uint32_t            : 24;
    } CQENDIDX_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< IOM Module Status                                                         */

    struct {
      __IOM uint32_t ERR        : 1;            /*!< Bit has been deprecated. Please refer to the other error indicators.
                                                     This will always return 0.                                                */
      __IOM uint32_t CMDACT     : 1;            /*!< Indicates if the active I/O Command is currently processing
                                                     a transaction, or command is complete, but the FIFO pointers
                                                     are still syncronizing internally. This bit will go high
                                                     atthe start of the transaction, and will go low when the
                                                     command is complete, and the data and pointers within the
                                                     FIFO have been syncronized.                                               */
      __IOM uint32_t IDLEST     : 1;            /*!< indicates if the active I/O state machine is IDLE. Note - The
                                                     state machine could be in idle state due to holdoffs from
                                                     data availability, or as the command gets propagated into
                                                     the logic from the registers.                                             */
            uint32_t            : 29;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED2[13];

  union {
    __IOM uint32_t MSPICFG;                     /*!< Controls the configuration of the SPI master module, including
                                                     POL/PHA, LSB, flow control, and delays for MISO and MOSI                  */

