AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t SPOL       : 1;            /*!< Selects SPI polarity.IMPORTANT NOTICE: Due to the susceptibility
                                                     of creating a clock glitch which could cause register corruption,
                                                     changing SPHA and SPOL bits should be done in separate
                                                     writes to this register.                                                  */
      __IOM uint32_t SPHA       : 1;            /*!< Selects SPI phase.IMPORTANT NOTICE: Due to the susceptibility
                                                     of creating a clock glitch which could cause register corruption,
                                                     changing SPHA and SPOL bits should be done in separate
                                                     writes to this register.                                                  */
      __IOM uint32_t FULLDUP    : 1;            /*!< Enables full duplex mode for Master SPI write operations. Data
                                                     will be captured simultaneously into the read fifo                        */
            uint32_t            : 13;
      __IOM uint32_t WTFC       : 1;            /*!< enables write mode flow control.                                          */
      __IOM uint32_t RDFC       : 1;            /*!< Enables read mode flow control.                                           */
      __IOM uint32_t MOSIINV    : 1;            /*!< Inverts MOSI when flow control is enabled.                                */
            uint32_t            : 1;
      __IOM uint32_t WTFCIRQ    : 1;            /*!< Selects the write mode flow control signal.                               */
      __IOM uint32_t WTFCPOL    : 1;            /*!< selects the write flow control signal polarity. The transfers
                                                     are halted when the selected flow control signal is OPPOSITE
                                                     polarity of bit. (For example: WTFCPOL = 0 will allow a
                                                     IRQ=1 to pause transfers).                                                */
      __IOM uint32_t RDFCPOL    : 1;            /*!< Selects the read flow control signal polarity.                            */
      __IOM uint32_t SPILSB     : 1;            /*!< Selects data transfer as MSB first (0) or LSB first (1) for
                                                     the data portion of the SPI transaction. The offset bytes
                                                     are always transmitted MSB first.                                         */
      __IOM uint32_t DINDLY     : 3;            /*!< Delay tap to use for the input signal (MISO). This gives more
                                                     hold time on the input data.                                              */
      __IOM uint32_t DOUTDLY    : 3;            /*!< Delay tap to use for the output signal (MOSI). This give more
                                                     hold time on the output data                                              */
      __IOM uint32_t MSPIRST    : 1;            /*!< Not used. To reset the module, toggle the SMOD_EN for the module          */
            uint32_t            : 1;
    } MSPICFG_b;
  } ;
  __IM  uint32_t  RESERVED3[15];

  union {
    __IOM uint32_t MI2CCFG;                     /*!< Controls the configuration of the I2C bus master.                         */

    struct {
      __IOM uint32_t ADDRSZ     : 1;            /*!< Sets the I2C master device address size to either 7b (0) or
                                                     10b (1).                                                                  */
      __IOM uint32_t I2CLSB     : 1;            /*!< Direction of data transmit and receive, MSB(0) or LSB(1) first.
                                                     Default per I2C specification is MSB first. This applies
                                                     to both read and write data, and read data will be bit                    */
      __IOM uint32_t ARBEN      : 1;            /*!< Enables multi-master arbitration for the I2C master. If the
                                                     bus is known to have only a single master, this function
                                                     can be disabled to save clock cycles on I2C transactions                  */
            uint32_t            : 1;
      __IOM uint32_t SDADLY     : 2;            /*!< Delay to enable on the SDA output. Values are 0x0-0x3.                    */
      __IOM uint32_t MI2CRST    : 1;            /*!< Not used. To reset the module, toggle the SMOD_EN for the module          */
            uint32_t            : 1;
      __IOM uint32_t SCLENDLY   : 4;            /*!< Number of IOCLK cycles to delay the rising edge of the SCL output
                                                     en (clock will go low on this edge). Used to allow clock
                                                     shaping.                                                                  */
      __IOM uint32_t SDAENDLY   : 4;            /*!< Number of IOCLK cycles to delay the SDA output en (all transitions
                                                     affected). Used to delay data relative to clock                           */
      __IOM uint32_t SMPCNT     : 8;            /*!< Number of Base clk cycles to wait before sampling the SCL clock
                                                     to determine if a clock stretch event has occured                         */
      __IOM uint32_t STRDIS     : 1;            /*!< Disable detection of clock stretch events smaller than 1 cycle            */
            uint32_t            : 7;
    } MI2CCFG_b;
  } ;

  union {
    __IOM uint32_t DEVCFG;                      /*!< Contains the I2C device address.                                          */

