AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DEVADDR    : 10;           /*!< I2C address of the device that the Master will use to target
                                                     for read/write operations. This can be either a 7b or 10b
                                                     address.                                                                  */
            uint32_t            : 22;
    } DEVCFG_b;
  } ;
  __IM  uint32_t  RESERVED4[48];

  union {
    __IOM uint32_t IOMDBG;                      /*!< Debug control                                                             */

    struct {
      __IOM uint32_t DBGEN      : 1;            /*!< Debug Enable. Setting bit will enable the update of data within
                                                     this register, otherwise it is clock gated for power savings              */
      __IOM uint32_t IOCLKON    : 1;            /*!< IOCLK debug clock control. Enable IO_CLK to be active when this
                                                     bit is '1'. Otherwise, the clock is controlled with gating
                                                     from the logic as needed.                                                 */
      __IOM uint32_t APBCLKON   : 1;            /*!< APBCLK debug clock control. Enable APB_CLK to be active when
                                                     this bit is '1'. Otherwise, the clock is controlled with
                                                     gating from the logic as needed.                                          */
      __IOM uint32_t DBGDATA    : 29;           /*!< Debug control for various options. DBGDATA[1:0] is used to select
                                                     between different debug data available in the DBG0 and
                                                     DBG1 registers.                                                           */
    } IOMDBG_b;
  } ;
} IOM0_Type;                                    /*!< Size = 908 (0x38c)                                                        */



/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C/SPI Slave (IOSLAVE)
  */

typedef struct {                                /*!< IOSLAVE Structure                                                         */
  __IM  uint32_t  RESERVED[64];

  union {
    __IOM uint32_t FIFOPTR;                     /*!< Current FIFO Pointer                                                      */

    struct {
      __IOM uint32_t FIFOPTR    : 8;            /*!< Current FIFO pointer.                                                     */
      __IOM uint32_t FIFOSIZ    : 8;            /*!< The number of bytes currently in the hardware FIFO.                       */
            uint32_t            : 16;
    } FIFOPTR_b;
  } ;

  union {
    __IOM uint32_t FIFOCFG;                     /*!< FIFO Configuration                                                        */

    struct {
      __IOM uint32_t FIFOBASE   : 5;            /*!< These bits hold the base address of the I/O FIFO in 8 byte segments.
                                                     The IO Slave FIFO is situated in LRAM at (FIFOBASE*8) to
                                                     (FIFOMAX*8-1).                                                            */
            uint32_t            : 3;
      __IOM uint32_t FIFOMAX    : 6;            /*!< These bits hold the maximum FIFO address in 8 byte segments.
                                                     It is also the beginning of the RAM area of the LRAM. Note
                                                     that no RAM area is configured if FIFOMAX is set to 0x1F.                 */
            uint32_t            : 10;
      __IOM uint32_t ROBASE     : 6;            /*!< Defines the read-only area. The IO Slave read-only area is situated
                                                     in LRAM at (ROBASE*8) to (FIFOBASE*8-1)                                   */
            uint32_t            : 2;
    } FIFOCFG_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< FIFO Threshold Configuration                                              */

    struct {
      __IOM uint32_t FIFOTHR    : 8;            /*!< FIFO size interrupt threshold.                                            */
            uint32_t            : 24;
    } FIFOTHR_b;
  } ;

  union {
    __IOM uint32_t FUPD;                        /*!< FIFO Update Status                                                        */

    struct {
      __IOM uint32_t FIFOUPD    : 1;            /*!< This bit indicates that a FIFO update is underway.                        */
      __IOM uint32_t IOREAD     : 1;            /*!< This bitfield indicates an IO read is active.                             */
            uint32_t            : 30;
    } FUPD_b;
  } ;

  union {
    __IOM uint32_t FIFOCTR;                     /*!< Overall FIFO Counter                                                      */

    struct {
      __IOM uint32_t FIFOCTR    : 10;           /*!< Virtual FIFO byte count                                                   */
            uint32_t            : 22;
    } FIFOCTR_b;
  } ;

  union {
    __IOM uint32_t FIFOINC;                     /*!< Overall FIFO Counter Increment                                            */

    struct {
      __IOM uint32_t FIFOINC    : 10;           /*!< Increment the Overall FIFO Counter by this value on a write               */
            uint32_t            : 22;
    } FIFOINC_b;
  } ;

  union {
    __IOM uint32_t CFG;                         /*!< I/O Slave Configuration                                                   */

