AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t IFCSEL     : 1;            /*!< This bit selects the I/O interface.                                       */
      __IOM uint32_t SPOL       : 1;            /*!< This bit selects SPI polarity.                                            */
      __IOM uint32_t LSB        : 1;            /*!< This bit selects the transfer bit ordering.                               */
            uint32_t            : 1;
      __IOM uint32_t STARTRD    : 1;            /*!< This bit holds the cycle to initiate an I/O RAM read.                     */
            uint32_t            : 3;
      __IOM uint32_t I2CADDR    : 12;           /*!< 7-bit or 10-bit I2C device address.                                       */
      __IOM uint32_t WRAPPTR    : 1;            /*!< Address pointer wrap mode enable.                                         */
            uint32_t            : 10;
      __IOM uint32_t IFCEN      : 1;            /*!< IOSLAVE interface enable.                                                 */
    } CFG_b;
  } ;

  union {
    __IOM uint32_t PRENC;                       /*!< I/O Slave Interrupt Priority Encode                                       */

    struct {
      __IOM uint32_t PRENC      : 5;            /*!< These bits hold the priority encode of the REGACC interrupts.             */
            uint32_t            : 27;
    } PRENC_b;
  } ;

  union {
    __IOM uint32_t IOINTCTL;                    /*!< I/O Interrupt Control                                                     */

    struct {
      __IOM uint32_t IOINTEN    : 8;            /*!< These read-only bits indicate whether the IOINT interrupts are
                                                     enabled.                                                                  */
      __IOM uint32_t IOINT      : 8;            /*!< These bits read the IOINT interrupts.                                     */
      __IOM uint32_t IOINTCLR   : 1;            /*!< This bit clears all of the IOINT interrupts when written with
                                                     a 1.                                                                      */
            uint32_t            : 7;
      __IOM uint32_t IOINTSET   : 8;            /*!< These bits set the IOINT interrupts when written with a 1.                */
    } IOINTCTL_b;
  } ;

  union {
    __IOM uint32_t GENADD;                      /*!< General Address Data                                                      */

    struct {
      __IOM uint32_t GADATA     : 8;            /*!< The data supplied on the last General Address reference.                  */
            uint32_t            : 24;
    } GENADD_b;
  } ;

  union {
    __IOM uint32_t ADDPTR;                      /*!< Address pointer                                                           */

    struct {
      __IOM uint32_t ADDPTR     : 8;            /*!< The current value in the Address pointer.                                 */
            uint32_t            : 24;
    } ADDPTR_b;
  } ;
  __IM  uint32_t  RESERVED1[53];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
      __IOM uint32_t GENAD      : 1;            /*!< I2C General Address interrupt.                                            */
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
            uint32_t            : 22;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
      __IOM uint32_t GENAD      : 1;            /*!< I2C General Address interrupt.                                            */
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
            uint32_t            : 22;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

