AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t CHIPID0    : 32;           /*!< Unique chip ID 0.                                                         */
    } CHIPID0_b;
  } ;

  union {
    __IOM uint32_t CHIPID1;                     /*!< Unique Chip ID 1                                                          */

    struct {
      __IOM uint32_t CHIPID1    : 32;           /*!< Unique chip ID 1.                                                         */
    } CHIPID1_b;
  } ;

  union {
    __IOM uint32_t CHIPREV;                     /*!< Chip Revision                                                             */

    struct {
      __IOM uint32_t REVMIN     : 4;            /*!< Minor Revision ID.                                                        */
      __IOM uint32_t REVMAJ     : 4;            /*!< Major Revision ID.                                                        */
      __IOM uint32_t SIPART     : 12;           /*!< Silicon Part ID                                                           */
            uint32_t            : 12;
    } CHIPREV_b;
  } ;

  union {
    __IOM uint32_t VENDORID;                    /*!< Unique Vendor ID                                                          */

    struct {
      __IOM uint32_t VENDORID   : 32;           /*!< Unique Vendor ID                                                          */
    } VENDORID_b;
  } ;

  union {
    __IOM uint32_t SKU;                         /*!< Unique Chip SKU                                                           */

    struct {
      __IOM uint32_t SKUSRAMSIZE : 2;           /*!< SRAM SKU dictates the available memory for MCU. All of the MCU
                                                     TCM is always available in addition to these. 0: 512K SSRAM,
                                                     1: 1MB SSRAM, 2: 1MB SSRAM + DSP Memories                                 */
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< MRAM size SKU. 0:0.5MB, 1=1MB, 2=1.5MB, 3:2MB                             */
      __IOM uint32_t SKUDSP     : 2;            /*!< DSP availability SKU setting. 0:No DSPs available, 1: DSP0 only
                                                     available, 2 (or 3): Both DSP0 and DSP1 are available                     */
      __IOM uint32_t SKUTURBOSPOT : 1;          /*!< High performance mode for MCU and DSPs.                                   */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< MIPI DSI available                                                        */
      __IOM uint32_t SKUGFX     : 1;            /*!< GFX available                                                             */
      __IOM uint32_t SKUUSB     : 1;            /*!< USB available                                                             */
      __IOM uint32_t SKUSECURESPOT : 1;         /*!< Secure boot feature                                                       */
            uint32_t            : 21;
    } SKU_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t DEBUGGER;                    /*!< Debugger Control                                                          */

    struct {
      __IOM uint32_t LOCKOUT    : 32;           /*!< Lockout of debugger (SWD).                                                */
    } DEBUGGER_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ACRG;                        /*!< Active Current Reference Generator Control                                */

    struct {
      __IOM uint32_t ACRGSWE    : 1;            /*!< Software enablement for ACRG register. A value of 1 will allow
                                                     writes to the register                                                    */
      __IOM uint32_t ACRGPWD    : 1;            /*!< Power down the ACRG.                                                      */
      __IOM uint32_t ACRGIBIASSEL : 1;          /*!< Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect. The inversion of this register
                                                     is driven to analog.                                                      */
      __IOM uint32_t ACRGTRIM   : 5;            /*!< ACRG Trim value                                                           */
            uint32_t            : 24;
    } ACRG_b;
  } ;
  __IM  uint32_t  RESERVED2[6];

  union {
    __IOM uint32_t VREFGEN2;                    /*!< Voltage Reference Generator 2 Control                                     */

    struct {
      __IOM uint32_t TVRGTEMPCOTRIM : 5;        /*!< Calibrated Voltage Reference Generator tc trim (bottom transistor)        */
      __IOM uint32_t TVRGPWD    : 1;            /*!< Power Down, Calibrated Voltage Reference Generator.                       */
      __IOM uint32_t TVRGCURRENTTRIM : 1;       /*!< Calibrated voltage reference current trim.                                */
      __IOM uint32_t TVRGVREFTRIM : 7;          /*!< Calibrated voltage reference 580m trim                                    */
      __IOM uint32_t TVRG2TEMPCOTRIM : 5;       /*!< Calibrated Voltage Reference Generator tc trim (bottom transistor)        */
      __IOM uint32_t TVRG2PWD   : 1;            /*!< Power Down, Calibrated Voltage Reference Generator.                       */
      __IOM uint32_t TVRG2CURRENTTRIM : 1;      /*!< Calibrated voltage reference current trim.                                */
      __IOM uint32_t TVRG2VREFTRIM : 7;         /*!< Calibrated voltage reference 580m trim                                    */
      __IOM uint32_t TVRGSELVREF : 1;           /*!< TVRG SEL VREF                                                             */
      __IOM uint32_t TVRG2SELVREF : 1;          /*!< TVRG2 SEL VREF                                                            */
            uint32_t            : 2;
    } VREFGEN2_b;
  } ;
  __IM  uint32_t  RESERVED3[6];

  union {
    __IOM uint32_t VRCTRL;                      /*!< Overrides for Voltage Regulators Controls                                 */

