AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t CALONPWRUP : 1;            /*!< Run ADC Calibration on initial power up sequence                          */
      __IOM uint32_t ADCCALIBRATED : 1;         /*!< Status for ADC Calibration                                                */
            uint32_t            : 30;
    } ADCCAL_b;
  } ;

  union {
    __IOM uint32_t ADCBATTLOAD;                 /*!< ADC Battery Load Enable                                                   */

    struct {
      __IOM uint32_t BATTLOAD   : 1;            /*!< Enable the ADC battery load resistor                                      */
            uint32_t            : 31;
    } ADCBATTLOAD_b;
  } ;
  __IM  uint32_t  RESERVED9[3];

  union {
    __IOM uint32_t XTALCTRL;                    /*!< XTAL Oscillator Control                                                   */

    struct {
      __IOM uint32_t XTALSWE    : 1;            /*!< XTAL Software Override Enable.                                            */
      __IOM uint32_t XTALCOREDISFB : 1;         /*!< XTAL Oscillator Disable Feedback.                                         */
      __IOM uint32_t XTALCOMPBYPASS : 1;        /*!< XTAL Oscillator Bypass Comparator.                                        */
      __IOM uint32_t XTALPDNB   : 1;            /*!< XTAL Oscillator Power Down Core.                                          */
      __IOM uint32_t XTALCOMPPDNB : 1;          /*!< XTAL Oscillator Power Down Comparator.                                    */
      __IOM uint32_t XTALIBUFTRIM : 2;          /*!< XTAL IBUFF trim                                                           */
      __IOM uint32_t XTALICOMPTRIM : 2;         /*!< XTAL ICOMP trim                                                           */
            uint32_t            : 23;
    } XTALCTRL_b;
  } ;

  union {
    __IOM uint32_t XTALGENCTRL;                 /*!< XTAL Oscillator General Control                                           */

    struct {
      __IOM uint32_t ACWARMUP   : 2;            /*!< Auto-calibration delay control                                            */
      __IOM uint32_t XTALBIASTRIM : 6;          /*!< XTAL BIAS trim                                                            */
      __IOM uint32_t XTALKSBIASTRIM : 6;        /*!< XTAL IBIAS Kick start trim. This trim value is used during the
                                                     startup process to enable a faster lock.                                  */
            uint32_t            : 18;
    } XTALGENCTRL_b;
  } ;

  union {
    __IOM uint32_t XTALHSTRIMS;                 /*!< XTALHS Trims                                                              */

    struct {
      __IOM uint32_t XTALHSCAP2TRIM : 6;        /*!< xtalhs_cap2_trim                                                          */
      __IOM uint32_t XTALHSCAPTRIM : 4;         /*!< xtalhs_cap_trim                                                           */
      __IOM uint32_t XTALHSDRIVETRIM : 2;       /*!< xtalhs_drive_trim                                                         */
      __IOM uint32_t XTALHSDRIVERSTRENGTH : 3;  /*!< xtalhs_driver_strength                                                    */
      __IOM uint32_t XTALHSIBIASCOMP2TRIM : 2;  /*!< xtalhs_ibias_comp2_trim                                                   */
      __IOM uint32_t XTALHSIBIASCOMPTRIM : 4;   /*!< xtalhs_ibias_comp_trim                                                    */
      __IOM uint32_t XTALHSIBIASTRIM : 7;       /*!< xtalhs_ibias_trim                                                         */
      __IOM uint32_t XTALHSRSTRIM : 1;          /*!< xtalhs_rs_trim                                                            */
      __IOM uint32_t XTALHSSPARE : 1;           /*!< xtalhs_spare                                                              */
            uint32_t            : 2;
    } XTALHSTRIMS_b;
  } ;

  union {
    __IOM uint32_t XTALHSCTRL;                  /*!< XTALHS Control                                                            */

    struct {
      __IOM uint32_t XTALHSPDNB : 1;            /*!< xtalhs_pdnb                                                               */
      __IOM uint32_t XTALHSCOMPPDNB : 1;        /*!< xtalhs_comp_pdnb                                                          */
      __IOM uint32_t XTALHSCOMPSEL : 1;         /*!< xtalhs_comp_sel                                                           */
      __IOM uint32_t XTALHSIBSTENABLE : 1;      /*!< xtalhs_ibst_enable                                                        */
      __IOM uint32_t XTALHSINJECTIONENABLE : 1; /*!< xtalhs_injection_enable                                                   */
      __IOM uint32_t XTALHSPDNPNIMPROVE : 1;    /*!< xtalhs_pdn_pn_improve                                                     */
      __IOM uint32_t XTALHSSELRCOM : 1;         /*!< xtalhs_sel_rcom                                                           */
      __IOM uint32_t XTALHSPADOUTEN : 1;        /*!< xtalhs_padout_en                                                          */
      __IOM uint32_t XTALHSEXTERNALCLOCK : 1;   /*!< xtalhs_external_clock                                                     */
            uint32_t            : 23;
    } XTALHSCTRL_b;
  } ;
  __IM  uint32_t  RESERVED10[20];

  union {
    __IOM uint32_t MRAMPWRCTRL;                 /*!< MRAM Power Control                                                        */

    struct {
      __IOM uint32_t MRAMLPREN  : 1;            /*!< MRAM low power mode enable                                                */
      __IOM uint32_t MRAMSLPEN  : 1;            /*!< MRAM sleep mode enable                                                    */
      __IOM uint32_t MRAMPWRCTRL : 1;           /*!< MRAM low power mode control. '0' tmc_lpr and tmc_slp are driven
                                                     into mcu_ctrl, '1' tmc_lpr and tmc_slp are driven into
                                                     MRAM wrapper.                                                             */
            uint32_t            : 29;
    } MRAMPWRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED11[10];

  union {
    __IOM uint32_t BODISABLE;                   /*!< Brownout Disable                                                          */

