AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
            uint32_t            : 6;
      __IOM uint32_t SIMOBUCKRXCLKACTTRIM : 5;  /*!< This divides the 5 MHz refresh clock. Even divides are supported
                                                     only. This value represents the division amount minus 1.                  */
            uint32_t            : 11;
      __IOM uint32_t SIMOBUCKTONCLKTRIM : 4;    /*!< This divides the 100 MHz ton clock. Even divides are supported
                                                     only. This value represents the division amount minus 1.                  */
            uint32_t            : 6;
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< SIMO Buck Muxed VDDC Active Sequence Trim Control                         */

    struct {
            uint32_t            : 11;
      __IOM uint32_t SIMOBUCKVDDCACTHIGHTONTRIM : 4;/*!< VDDC active high ton trim control for Buck sequence.                  */
            uint32_t            : 9;
      __IOM uint32_t SIMOBUCKVDDCACTLOWTONTRIM : 4;/*!< VDDC active high ton trim control for Buck sequence.                   */
            uint32_t            : 4;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< SIMO Buck Muxed VDDC low power Sequence Trim Control                      */

    struct {
            uint32_t            : 2;
      __IOM uint32_t SIMOBUCKVDDCLPDRVSTRTRIM : 2;/*!< VDDC LP trim control for drive strength.                                */
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDCLPHIGHTOFFTRIM : 5;/*!< VDDC LP high toff trim control for Buck sequence.                     */
      __IOM uint32_t SIMOBUCKVDDCLPHIGHTONTRIM : 4;/*!< VDDC LP high ton trim control for Buck sequence.                       */
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDCLPLOWTOFFTRIM : 5;/*!< VDDC LP low toff trim control for Buck sequence.                       */
      __IOM uint32_t SIMOBUCKVDDCLPLOWTONTRIM : 4;/*!< VDDC LP low ton trim control for Buck sequence.                         */
            uint32_t            : 2;
    } SIMOBUCK3_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK4;                   /*!< SIMO Buck Muxed VDDC LV Active Sequence Trim Control                      */

    struct {
      __IOM uint32_t VDDCLVACTDRVSTRTRIM : 2;   /*!< VDDC LV active trim control for drive strength.                           */
            uint32_t            : 4;
      __IOM uint32_t VDDCLVACTHIGHTOFFTRIM : 5; /*!< VDDC LV active high toff trim control for Buck sequence.                  */
      __IOM uint32_t VDDCLVACTHIGHTONTRIM : 4;  /*!< VDDC LV active high ton trim control for Buck sequence.                   */
            uint32_t            : 4;
      __IOM uint32_t VDDCLVACTLOWTOFFTRIM : 5;  /*!< VDDC LV active low trim control for a 500 MHz clock inside the
                                                     simobuck analog design.                                                   */
      __IOM uint32_t VDDCLVACTLOWTONTRIM : 4;   /*!< VDDC LV active low ton trim control for Buck sequence.                    */
            uint32_t            : 4;
    } SIMOBUCK4_b;
  } ;
  __IM  uint32_t  RESERVED19;

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< SIMO Buck Muxed VDDF Active Sequence Trim Control                         */

    struct {
            uint32_t            : 17;
      __IOM uint32_t SIMOBUCKVDDFACTHIGHTONTRIM : 4;/*!< VDDF active high ton trim control for Buck sequence.                  */
            uint32_t            : 11;
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< SIMO Buck Muxed VDDF active Sequence Trim Control                         */

    struct {
            uint32_t            : 4;
      __IOM uint32_t VDDFACTLOWTOFFTRIM : 5;    /*!< VDDF active low toff trim control for Buck sequence.                      */
      __IOM uint32_t VDDFACTLOWTONTRIM : 4;     /*!< VDDF active low ton trim control for Buck sequence.                       */
      __IOM uint32_t VDDFLPDRVSTRTRIM : 2;      /*!< VDDF active trim control for drive strength.                              */
            uint32_t            : 3;
      __IOM uint32_t ZXCOMPZXTRIM : 5;          /*!< Zxcomp trim. Feedthrough to analog.                                       */
            uint32_t            : 9;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< SIMO Buck Muxed VDDF Low Power Sequence Trim Control                      */

    struct {
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDFLPHIGHTOFFTRIM : 5;/*!< VDDF low power high toff trim control for Buck sequence.              */
      __IOM uint32_t SIMOBUCKVDDFLPHIGHTONTRIM : 4;/*!< VDDF low power high ton trim control for Buck sequence.                */
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDFLPLOWTOFFTRIM : 5;/*!< VDDF low power low toff trim control for Buck sequence.                */
      __IOM uint32_t SIMOBUCKVDDFLPLOWTONTRIM : 4;/*!< VDDF low power low ton trim control for Buck sequence.                  */
            uint32_t            : 6;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< SIMO Buck Muxed VDDS Active Sequence Trim Control                         */

    struct {
            uint32_t            : 17;
      __IOM uint32_t SIMOBUCKVDDSACTHIGHTONTRIM : 4;/*!< VDDS active high ton trim control for Buck sequence.                  */
            uint32_t            : 1;
      __IOM uint32_t SIMOBUCKVDDSACTLOWTONTRIM : 4;/*!< VDDS active low ton trim control for Buck sequence.                    */
            uint32_t            : 6;
    } SIMOBUCK9_b;
  } ;
  __IM  uint32_t  RESERVED20[2];

  union {
    __IOM uint32_t SIMOBUCK12;                  /*!< SIMO Buck Compare, Brown out, Active, Low power Trim Control              */

    struct {
      __IOM uint32_t VDDCLVCOMPTRIMMINUS : 5;   /*!< Static trim to allow separation between low power and active
                                                     rail.                                                                     */
      __IOM uint32_t VDDCLVCOMPTRIMPLUS : 5;    /*!< Static trim to allow separation when low power GT active rail.            */
      __IOM uint32_t VDDCLVBRNOUTTRIM : 10;     /*!< Digital brown out max counter value for VDDC LV rail.                     */
      __IOM uint32_t ACTTRIMVDDF : 6;           /*!< Active VDDF trim.                                                         */
      __IOM uint32_t LPTRIMVDDF : 6;            /*!< Low power VDDF trim.                                                      */
    } SIMOBUCK12_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK13;                  /*!< SIMO Buck Compare, Brown out, Active, Low power Trim Control              */

