AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
            uint32_t            : 20;
      __IOM uint32_t SIMOBUCKACTTRIMVDDS : 6;   /*!< Active VDDS trim.                                                         */
      __IOM uint32_t SIMOBUCKLPTRIMVDDS : 6;    /*!< Low power VDDS trim.                                                      */
    } SIMOBUCK13_b;
  } ;
  __IM  uint32_t  RESERVED21;

  union {
    __IOM uint32_t SIMOBUCK15;                  /*!< SIMO Buck Compare, Brown out, Active and Low power Trim Control           */

    struct {
      __IOM uint32_t VDDCCOMPTRIMMINUS : 5;     /*!< Static trim to allow separation between low power and active
                                                     rail.                                                                     */
      __IOM uint32_t VDDCCOMPTRIMPLUS : 5;      /*!< Static trim to allow separation when low power GT active rail.            */
      __IOM uint32_t VDDCBRNOUTTRIM : 10;       /*!< Digital brown out max counter value for VDDC rail.                        */
      __IOM uint32_t VDDCLVRXCOMPTRIMEN : 1;    /*!< Enable the VDDC LV rail. If not enabled, the rail will not be
                                                     regulated. This must be done before simobuck comes up.                    */
      __IOM uint32_t VDDSRXCOMPTRIMEN : 1;      /*!< Enable the VDDS rail. If not enabled, the rail will not be regulated.
                                                     This must be done before simobuck comes up.                               */
      __IOM uint32_t VDDFRXCOMPTRIMEN : 1;      /*!< Enable the VDDF rail. If not enabled, the rail will not be regulated.
                                                     This must be done before simobuck comes up.                               */
      __IOM uint32_t VDDCRXCOMPTRIMEN : 1;      /*!< Enable the VDDC rail. If not enabled, the rail will not be regulated.
                                                     This must be done before simobuck comes up.                               */
      __IOM uint32_t ZXCOMPOFFSETTRIM : 5;      /*!< Zxcomp offset trim. Feedthrough to analog.                                */
            uint32_t            : 2;
      __IOM uint32_t TRIMLATCHOVER : 1;         /*!< Override / Bypass the simobuck trim latch to enable on-the-fly
                                                     trimming for VDDF and VDDS active and LP trims                            */
    } SIMOBUCK15_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< PWRSW Control 0                                                           */

    struct {
      __IOM uint32_t PWRSWVDDCPUDYNSEL : 2;     /*!< override value for pwrsw_vddcpu_dynsel                                    */
            uint32_t            : 1;
      __IOM uint32_t PWRSWVDDCPUOVERRIDE : 1;   /*!< override enable for pwrsw_vddcpu_dynsel and pgn                           */
      __IOM uint32_t PWRSWVDDCAORDYNSEL : 2;    /*!< override value for pwrsw_vddcaor_dynsel                                   */
      __IOM uint32_t PWRSWVDDCAOROVERRIDE : 1;  /*!< override enable for pwrsw_vddcaor_dynsel                                  */
            uint32_t            : 8;
      __IOM uint32_t PWRSWVDDMCPUDYNSEL : 1;    /*!< override value for pwrsw_vddmcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDMCPUSTATSEL : 1;   /*!< VDDMCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDMCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddmcpu_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP0DYNSEL : 1;   /*!< override value for pwrsw_vddmdsp0_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP0STATSEL : 1;  /*!< VDDMDSP0 power switch static select                                       */
      __IOM uint32_t PWRSWVDDMDSP0OVERRIDE : 1; /*!< override enable for pwrsw_vddmdsp0_dynsel                                 */
      __IOM uint32_t PWRSWVDDMDSP1DYNSEL : 1;   /*!< override value for pwrsw_vddmdsp1_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP1STATSEL : 1;  /*!< VDDMDSP1 power switch static select                                       */
      __IOM uint32_t PWRSWVDDMDSP1OVERRIDE : 1; /*!< override enable for pwrsw_vddmdsp1_dynsel                                 */
      __IOM uint32_t PWRSWVDDMLDYNSEL : 1;      /*!< override value for pwrsw_vddml_dynsel                                     */
            uint32_t            : 1;
      __IOM uint32_t PWRSWVDDMLOVERRIDE : 1;    /*!< override enable for pwrsw_vddml_dynsel                                    */
      __IOM uint32_t PWRSWVDDRCPUDYNSEL : 2;    /*!< override value for pwrsw_vddrcpu_dynsel                                   */
            uint32_t            : 1;
      __IOM uint32_t PWRSWVDDRCPUSTATSEL : 1;   /*!< VDDRCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDRCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddrcpu_dynsel and pgn                          */
    } PWRSW0_b;
  } ;

  union {
    __IOM uint32_t PWRSW1;                      /*!< PWRSW Control 1                                                           */

    struct {
            uint32_t            : 25;
      __IOM uint32_t USEVDDF4VDDRCPUINHP : 1;   /*!< Setting this bit selects VDDF for VDDRCPU in when MCU is in
                                                     HP mode. This is valid for only normal operational mode
                                                     (i.e without overrides).                                                  */
            uint32_t            : 2;
      __IOM uint32_t SHORTVDDCVDDCLVOREN : 1;   /*!< pwrsw short override select for vddc/vddclv                               */
      __IOM uint32_t SHORTVDDCVDDCLVORVAL : 1;  /*!< pwrsw short override value for vddc/vddclv                                */
      __IOM uint32_t SHORTVDDFVDDSOREN : 1;     /*!< pwrsw short override select for vddf/vdds                                 */
      __IOM uint32_t SHORTVDDFVDDSORVAL : 1;    /*!< pwrsw short override value for vddf/vdds                                  */
    } PWRSW1_b;
  } ;
  __IM  uint32_t  RESERVED22[9];

  union {
    __IOM uint32_t FLASHWPROT0;                 /*!< These bits write-protect flash in 16KB chunks.                            */

