AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DMAWPROT0  : 32;           /*!< Write protect SRAM from DMA. Each bit provides write protection
                                                     for an 8KB region of memory. When set to 1, the region
                                                     will be protected from DMA writes, when set to 0, DMA may
                                                     write the region.                                                         */
    } DMASRAMWPROT0_b;
  } ;

  union {
    __IOM uint32_t DMASRAMWPROT1;               /*!< These bits write-protect system SRAM from DMA operations in
                                                     8KB chunks.                                                               */

    struct {
      __IOM uint32_t DMAWPROT1  : 16;           /*!< Write protect SRAM from DMA. Each bit provides write protection
                                                     for an 8KB region of memory. When set to 1, the region
                                                     will be protected from DMA writes, when set to 0, DMA may
                                                     write the region.                                                         */
            uint32_t            : 16;
    } DMASRAMWPROT1_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT0;               /*!< These bits read-protect system SRAM from DMA operations in 8KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t DMARPROT0  : 32;           /*!< Read protect SRAM from DMA. Each bit provides write protection
                                                     for an 8KB region of memory. When set to 1, the region
                                                     will be protected from DMA reads, when set to 0, DMA may
                                                     read the region.                                                          */
    } DMASRAMRPROT0_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT1;               /*!< These bits read-protect system SRAM from DMA operations in 8KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t DMARPROT1  : 16;           /*!< Read protect SRAM from DMA. Each bit provides write protection
                                                     for an 8KB region of memory. When set to 1, the region
                                                     will be protected from DMA reads, when set to 0, DMA may
                                                     read the region.                                                          */
            uint32_t            : 16;
    } DMASRAMRPROT1_b;
  } ;
  __IM  uint32_t  RESERVED23[16];

  union {
    __IOM uint32_t USBPHYRESET;                 /*!< DSP0 CACHE RAM TRIM                                                       */

    struct {
      __IOM uint32_t USBPHYPORRSTDIS : 1;       /*!< De-assert USB PHY POR reset override                                      */
      __IOM uint32_t USBPHYUTMIRSTDIS : 1;      /*!< De-assert USB PHY UTMI reset override                                     */
            uint32_t            : 30;
    } USBPHYRESET_b;
  } ;
  __IM  uint32_t  RESERVED24[4];

  union {
    __IOM uint32_t AUDADCPWRCTRL;               /*!< Audio ADC Power Control                                                   */

    struct {
      __IOM uint32_t AUDADCPWRCTRLSWE : 1;      /*!< Audio ADC Power Control Software Override Enable                          */
      __IOM uint32_t AUDADCAPSEN : 1;           /*!< Enable the Global audio ADC Power Switch on when set to 1 if
                                                     the AUDADCPWRCTRLSWE bit is set.                                          */
      __IOM uint32_t AUDADCBPSEN : 1;           /*!< Enable the Analog, IO and SAR Digital logic Power Switch on
                                                     when set to 1 if the AUDADCPWRCTRLSWE bit is set.                         */
      __IOM uint32_t AUDBGTPEN  : 1;            /*!< Bandgap and Temperature Sensor Power Switch Enable                        */
      __IOM uint32_t AUDREFBUFPEN : 1;          /*!< Reference Buffer Power Switch Enable                                      */
      __IOM uint32_t AUDREFKEEPPEN : 1;         /*!< Reference Buffer Keeper Power Switch Enable                               */
            uint32_t            : 2;
      __IOM uint32_t VDDAUDADCSARISOLATE : 1;   /*!< ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN is
                                                     switched off )                                                            */
      __IOM uint32_t VDDAUDADCDIGISOLATE : 1;   /*!< ISOLATE signal for audio ADC Digital Contoller ( when AUDADCAPSEN
                                                     is switched off and if the AUDADCPWRCTRLSWE bit is set)                   */
      __IOM uint32_t VDDAUDADCRESETN : 1;       /*!< RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t AUDADCVBATDIVEN : 1;       /*!< Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE bit
                                                     is set )                                                                  */
            uint32_t            : 1;
      __IOM uint32_t AUDADCINBUFSEL : 2;        /*!< Audio ADC input buffer mux select                                         */
      __IOM uint32_t AUDADCINBUFEN : 1;         /*!< Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
      __IOM uint32_t AUDADCRFBUFSLWEN : 1;      /*!< Audio ADC reference buffer slew enable                                    */
      __IOM uint32_t AUDADCKEEPOUTEN : 1;       /*!< Audio ADC reference keeper out en                                         */
            uint32_t            : 13;
    } AUDADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t AUDIO1;                      /*!< Audio trims 1                                                             */

