AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
            uint32_t            : 6;
      __IOM uint32_t MICBIASVOLTAGETRIM : 6;    /*!< Output voltage trim                                                       */
      __IOM uint32_t MICBIASPDNB : 1;           /*!< Power down control for the block                                          */
            uint32_t            : 19;
    } AUDIO1_b;
  } ;
  __IM  uint32_t  RESERVED25;

  union {
    __IOM uint32_t PGAADCIFCTRL;                /*!< PGA ADCIF control                                                         */

    struct {
      __IOM uint32_t PGAADCIFCHAACTIVE : 2;     /*!< PGAADCIF active signal for channels A0 and A1. Starts and stops
                                                     2 clocks after demultiplexed SOC signal.                                  */
      __IOM uint32_t PGAADCIFCHAPDNB : 2;       /*!< Power down for channels A0 and A1 (0 = powered down; 1 = standby)         */
      __IOM uint32_t PGAADCIFCHBACTIVE : 2;     /*!< PGAADCIF active signal for channels B0 and B1. Starts and stops
                                                     2 clocks after demultiplexed SOC signal.                                  */
      __IOM uint32_t PGAADCIFCHBPDNB : 2;       /*!< Power down for channels B0 and B1 (0 = powered down; 1 = standby)         */
            uint32_t            : 4;
      __IOM uint32_t PGAADCIFVCOMPEN : 1;       /*!< Enable for VCOMP output                                                   */
      __IOM uint32_t PGAADCIFVCOMPSEL : 2;      /*!< Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)                      */
            uint32_t            : 17;
    } PGAADCIFCTRL_b;
  } ;

  union {
    __IOM uint32_t PGACTRL1;                    /*!< PGA control 1                                                             */

    struct {
      __IOM uint32_t PGACHA0GAIN1SEL : 3;       /*!< Channel A0 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)              */
      __IOM uint32_t PGACHA0GAIN2DIV2SEL : 1;   /*!< Channel A0 PGA divide by two select (0: 0 dB, 1: -6dB), needed
                                                     for fully differential inputs                                             */
      __IOM uint32_t PGACHA0GAIN2SEL : 5;       /*!< Channel A0 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)             */
      __IOM uint32_t PGACHA1GAIN1SEL : 3;       /*!< Channel A1 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)              */
      __IOM uint32_t PGACHA1GAIN2DIV2SEL : 1;   /*!< Channel A1 PGA divide by two select (0: 0 dB, 1: -6dB), needed
                                                     for fully differential inputs                                             */
      __IOM uint32_t PGACHA1GAIN2SEL : 5;       /*!< Channel A1 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)             */
      __IOM uint32_t PGACHABYPASSEN : 2;        /*!< Bypass enable for Channels A0 and A1 (1: bypass, when gain LT
                                                     12 dB; 0: otherwise)                                                      */
      __IOM uint32_t PGACHAOPAMPINPDNB : 2;     /*!< Channels A0 and A1 input stage opamp power down (0: powered
                                                     down, 1: powered up). Must be 1 when respective PGACHABYPASSEN
                                                     = 0.                                                                      */
      __IOM uint32_t PGACHAOPAMPOUTPDNB : 2;    /*!< Channels A0 and A1 output stage opamp power down (0: powered
                                                     down, 1: powered up)                                                      */
      __IOM uint32_t PGACHAVCMGENPDNB : 1;      /*!< Channel A VCMGEN power down (0: powered down, 1: powered up)              */
      __IOM uint32_t PGACHAVCMGENQCHARGEEN : 1; /*!< Channel A VCMGEN quick charge enable (pulsed during channel
                                                     powerup)                                                                  */
      __IOM uint32_t PGAIREFGENPDNB : 1;        /*!< IREFGEN power down (0: powered down, 1: powered up)                       */
      __IOM uint32_t PGAVREFGENPDNB : 1;        /*!< VREFGEN power down (0: powered down, 1: powered up)                       */
      __IOM uint32_t PGAVREFGENQUICKSTARTEN : 1;/*!< VREFGEN quick start enable (pulsed during startup)                        */
      __IOM uint32_t VCOMPSELPGA : 1;           /*!< Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)                      */
            uint32_t            : 1;
      __IOM uint32_t PGAGAINAOVRD : 1;          /*!< Apply BYPASS and GAIN bits from this register (for channel A)
                                                     instead of automatically via audio ADC. Note that audio
                                                     ADC FIFO meta data will not reflect dB gain as used when
                                                     configuring audio ADC.                                                    */
    } PGACTRL1_b;
  } ;

  union {
    __IOM uint32_t PGACTRL2;                    /*!< PGA control 2                                                             */

    struct {
      __IOM uint32_t PGACHB0GAIN1SEL : 3;       /*!< Channel B0 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)              */
      __IOM uint32_t PGACHB0GAIN2DIV2SEL : 1;   /*!< Channel B0 PGA divide by two select (0: 0 dB, 1: -6dB), needed
                                                     for fully differential inputs                                             */
      __IOM uint32_t PGACHB0GAIN2SEL : 5;       /*!< Channel B0 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)             */
      __IOM uint32_t PGACHB1GAIN1SEL : 3;       /*!< Channel B1 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)              */
      __IOM uint32_t PGACHB1GAIN2DIV2SEL : 1;   /*!< Channel B1 PGA divide by two select (0: 0 dB, 1: -6dB), needed
                                                     for fully differential inputs                                             */
      __IOM uint32_t PGACHB1GAIN2SEL : 5;       /*!< Channel B1 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)             */
      __IOM uint32_t PGACHBBYPASSEN : 2;        /*!< Bypass enable for Channels B0 and B1 (1: bypass, when gain LT
                                                     12 dB; 0: otherwise)                                                      */
      __IOM uint32_t PGACHBOPAMPINPDNB : 2;     /*!< Channels B0 and B1 input stage opamp power down (0: powered
                                                     down, 1: powered up). Must be 1 when respective PGACHBBYPASSEN
                                                     = 0.                                                                      */
      __IOM uint32_t PGACHBOPAMPOUTPDNB : 2;    /*!< Channels B0 and B1 output stage opamp power down (0: powered
                                                     down, 1: powered up)                                                      */
      __IOM uint32_t PGACHBVCMGENPDNB : 1;      /*!< Channel B VCMGEN power down (0: powered down, 1: powered up)              */
      __IOM uint32_t PGACHBVCMGENQCHARGEEN : 1; /*!< Channel B VCMGEN quick charge enable (pulsed during channel
                                                     powerup)                                                                  */
            uint32_t            : 5;
      __IOM uint32_t PGAGAINBOVRD : 1;          /*!< Apply BYPASS and GAIN bits from this register (for channel B)
                                                     instead of automatically via audio ADC. Note that audio
                                                     ADC FIFO meta data will not reflect dB gain as used when
                                                     configuring audio ADC.                                                    */
    } PGACTRL2_b;
  } ;

  union {
    __IOM uint32_t AUDADCPWRDLY;                /*!< Audio ADC Power Up Delay Control                                          */

