AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t START      : 1;            /*!< Write to 1 to initiate a PIO transaction on the bus (typically
                                                     the entire register should be written at once with this
                                                     bit set).                                                                 */
      __IOM uint32_t STATUS     : 1;            /*!< Command status: 1 indicates command has completed. Cleared by
                                                     writing 1 to this bit or starting a new transfer.                         */
      __IOM uint32_t BUSY       : 1;            /*!< Command status: 1 indicates controller is busy (command in progress)      */
            uint32_t            : 1;
      __IOM uint32_t PIODEV     : 1;            /*!< Selects the Device configutation to use for PIO requests                  */
      __IOM uint32_t SENDA      : 1;            /*!< Indicates whether an address phase should be sent (see ADDR
                                                     register and ASIZE field in CFG register)                                 */
      __IOM uint32_t SENDI      : 1;            /*!< Indicates whether an instruction phase should be sent (see INSTR
                                                     field and ISIZE field in CFG register)                                    */
      __IOM uint32_t TXRX       : 1;            /*!< 1 Indicates a TX operation, 0 indicates an RX operation of XFERBYTES      */
      __IOM uint32_t BIGENDIAN  : 1;            /*!< 1 indicates data in FIFO is in big endian format (MSB first);
                                                     0 indicates little endian data (default, LSB first).                      */
      __IOM uint32_t PIOSCRAMBLE : 1;           /*!< Enables data scrambling for PIO opertions. This should only
                                                     be used for data operations and never for commands to a
                                                     device.                                                                   */
      __IOM uint32_t ENTURN     : 1;            /*!< Indicates whether TX->RX turnaround cycles should be enabled
                                                     for this operation (see TURNAROUND field in CFG register).                */
      __IOM uint32_t ENDCX      : 1;            /*!< Enable DCX signal on data [1]                                             */
      __IOM uint32_t ENWLAT     : 1;            /*!< Enable Write Latency Counter (time between address and first
                                                     data byte). Counter value is WRITELATENCY.                                */
      __IOM uint32_t PIOMIXED   : 3;            /*!< Provides override controls for data operations where instruction,
                                                     address, and data may transfer in different rates.                        */
      __IOM uint32_t XFERBYTES  : 16;           /*!< Number of bytes to transmit or receive (based on TXRX bit)                */
    } CTRL_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t ADDR;                        /*!< Optional Address field to send for PIO transfers                          */

    struct {
      __IOM uint32_t ADDR       : 32;           /*!< Optional Address field to send (after optional instruction field)
                                                     - qualified by ASIZE in CMD register. NOTE: This register
                                                     is aliased to DMADEVADDR.                                                 */
    } ADDR_b;
  } ;

  union {
    __IOM uint32_t INSTR;                       /*!< Optional Instruction field to send for PIO transfers                      */

    struct {
      __IOM uint32_t INSTR      : 16;           /*!< Optional Instruction field to send (1st byte) - qualified by
                                                     ISEND/ISIZE                                                               */
            uint32_t            : 16;
    } INSTR_b;
  } ;

  union {
    __IOM uint32_t TXFIFO;                      /*!< TX Data FIFO                                                              */

    struct {
      __IOM uint32_t TXFIFO     : 32;           /*!< Data to be transmitted. Data should normally be aligned to the
                                                     LSB (pad the upper bits with zeros) unless BIGENDIAN is
                                                     set.                                                                      */
    } TXFIFO_b;
  } ;

  union {
    __IOM uint32_t RXFIFO;                      /*!< RX Data FIFO                                                              */

    struct {
      __IOM uint32_t RXFIFO     : 32;           /*!< Receive data. Data is aligned to the LSB (padded zeros on upper
                                                     bits) unless BIGENDIAN is set.                                            */
    } RXFIFO_b;
  } ;

  union {
    __IOM uint32_t TXENTRIES;                   /*!< Number of words in TX FIFO                                                */

    struct {
      __IOM uint32_t TXENTRIES  : 6;            /*!< Number of 32-bit words/entries in TX FIFO                                 */
            uint32_t            : 26;
    } TXENTRIES_b;
  } ;

  union {
    __IOM uint32_t RXENTRIES;                   /*!< Number of words in RX FIFO                                                */

    struct {
      __IOM uint32_t RXENTRIES  : 6;            /*!< Number of 32-bit words/entries in RX FIFO                                 */
            uint32_t            : 26;
    } RXENTRIES_b;
  } ;

  union {
    __IOM uint32_t THRESHOLD;                   /*!< Threshold levels that trigger RXFull and TXEmpty interrupts               */

    struct {
      __IOM uint32_t TXTHRESH   : 6;            /*!< Number of entries in TX FIFO that cause TXF interrupt                     */
            uint32_t            : 2;
      __IOM uint32_t RXTHRESH   : 6;            /*!< Number of entries in TX FIFO that cause RXE interrupt                     */
            uint32_t            : 18;
    } THRESHOLD_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t MSPICFG;                     /*!< Timing configuration bits for the MSPI module. PRSTN, IPRSTN,
                                                     and FIFORESET can be used to reset portions of the MSPI
                                                     interface in order to clear error conditions. The remaining
                                                     bits control clock frequency and TX/RX capture timings.                   */

