AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t EMULATEDDR0 : 1;           /*!< Drive external clock at 1/2 rate to emulate DDR mode                      */
      __IOM uint32_t QUADDDR0   : 1;            /*!< Enables use of delay line to provide fine control over traditional
                                                     RX capture clock.                                                         */
      __IOM uint32_t ENABLEDQS0 : 1;            /*!< In EMULATEDDR mode, enable DQS for read capture                           */
      __IOM uint32_t DQSSYNCNEG0 : 1;           /*!< Use negative edge of clock for DDR data sync                              */
      __IOM uint32_t OVERRIDERXDQSDELAY0 : 1;   /*!< Override DQS delay line with the value in DQSDELAY (for RX capture
                                                     in QUADDDR mode)                                                          */
      __IOM uint32_t OVERRIDEDDRCLKOUTDELAY0 : 1;/*!< Override TX delay line with the value in DQSDELAY (for TX clock
                                                     offset when in QUADDDR mode)                                              */
      __IOM uint32_t ENABLEFINEDELAY0 : 1;      /*!< Enables use of delay line to provide fine control over traditional
                                                     RX capture clock.                                                         */
            uint32_t            : 1;
      __IOM uint32_t RXDQSDELAY0 : 5;           /*!< When OVERRIDEDQSDELAY is set this sets the DQS delay line value.
                                                     In ENABLEDQS mode, this acts as an offset to the computed
                                                     value (should be set to 0 by default)                                     */
            uint32_t            : 3;
      __IOM uint32_t TXDQSDELAY0 : 5;           /*!< When OVERRIDEDQSDELAY is set this sets the DQS delay line value.
                                                     In ENABLEDQS mode, this acts as an offset to the computed
                                                     value (should be set to 0 by default)                                     */
            uint32_t            : 11;
    } DEV0DDR_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t DEV0XIP;                     /*!< When any SPI flash is configured, this register must be properly
                                                     programmed before XIP or AUTO DMA operations commence.                    */

    struct {
      __IOM uint32_t XIPEN0     : 1;            /*!< Enable the XIP (eXecute In Place) function which effectively
                                                     enables the address decoding of the MSPI device in the
                                                     flash/cache address space at address 0x04000000-0x07FFFFFF.               */
            uint32_t            : 1;
      __IOM uint32_t XIPACK0    : 2;            /*!< Controls transmission of Micron XIP acknowledge cycles (Micron
                                                     Flash devices only)                                                       */
      __IOM uint32_t XIPBIGENDIAN0 : 1;         /*!< Indicates whether XIP/AUTO DMA data transfers are in big or
                                                     little endian format                                                      */
      __IOM uint32_t XIPENTURN0 : 1;            /*!< Indicates whether XIP/AUTO DMA operations should enable TX->RX
                                                     turnaround cycles                                                         */
      __IOM uint32_t XIPSENDA0  : 1;            /*!< Indicates whether XIP/AUTO DMA operations should send an an
                                                     address phase (see DMADEVADDR register and ASIZE field
                                                     in CFG)                                                                   */
      __IOM uint32_t XIPSENDI0  : 1;            /*!< Indicates whether XIP/AUTO DMA operations should send an instruction
                                                     (see READINSTR field and ISIZE field in CFG)                              */
      __IOM uint32_t XIPMIXED0  : 3;            /*!< Provides override controls for data operations where instruction,
                                                     address, and data may transfer in different rates.                        */
      __IOM uint32_t XIPENDCX0  : 1;            /*!< Enable DCX signal on data [1] for XIP/DMA operations                      */
      __IOM uint32_t XIPENWLAT0 : 1;            /*!< Enable Write Latency counter for XIP write transactions                   */
      __IOM uint32_t XIPTURNAROUND0 : 6;        /*!< Number of turnaound cycles (for TX->RX transitions). Qualified
                                                     by XIPENTURN bit field.                                                   */
      __IOM uint32_t XIPWRITELATENCY0 : 6;      /*!< Number of write Latency cycles. Qualified by XIPENWLAT bit field.         */
            uint32_t            : 7;
    } DEV0XIP_b;
  } ;

  union {
    __IOM uint32_t DEV0INSTR;                   /*!< When any SPI flash is configured, this register must be properly
                                                     programmed before XIP or AUTO DMA operations commence.                    */

    struct {
      __IOM uint32_t WRITEINSTR0 : 16;          /*!< Write command sent for DMA operations                                     */
      __IOM uint32_t READINSTR0 : 16;           /*!< Read command sent to flash for DMA/XIP operations                         */
    } DEV0INSTR_b;
  } ;

  union {
    __IOM uint32_t DEV0BOUNDARY;                /*!< Allows large transfers to be broken up into smaller ones in
                                                     hardware to accommodate needs of external devices and allow
                                                     XIP/XIPMM. Only applicable for memory-mapped devices (PSRAM,
                                                     Flash, etc) where address can be retransmitted without
                                                     side effects.                                                             */

