AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t FIFOREAD   : 32;           /*!< FIFO read data.                                                           */
    } FIFOREAD_b;
  } ;

  union {
    __IOM uint32_t FIFOFLUSH;                   /*!< FIFO Flush                                                                */

    struct {
      __IOM uint32_t FIFOFLUSH  : 1;            /*!< FIFO FLUSH.                                                               */
            uint32_t            : 31;
    } FIFOFLUSH_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< FIFO Threshold                                                            */

    struct {
      __IOM uint32_t FIFOTHR    : 5;            /*!< FIFO Threshold value. When the FIFO count is equal to, or larger
                                                     than this value (in words), a THR interrupt is generated
                                                     (if enabled). If used for DMA purposes then only supported
                                                     values are 0x4, 0x8, 0xc, 0x10, 0x14, 0x18 and 0x1C.                      */
            uint32_t            : 27;
    } FIFOTHR_b;
  } ;
  __IM  uint32_t  RESERVED[56];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED1[12];

  union {
    __IOM uint32_t DMATRIGEN;                   /*!< DMA Trigger Enable                                                        */

    struct {
      __IOM uint32_t DTHR       : 1;            /*!< Trigger DMA upon when FIFO iss filled to level indicated by
                                                     the FIFO THRESHOLD,at granularity of 16 bytes only                        */
      __IOM uint32_t DTHR90     : 1;            /*!< Trigger DMA at FIFO 90 percent full. This signal is also used
                                                     internally for AUTOHIP function                                           */
            uint32_t            : 30;
    } DMATRIGEN_b;
  } ;

  union {
    __IOM uint32_t DMATRIGSTAT;                 /*!< DMA Trigger Status                                                        */

