AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DTHRSTAT   : 1;            /*!< Triggered DMA from FIFO reaching threshold                                */
      __IOM uint32_t DTHR90STAT : 1;            /*!< Triggered DMA from FIFO reaching 90 percent full                          */
            uint32_t            : 30;
    } DMATRIGSTAT_b;
  } ;

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA Configuration                                                         */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable                                                                */
            uint32_t            : 1;
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 5;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DAUTOHIP   : 1;            /*!< Raise priority to high on fifo full, and DMAPRI set to low                */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power Off the ADC System upon DMACPL.                                     */
            uint32_t            : 21;
    } DMACFG_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< DMA Target Address                                                        */

    struct {
      __IOM uint32_t LTARGADDR  : 28;           /*!< DMA Target Address. This register is not updated with the current
                                                     address of the DMA, but will remain static with the original
                                                     address during the DMA transfer.                                          */
      __IOM uint32_t UTARGADDR  : 4;            /*!< SRAM Target                                                               */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< DMA Status                                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress                                                  */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error                                                                 */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;
  __IM  uint32_t  RESERVED3[61];

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< DMA Total Transfer Count                                                  */

    struct {
      __IOM uint32_t TOTCOUNT   : 20;           /*!< Total Transfer Count. The transfer count must be a multiple
                                                     of the THR setting to avoid DMA overruns.                                 */
            uint32_t            : 12;
    } DMATOTCOUNT_b;
  } ;
} PDM0_Type;                                    /*!< Size = 596 (0x254)                                                        */



/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PWR Controller Register Bank (PWRCTRL)
  */

typedef struct {                                /*!< PWRCTRL Structure                                                         */

  union {
    __IOM uint32_t MCUPERFREQ;                  /*!< This register provides the performance mode knobs for MCU. S/w
                                                     should write the *PERFREQ field to desired mode and wait
                                                     for the *PERFACK and check for the *PERFSTATUS. Some times
                                                     system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

    struct {
      __IOM uint32_t MCUPERFREQ : 2;            /*!< MCU Performance mode request                                              */
      __IOM uint32_t MCUPERFACK : 1;            /*!< Indicates the MCU performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t MCUPERFSTATUS : 2;         /*!< MCU Performance mode request                                              */
            uint32_t            : 27;
    } MCUPERFREQ_b;
  } ;

  union {
    __IOM uint32_t DEVPWREN;                    /*!< This enables various peripherals power domains.                           */

    struct {
      __IOM uint32_t PWRENIOS   : 1;            /*!< Power up IO Slave                                                         */
      __IOM uint32_t PWRENIOM0  : 1;            /*!< Power up IO Master 0                                                      */
      __IOM uint32_t PWRENIOM1  : 1;            /*!< Power up IO Master 1                                                      */
      __IOM uint32_t PWRENIOM2  : 1;            /*!< Power up IO Master 2                                                      */
      __IOM uint32_t PWRENIOM3  : 1;            /*!< Power up IO Master 3                                                      */
      __IOM uint32_t PWRENIOM4  : 1;            /*!< Power up IO Master 4                                                      */
      __IOM uint32_t PWRENIOM5  : 1;            /*!< Power up IO Master 5                                                      */
      __IOM uint32_t PWRENIOM6  : 1;            /*!< Power up IO Master 6                                                      */
      __IOM uint32_t PWRENIOM7  : 1;            /*!< Power up IO Master 7                                                      */
      __IOM uint32_t PWRENUART0 : 1;            /*!< Power up UART Controller 0                                                */
      __IOM uint32_t PWRENUART1 : 1;            /*!< Power up UART Controller 1                                                */
      __IOM uint32_t PWRENUART2 : 1;            /*!< Power up UART Controller 2                                                */
      __IOM uint32_t PWRENUART3 : 1;            /*!< Power up UART Controller 3                                                */
      __IOM uint32_t PWRENADC   : 1;            /*!< Power up ADC Digital Controller                                           */
      __IOM uint32_t PWRENMSPI0 : 1;            /*!< Power up MSPI Controller0                                                 */
      __IOM uint32_t PWRENMSPI1 : 1;            /*!< Power up MSPI Controller1                                                 */
      __IOM uint32_t PWRENMSPI2 : 1;            /*!< Power up MSPI Controller2                                                 */
      __IOM uint32_t PWRENGFX   : 1;            /*!< Power up GFX controller                                                   */
      __IOM uint32_t PWRENDISP  : 1;            /*!< Power up DISP controller                                                  */
      __IOM uint32_t PWRENDISPPHY : 1;          /*!< Power up DISP PHY                                                         */
      __IOM uint32_t PWRENCRYPTO : 1;           /*!< Power up CRYPTO module                                                    */
      __IOM uint32_t PWRENSDIO  : 1;            /*!< Power up SDIO controller                                                  */
      __IOM uint32_t PWRENUSB   : 1;            /*!< Power up USB controller                                                   */
      __IOM uint32_t PWRENUSBPHY : 1;           /*!< Power up USB PHY                                                          */
      __IOM uint32_t PWRENDBG   : 1;            /*!< Powerup DBG power domain                                                  */
            uint32_t            : 7;
    } DEVPWREN_b;
  } ;

  union {
    __IOM uint32_t DEVPWRSTATUS;                /*!< This provides the power status for the peripheral device domains
                                                     controlled through DEVPWREN register. Value of 1 means
                                                     the device is powred up and ready to be used and 0 means
                                                     its not powered up.                                                       */

