AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t PWRENDTCM  : 3;            /*!< Power up DTCM                                                             */
      __IOM uint32_t PWRENNVM0  : 1;            /*!< Power up NVM0                                                             */
      __IOM uint32_t PWRENCACHEB0 : 1;          /*!< Power up Cache Bank 0. This works in conjunction with Cache
                                                     enable from flash_cache module. To power up cache bank0,
                                                     cache has to be enabled and this bit has to be set.                       */
      __IOM uint32_t PWRENCACHEB2 : 1;          /*!< Power up Cache Bank 2. This works in conjunction with Cache
                                                     enable from flash_cache module. To power up cache bank2,
                                                     cache has to be enabled and this bit has to be set.                       */
            uint32_t            : 26;
    } MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t MEMPWRSTATUS;                /*!< It provides the power status for all the memory banks including-
                                                     caches, nvm (0 and 1) and all the SRAM groups. The status
                                                     here should reflect the enable provided by the MEMPWREN
                                                     register. There may be a lag time between setting the bits
                                                     in MEMPWREN register and MEMPWRSTATUS register, due to
                                                     the need to cycle the power gate and isolation seqeunces
                                                     to the memory banks.                                                      */

    struct {
      __IOM uint32_t PWRSTDTCM  : 3;            /*!< Power status for DTCM. Each bit corresponds to one of the TCMs.
                                                     bit0=DTCM0_0, bit1=DTCM0_1, bit2=DTCM1.                                   */
      __IOM uint32_t PWRSTNVM0  : 1;            /*!< This bit is 1 if power is supplied to NVM 0                               */
      __IOM uint32_t PWRSTCACHEB0 : 1;          /*!< This bit is 1 if power is supplied to Cache Bank 0                        */
      __IOM uint32_t PWRSTCACHEB2 : 1;          /*!< This bit is 1 if power is supplied to Cache Bank 2                        */
            uint32_t            : 26;
    } MEMPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMRETCFG;                   /*!< This controls the power down of the SRAM banks in deep sleep
                                                     mode. If this is set, then the power for that SRAM bank
                                                     will be gated when the core goes into deep sleep. Upon
                                                     wake, the data within the SRAMs will be erased. If this
                                                     is not set, retention voltage will be applied to the SRAM
                                                     bank when the core goes into deep sleep. Upon wake, the
                                                     data within the SRAMs are retained. Do not set this if
                                                     the SRAM bank is used as the target for DMA transfer while
                                                     CPU in deepsleep.                                                         */

    struct {
      __IOM uint32_t DTCMPWDSLP : 3;            /*!< power down DTCM in deep sleep                                             */
      __IOM uint32_t NVM0PWDSLP : 1;            /*!< Powerdown NVM0 in deep sleep                                              */
      __IOM uint32_t CACHEPWDSLP : 1;           /*!< power down cache in deep sleep                                            */
            uint32_t            : 27;
    } MEMRETCFG_b;
  } ;

  union {
    __IOM uint32_t SYSPWRSTATUS;                /*!< Power ON Status for domains that are not part of devpwrstatus
                                                     or mempwrstatus                                                           */

    struct {
      __IOM uint32_t PWRSTMCUL  : 1;            /*!< Power Domain status for MCUL                                              */
      __IOM uint32_t PWRSTMCUH  : 1;            /*!< Power Domain status for MCUH                                              */
      __IOM uint32_t PWRSTDSP0H : 1;            /*!< Power Domain status for DSP0H                                             */
      __IOM uint32_t PWRSTDSP1H : 1;            /*!< Power Domain status for DSP1H                                             */
            uint32_t            : 25;
      __IOM uint32_t CORESLEEP  : 1;            /*!< Indicates MCU entered SLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t COREDEEPSLEEP : 1;         /*!< Indicates MCU entered DEEPSLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t SYSDEEPSLEEP : 1;          /*!< Indicates all device domains powered down and MCU entered DEEPSLEEP
                                                     state since it was last cleared. Write 1 to to clear it.                  */
    } SYSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t SSRAMPWREN;                  /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the SSRAMRETCFG register. If
                                                     this register is not set, then power will always be disabled
                                                     to the memory bank.                                                       */

