AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP1PCMRSTDLY : 4;         /*!< PCM Reset delay in number of 24MHz clocks.                                */
      __IOM uint32_t DSP1PCMRSTOR : 1;          /*!< PCM Reset override. If this is disabled, then h/w will handle
                                                     the de-assertion of pcm reset.                                            */
            uint32_t            : 27;
    } DSP1PWRCTRL_b;
  } ;

  union {
    __IOM uint32_t DSP1PERFREQ;                 /*!< This register provides the performance mode knobs for DSP1.
                                                     S/w should write the *PERFREQ field to desired mode and
                                                     wait for the *PERFACK and check for the *PERFSTATUS. Some
                                                     times system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

    struct {
      __IOM uint32_t DSP1PERFREQ : 2;           /*!< DSP1 Performance mode request                                             */
      __IOM uint32_t DSP1PERFACK : 1;           /*!< Indicates the DSP1 performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t DSP1PERFSTATUS : 2;        /*!< DSP1 Performance mode request                                             */
            uint32_t            : 27;
    } DSP1PERFREQ_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMPWREN;                /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the DSP1MEMRETCFG register when
                                                     DSP1 is OFF.                                                              */

    struct {
      __IOM uint32_t PWRENDSP1RAM : 1;          /*!< Power up DSP1 IRAM and DRAM                                               */
      __IOM uint32_t PWRENDSP1ICACHE : 1;       /*!< Power up DSP1 ICACHE banks                                                */
            uint32_t            : 30;
    } DSP1MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMPWRST;                /*!< It provides the power status for all the memories of DSP1 subsystem       */

    struct {
      __IOM uint32_t PWRSTDSP1RAM : 1;          /*!< Status- 1:ON, 0:OFF                                                       */
      __IOM uint32_t PWRSTDSP1ICACHE : 1;       /*!< Power Status- 1:ON, 0:OFF                                                 */
            uint32_t            : 30;
    } DSP1MEMPWRST_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMRETCFG;               /*!< This controls the power down of the DRAM/IRAM/CACHE banks when
                                                     DSP1 is powered off. If this is set, then the power for
                                                     that corresponding SRAM bank will be gated when the DSP1
                                                     is powered off and data is erased. If this is not set,
                                                     retention voltage will be applied when DSP1 is powered
                                                     off. Do not set this if the SRAM bank is used as the target
                                                     for DMA transfer while DSP1 is powered off.                               */

    struct {
      __IOM uint32_t RAMPWDDSP1OFF : 1;         /*!< IRAM/DRAM banks are powered down when DSP1 is switched off,
                                                     causing the contents of the bank to be lost.                              */
      __IOM uint32_t DSP1RAMACTMCU : 1;         /*!< Keep the memory domain active based on MCU state.                         */
      __IOM uint32_t ICACHEPWDDSP1OFF : 1;      /*!< ICACHE is powered down when DSP1 is switched off, causing the
                                                     contents of the bank to be lost.                                          */
      __IOM uint32_t DSP1RAMACTDISP : 1;        /*!< Keep the memory domain active based on DISP state.                        */
      __IOM uint32_t DSP1RAMACTGFX : 1;         /*!< Keep the memory domain active based on GFX state.                         */
            uint32_t            : 27;
    } DSP1MEMRETCFG_b;
  } ;
  __IM  uint32_t  RESERVED3[31];

  union {
    __IOM uint32_t VRCTRL;                      /*!< This register includes additional debug control bits. This is
                                                     an internal Ambiq-only register. Customers should not attempt
                                                     to change this or else functionality cannot be guaranteed.                */

    struct {
      __IOM uint32_t SIMOBUCKEN : 1;            /*!< Enables and Selects the SIMO Buck as the supply for the low-voltage
                                                     power domains. It takes the initial value from the bit
                                                     set in Customer INFO space.                                               */
            uint32_t            : 31;
    } VRCTRL_b;
  } ;

  union {
    __IOM uint32_t LEGACYVRLPOVR;               /*!< When an override is set for a power domain, VR logic will ignore
                                                     that power domain state in making a decision to go into
                                                     lp state.                                                                 */

    struct {
      __IOM uint32_t IGNOREIOS  : 1;            /*!< Ignore IOS                                                                */
      __IOM uint32_t IGNOREHCPA : 1;            /*!< Ignore HCPA                                                               */
      __IOM uint32_t IGNOREHCPB : 1;            /*!< Ignore HCPB                                                               */
      __IOM uint32_t IGNOREHCPC : 1;            /*!< Ignore HCPC                                                               */
      __IOM uint32_t IGNOREHCPD : 1;            /*!< Ignore HCPD                                                               */
      __IOM uint32_t IGNOREHCPE : 1;            /*!< Ignore HCPE                                                               */
      __IOM uint32_t IGNOREMSPI : 1;            /*!< Ignore MSPI                                                               */
      __IOM uint32_t IGNOREGFX  : 1;            /*!< Ignore GFX                                                                */
      __IOM uint32_t IGNOREDISP : 1;            /*!< Ignore DISP Control                                                       */
      __IOM uint32_t IGNOREDISPPHY : 1;         /*!< Ignore DISP PHY                                                           */
      __IOM uint32_t IGNORECRYPTO : 1;          /*!< Ignore CRYPTO                                                             */
      __IOM uint32_t IGNORESDIO : 1;            /*!< Ignore SDIO                                                               */
      __IOM uint32_t IGNOREUSB  : 1;            /*!< Ignore USB Control                                                        */
      __IOM uint32_t IGNOREUSBPHY : 1;          /*!< Ignore USB PHY                                                            */
      __IOM uint32_t IGNOREAUD  : 1;            /*!< Ignore AUD                                                                */
      __IOM uint32_t IGNOREDSPA : 1;            /*!< Ignore DSPA                                                               */
      __IOM uint32_t IGNOREDSP0H : 1;           /*!< Ignore DSP0H                                                              */
      __IOM uint32_t IGNOREDSP1H : 1;           /*!< Ignore DSP1H                                                              */
      __IOM uint32_t IGNOREDBG  : 1;            /*!< Ignore DBG                                                                */
            uint32_t            : 13;
    } LEGACYVRLPOVR_b;
  } ;

  union {
    __IOM uint32_t VRSTATUS;                    /*!< Provides BUCK and LDOs status.                                            */

