AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t CORELDOST  : 2;            /*!< Indicates CORELDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t MEMLDOST   : 2;            /*!< Indicates MEMLDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t SIMOBUCKST : 2;            /*!< Indicates SIMO BUCK status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP                                                          */
            uint32_t            : 26;
    } VRSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED4[13];

  union {
    __IOM uint32_t PWRWEIGHTULP0;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTULPMCU   : 4;            /*!< Weight used for ULP mode MCU                                              */
      __IOM uint32_t WTULPDSP0  : 4;            /*!< Weight used for ULP mode DSP0                                             */
      __IOM uint32_t WTULPDSP1  : 4;            /*!< Weight used for ULP mode DSP1                                             */
      __IOM uint32_t WTULPIOS   : 4;            /*!< Weight used for ULP mode IOS                                              */
      __IOM uint32_t WTULPUART0 : 4;            /*!< Weight used for ULP mode UART0                                            */
      __IOM uint32_t WTULPUART1 : 4;            /*!< Weight used for ULP mode UART1                                            */
      __IOM uint32_t WTULPUART2 : 4;            /*!< Weight used for ULP mode UART2                                            */
      __IOM uint32_t WTULPUART3 : 4;            /*!< Weight used for ULP mode UART3                                            */
    } PWRWEIGHTULP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP1;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTULPIOM0  : 4;            /*!< Weight used for ULP mode IOM0                                             */
      __IOM uint32_t WTULPIOM1  : 4;            /*!< Weight used for ULP mode IOM1                                             */
      __IOM uint32_t WTULPIOM2  : 4;            /*!< Weight used for ULP mode IOM2                                             */
      __IOM uint32_t WTULPIOM3  : 4;            /*!< Weight used for ULP mode IOM3                                             */
      __IOM uint32_t WTULPIOM4  : 4;            /*!< Weight used for ULP mode IOM4                                             */
      __IOM uint32_t WTULPIOM5  : 4;            /*!< Weight used for ULP mode IOM5                                             */
      __IOM uint32_t WTULPIOM6  : 4;            /*!< Weight used for ULP mode IOM6                                             */
      __IOM uint32_t WTULPIOM7  : 4;            /*!< Weight used for ULP mode IOM7                                             */
    } PWRWEIGHTULP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP2;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTULPADC   : 4;            /*!< Weight used for ULP mode ADC                                              */
      __IOM uint32_t WTULPMSPI0 : 4;            /*!< Weight used for ULP mode MSPI0                                            */
      __IOM uint32_t WTULPMSPI1 : 4;            /*!< Weight used for ULP mode MSPI1                                            */
      __IOM uint32_t WTULPGFX   : 4;            /*!< Weight used for ULP mode GFX                                              */
      __IOM uint32_t WTULPDISP  : 4;            /*!< Weight used for ULP mode DISP                                             */
      __IOM uint32_t WTULPCRYPTO : 4;           /*!< Weight used for ULP mode CRYPTO                                           */
      __IOM uint32_t WTULPSDIO  : 4;            /*!< Weight used for ULP mode SDIO                                             */
      __IOM uint32_t WTULPUSB   : 4;            /*!< Weight used for ULP mode USB                                              */
    } PWRWEIGHTULP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP3;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTULPDSPA  : 4;            /*!< Weight used for ULP mode DSPA                                             */
      __IOM uint32_t WTULPDBG   : 4;            /*!< Weight used for ULP mode DBG                                              */
      __IOM uint32_t WTULPAUDREC : 4;           /*!< Weight used for ULP mode AUDREC                                           */
      __IOM uint32_t WTULPAUDPB : 4;            /*!< Weight used for ULP mode AUDPB                                            */
      __IOM uint32_t WTULPAUDADC : 4;           /*!< Weight used for ULP mode AUDADC                                           */
            uint32_t            : 8;
      __IOM uint32_t WTULPMSPI2 : 4;            /*!< Weight used for ULP mode MSPI2                                            */
    } PWRWEIGHTULP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP4;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

