AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t WTULPI2S0  : 4;            /*!< Weight used for ULP mode I2S0                                             */
      __IOM uint32_t WTULPI2S1  : 4;            /*!< Weight used for ULP mode I2S1                                             */
            uint32_t            : 8;
      __IOM uint32_t WTULPPDM0  : 4;            /*!< Weight used for ULP mode PDM0                                             */
      __IOM uint32_t WTULPPDM1  : 4;            /*!< Weight used for ULP mode PDM1                                             */
      __IOM uint32_t WTULPPDM2  : 4;            /*!< Weight used for ULP mode PDM2                                             */
      __IOM uint32_t WTULPPDM3  : 4;            /*!< Weight used for ULP mode PDM3                                             */
    } PWRWEIGHTULP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP5;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTULPDISPPHY : 4;          /*!< Weight used for ULP mode DISP PHY                                         */
      __IOM uint32_t WTULPUSBPHY : 4;           /*!< Weight used for ULP mode USB PHY                                          */
            uint32_t            : 24;
    } PWRWEIGHTULP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP0;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPMCU    : 4;            /*!< Weight used for LP mode MCU                                               */
      __IOM uint32_t WTLPDSP0   : 4;            /*!< Weight used for LP mode DSP0                                              */
      __IOM uint32_t WTLPDSP1   : 4;            /*!< Weight used for LP mode DSP1                                              */
      __IOM uint32_t WTLPIOS    : 4;            /*!< Weight used for LP mode IOS                                               */
      __IOM uint32_t WTLPUART0  : 4;            /*!< Weight used for LP mode UART0                                             */
      __IOM uint32_t WTLPUART1  : 4;            /*!< Weight used for LP mode UART1                                             */
      __IOM uint32_t WTLPUART2  : 4;            /*!< Weight used for LP mode UART2                                             */
      __IOM uint32_t WTLPUART3  : 4;            /*!< Weight used for LP mode UART3                                             */
    } PWRWEIGHTLP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP1;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPIOM0   : 4;            /*!< Weight used for LP mode IOM0                                              */
      __IOM uint32_t WTLPIOM1   : 4;            /*!< Weight used for LP mode IOM1                                              */
      __IOM uint32_t WTLPIOM2   : 4;            /*!< Weight used for LP mode IOM2                                              */
      __IOM uint32_t WTLPIOM3   : 4;            /*!< Weight used for LP mode IOM3                                              */
      __IOM uint32_t WTLPIOM4   : 4;            /*!< Weight used for LP mode IOM4                                              */
      __IOM uint32_t WTLPIOM5   : 4;            /*!< Weight used for LP mode IOM5                                              */
      __IOM uint32_t WTLPIOM6   : 4;            /*!< Weight used for LP mode IOM6                                              */
      __IOM uint32_t WTLPIOM7   : 4;            /*!< Weight used for LP mode IOM7                                              */
    } PWRWEIGHTLP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP2;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPADC    : 4;            /*!< Weight used for LP mode ADC                                               */
      __IOM uint32_t WTLPMSPI0  : 4;            /*!< Weight used for LP mode MSPI0                                             */
      __IOM uint32_t WTLPMSPI1  : 4;            /*!< Weight used for LP mode MSPI1                                             */
      __IOM uint32_t WTLPGFX    : 4;            /*!< Weight used for LP mode GFX                                               */
      __IOM uint32_t WTLPDISP   : 4;            /*!< Weight used for LP mode DISP                                              */
      __IOM uint32_t WTLPCRYPTO : 4;            /*!< Weight used for LP mode CRYPTO                                            */
      __IOM uint32_t WTLPSDIO   : 4;            /*!< Weight used for LP mode SDIO                                              */
      __IOM uint32_t WTLPUSB    : 4;            /*!< Weight used for LP mode USB                                               */
    } PWRWEIGHTLP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP3;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

