AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t WTLPDSPA   : 4;            /*!< Weight used for LP mode DSPA                                              */
      __IOM uint32_t WTLPDBG    : 4;            /*!< Weight used for LP mode DBG                                               */
      __IOM uint32_t WTLPAUDREC : 4;            /*!< Weight used for LP mode AUDREC                                            */
      __IOM uint32_t WTLPAUDPB  : 4;            /*!< Weight used for LP mode AUDPB                                             */
      __IOM uint32_t WTLPAUDADC : 4;            /*!< Weight used for LP mode AUDADC                                            */
            uint32_t            : 8;
      __IOM uint32_t WTLPMSPI2  : 4;            /*!< Weight used for LP mode MSPI2                                             */
    } PWRWEIGHTLP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP4;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPI2S0   : 4;            /*!< Weight used for LP mode I2S0                                              */
      __IOM uint32_t WTLPI2S1   : 4;            /*!< Weight used for LP mode I2S1                                              */
            uint32_t            : 8;
      __IOM uint32_t WTLPPDM0   : 4;            /*!< Weight used for LP mode PDM0                                              */
      __IOM uint32_t WTLPPDM1   : 4;            /*!< Weight used for LP mode PDM1                                              */
      __IOM uint32_t WTLPPDM2   : 4;            /*!< Weight used for LP mode PDM2                                              */
      __IOM uint32_t WTLPPDM3   : 4;            /*!< Weight used for LP mode PDM3                                              */
    } PWRWEIGHTLP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP5;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPDISPPHY : 4;           /*!< Weight used for LP mode DISP PHY                                          */
      __IOM uint32_t WTLPUSBPHY : 4;            /*!< Weight used for LP mode USB PHY                                           */
            uint32_t            : 24;
    } PWRWEIGHTLP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP0;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTHPMCU    : 4;            /*!< Weight used for HP mode MCU                                               */
      __IOM uint32_t WTHPDSP0   : 4;            /*!< Weight used for HP mode DSP0                                              */
      __IOM uint32_t WTHPDSP1   : 4;            /*!< Weight used for HP mode DSP1                                              */
      __IOM uint32_t WTHPIOS    : 4;            /*!< Weight used for HP mode IOS                                               */
      __IOM uint32_t WTHPUART0  : 4;            /*!< Weight used for HP mode UART0                                             */
      __IOM uint32_t WTHPUART1  : 4;            /*!< Weight used for HP mode UART1                                             */
      __IOM uint32_t WTHPUART2  : 4;            /*!< Weight used for HP mode UART2                                             */
      __IOM uint32_t WTHPUART3  : 4;            /*!< Weight used for HP mode UART3                                             */
    } PWRWEIGHTHP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP1;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTHPIOM0   : 4;            /*!< Weight used for HP mode IOM0                                              */
      __IOM uint32_t WTHPIOM1   : 4;            /*!< Weight used for HP mode IOM1                                              */
      __IOM uint32_t WTHPIOM2   : 4;            /*!< Weight used for HP mode IOM2                                              */
      __IOM uint32_t WTHPIOM3   : 4;            /*!< Weight used for HP mode IOM3                                              */
      __IOM uint32_t WTHPIOM4   : 4;            /*!< Weight used for HP mode IOM4                                              */
      __IOM uint32_t WTHPIOM5   : 4;            /*!< Weight used for HP mode IOM5                                              */
      __IOM uint32_t WTHPIOM6   : 4;            /*!< Weight used for HP mode IOM6                                              */
      __IOM uint32_t WTHPIOM7   : 4;            /*!< Weight used for HP mode IOM7                                              */
    } PWRWEIGHTHP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP2;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

