AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t WTHPADC    : 4;            /*!< Weight used for HP mode ADC                                               */
      __IOM uint32_t WTHPMSPI0  : 4;            /*!< Weight used for HP mode MSPI0                                             */
      __IOM uint32_t WTHPMSPI1  : 4;            /*!< Weight used for HP mode MSPI1                                             */
      __IOM uint32_t WTHPGFX    : 4;            /*!< Weight used for HP mode GFX                                               */
      __IOM uint32_t WTHPDISP   : 4;            /*!< Weight used for HP mode DISP                                              */
      __IOM uint32_t WTHPCRYPTO : 4;            /*!< Weight used for HP mode CRYPTO                                            */
      __IOM uint32_t WTHPSDIO   : 4;            /*!< Weight used for HP mode SDIO                                              */
      __IOM uint32_t WTHPUSB    : 4;            /*!< Weight used for HP mode USB                                               */
    } PWRWEIGHTHP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP3;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTHPDSPA   : 4;            /*!< Weight used for HP mode DSPA                                              */
      __IOM uint32_t WTHPDBG    : 4;            /*!< Weight used for HP mode DBG                                               */
      __IOM uint32_t WTHPAUDREC : 4;            /*!< Weight used for HP mode AUDREC                                            */
      __IOM uint32_t WTHPAUDPB  : 4;            /*!< Weight used for HP mode AUDPB                                             */
      __IOM uint32_t WTHPAUDADC : 4;            /*!< Weight used for HP mode AUDADC                                            */
            uint32_t            : 8;
      __IOM uint32_t WTHPMSPI2  : 4;            /*!< Weight used for HP mode MSPI2                                             */
    } PWRWEIGHTHP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP4;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTHPI2S0   : 4;            /*!< Weight used for HP mode I2S0                                              */
      __IOM uint32_t WTHPI2S1   : 4;            /*!< Weight used for HP mode I2S1                                              */
            uint32_t            : 8;
      __IOM uint32_t WTHPPDM0   : 4;            /*!< Weight used for HP mode PDM0                                              */
      __IOM uint32_t WTHPPDM1   : 4;            /*!< Weight used for HP mode PDM1                                              */
      __IOM uint32_t WTHPPDM2   : 4;            /*!< Weight used for HP mode PDM2                                              */
      __IOM uint32_t WTHPPDM3   : 4;            /*!< Weight used for HP mode PDM3                                              */
    } PWRWEIGHTHP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP5;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTHPDISPPHY : 4;           /*!< Weight used for HP mode DISP PHY                                          */
      __IOM uint32_t WTHPUSBPHY : 4;            /*!< Weight used for HP mode USB PHY                                           */
            uint32_t            : 24;
    } PWRWEIGHTHP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTSLP;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTDSMCU    : 4;            /*!< Weight used for Deep Sleep mode MCU                                       */
            uint32_t            : 28;
    } PWRWEIGHTSLP_b;
  } ;

  union {
    __IOM uint32_t VRDEMOTIONTHR;               /*!< Weights specified in PWRWEIGHT* registers are applied to each
                                                     of the masters active requests. The aggregate of all the
                                                     masters is compared against the this threshold value to
                                                     change the buck from active to inactive mode.                             */

    struct {
      __IOM uint32_t VRDEMOTIONTHR : 32;        /*!< VR Demotion Threshold                                                     */
    } VRDEMOTIONTHR_b;
  } ;

  union {
    __IOM uint32_t SRAMCTRL;                    /*!< This register provides additional fine-tune power management
                                                     controls for the SRAMs and the SRAM controller. This includes
                                                     enabling light sleep for the SRAM and TCM banks, and clock
                                                     gating for reduced dynamic power.                                         */

