AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t EMONSEL3   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG3_b;
  } ;

  union {
    __IOM uint32_t EMONCFG4;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL4   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG4_b;
  } ;

  union {
    __IOM uint32_t EMONCFG5;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL5   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG5_b;
  } ;

  union {
    __IOM uint32_t EMONCFG6;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL6   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG6_b;
  } ;

  union {
    __IOM uint32_t EMONCFG7;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL7   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG7_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t EMONCOUNT0;                  /*!< Energy Monitor count value for counter 0                                  */

    struct {
      __IOM uint32_t EMONCOUNT0 : 32;           /*!< Energy Monitor count value counter 0                                      */
    } EMONCOUNT0_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT1;                  /*!< Energy Monitor count value for counter 1                                  */

    struct {
      __IOM uint32_t EMONCOUNT1 : 32;           /*!< Energy Monitor count value counter 1                                      */
    } EMONCOUNT1_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT2;                  /*!< Energy Monitor count value for counter 2                                  */

    struct {
      __IOM uint32_t EMONCOUNT2 : 32;           /*!< Energy Monitor count value counter 2                                      */
    } EMONCOUNT2_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT3;                  /*!< Energy Monitor count value for counter 3                                  */

    struct {
      __IOM uint32_t EMONCOUNT3 : 32;           /*!< Energy Monitor count value counter 3                                      */
    } EMONCOUNT3_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT4;                  /*!< Energy Monitor count value for counter 4                                  */

    struct {
      __IOM uint32_t EMONCOUNT4 : 32;           /*!< Energy Monitor count value counter 4                                      */
    } EMONCOUNT4_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT5;                  /*!< Energy Monitor count value for counter 5                                  */

    struct {
      __IOM uint32_t EMONCOUNT5 : 32;           /*!< Energy Monitor count value counter 5                                      */
    } EMONCOUNT5_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT6;                  /*!< Energy Monitor count value for counter 6                                  */

    struct {
      __IOM uint32_t EMONCOUNT6 : 32;           /*!< Energy Monitor count value counter 6                                      */
    } EMONCOUNT6_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT7;                  /*!< Energy Monitor count value for counter 7                                  */

    struct {
      __IOM uint32_t EMONCOUNT7 : 32;           /*!< Energy Monitor count value counter 7                                      */
    } EMONCOUNT7_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t EMONSTATUS;                  /*!< Energy Monitor status                                                     */

    struct {
      __IOM uint32_t EMONOVERFLOW0 : 1;         /*!< Energy Monitor counter0 overflow                                          */
      __IOM uint32_t EMONOVERFLOW1 : 1;         /*!< Energy Monitor counter1 overflow                                          */
      __IOM uint32_t EMONOVERFLOW2 : 1;         /*!< Energy Monitor counter2 overflow                                          */
      __IOM uint32_t EMONOVERFLOW3 : 1;         /*!< Energy Monitor counter3 overflow                                          */
      __IOM uint32_t EMONOVERFLOW4 : 1;         /*!< Energy Monitor counter4 overflow                                          */
      __IOM uint32_t EMONOVERFLOW5 : 1;         /*!< Energy Monitor counter5 overflow                                          */
      __IOM uint32_t EMONOVERFLOW6 : 1;         /*!< Energy Monitor counter6 overflow                                          */
      __IOM uint32_t EMONOVERFLOW7 : 1;         /*!< Energy Monitor counter7 overflow                                          */
            uint32_t            : 24;
    } EMONSTATUS_b;
  } ;
} PWRCTRL_Type;                                 /*!< Size = 592 (0x250)                                                        */



/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Reset Generator (RSTGEN)
  */

typedef struct {                                /*!< RSTGEN Structure                                                          */

  union {
    __IOM uint32_t CFG;                         /*!< Reset configuration register. This controls the reset enables
                                                     for brownout condition, choice of brownout method and for
                                                     the expiration of the watch dog timer.                                    */

