AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t OUTCFG104  : 6;            /*!< Pad output 104 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG105  : 6;            /*!< Pad output 105 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG106  : 6;            /*!< Pad output 106 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG107  : 6;            /*!< Pad output 107 configuration                                              */
            uint32_t            : 2;
    } OUTCFG26_b;
  } ;

  union {
    __IOM uint32_t OUTCFG27;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG108  : 6;            /*!< Pad output 108 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG109  : 6;            /*!< Pad output 109 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG110  : 6;            /*!< Pad output 110 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG111  : 6;            /*!< Pad output 111 configuration                                              */
            uint32_t            : 2;
    } OUTCFG27_b;
  } ;

  union {
    __IOM uint32_t OUTCFG28;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG112  : 6;            /*!< Pad output 112 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG113  : 6;            /*!< Pad output 113 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG114  : 6;            /*!< Pad output 114 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG115  : 6;            /*!< Pad output 115 configuration                                              */
            uint32_t            : 2;
    } OUTCFG28_b;
  } ;

  union {
    __IOM uint32_t OUTCFG29;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG116  : 6;            /*!< Pad output 116 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG117  : 6;            /*!< Pad output 117 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG118  : 6;            /*!< Pad output 118 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG119  : 6;            /*!< Pad output 119 configuration                                              */
            uint32_t            : 2;
    } OUTCFG29_b;
  } ;

  union {
    __IOM uint32_t OUTCFG30;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG120  : 6;            /*!< Pad output 120 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG121  : 6;            /*!< Pad output 121 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG122  : 6;            /*!< Pad output 122 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG123  : 6;            /*!< Pad output 123 configuration                                              */
            uint32_t            : 2;
    } OUTCFG30_b;
  } ;

  union {
    __IOM uint32_t OUTCFG31;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG124  : 6;            /*!< Pad output 124 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG125  : 6;            /*!< Pad output 125 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG126  : 6;            /*!< Pad output 126 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG127  : 6;            /*!< Pad output 127 configuration                                              */
            uint32_t            : 2;
    } OUTCFG31_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t AUXEN;                       /*!< Pattern Address                                                           */

    struct {
      __IOM uint32_t TMR00EN    : 1;            /*!< Rev B1 TIMER00 auxiliary enable.                                          */
      __IOM uint32_t TMR01EN    : 1;            /*!< Rev B1 TIMER01 auxiliary enable.                                          */
      __IOM uint32_t TMR02EN    : 1;            /*!< Rev B1 TIMER02 auxiliary enable.                                          */
      __IOM uint32_t TMR03EN    : 1;            /*!< Rev B1 TIMER03 auxiliary enable.                                          */
      __IOM uint32_t TMR04EN    : 1;            /*!< Rev B1 TIMER04 auxiliary enable.                                          */
      __IOM uint32_t TMR05EN    : 1;            /*!< Rev B1 TIMER05 auxiliary enable.                                          */
      __IOM uint32_t TMR06EN    : 1;            /*!< Rev B1 TIMER06 auxiliary enable.                                          */
      __IOM uint32_t TMR07EN    : 1;            /*!< Rev B1 TIMER07 auxiliary enable.                                          */
      __IOM uint32_t TMR08EN    : 1;            /*!< Rev B1 TIMER08 auxiliary enable.                                          */
      __IOM uint32_t TMR09EN    : 1;            /*!< Rev B1 TIMER09 auxiliary enable.                                          */
      __IOM uint32_t TMR10EN    : 1;            /*!< Rev B1 TIMER10 auxiliary enable.                                          */
      __IOM uint32_t TMR11EN    : 1;            /*!< Rev B1 TIMER11 auxiliary enable.                                          */
      __IOM uint32_t TMR12EN    : 1;            /*!< Rev B1 TIMER12 auxiliary enable.                                          */
      __IOM uint32_t TMR13EN    : 1;            /*!< Rev B1 TIMER13 auxiliary enable.                                          */
      __IOM uint32_t TMR14EN    : 1;            /*!< Rev B1 TIMER14 auxiliary enable.                                          */
      __IOM uint32_t TMR15EN    : 1;            /*!< Rev B1 TIMER15 auxiliary enable.                                          */
      __IOM uint32_t STMREN     : 1;            /*!< Rev B1 STIMER auxiliary enable.                                           */
            uint32_t            : 15;
    } AUXEN_b;
  } ;
  __IM  uint32_t  RESERVED4[62];

  union {
    __IOM uint32_t CTRL0;                       /*!< This includes the Control bit fields for timer 0.                         */

