AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TMR0EN     : 1;            /*!< Counter/Timer 0 Enable bit.                                               */
      __IOM uint32_t TMR0CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR0POL0   : 1;            /*!< Counter/Timer 0 output 0 polarity.                                        */
      __IOM uint32_t TMR0POL1   : 1;            /*!< Counter/Timer 0 output 1 polarity.                                        */
      __IOM uint32_t TMR0FN     : 4;            /*!< Counter/Timer 0 Function Select.                                          */
      __IOM uint32_t TMR0CLK    : 8;            /*!< Counter/Timer 0 Clock Select.                                             */
      __IOM uint32_t TMR0TMODE  : 2;            /*!< Counter/Timer 0 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR0LMT    : 8;            /*!< Counter/Timer 0 Pattern Limit Count.                                      */
    } CTRL0_b;
  } ;

  union {
    __IOM uint32_t TIMER0;                      /*!< This register holds the running time or event count for timer
                                                     0.                                                                        */

    struct {
      __IOM uint32_t TIMER0     : 32;           /*!< Counter/Timer 0                                                           */
    } TIMER0_b;
  } ;

  union {
    __IOM uint32_t TMR0CMP0;                    /*!< This contains the Compare limits for timer 0. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR0CMP0   : 32;           /*!< Counter/Timer 0 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR0CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR0CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR0CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR0CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE0;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR0TRIGSEL : 8;           /*!< Counter/Timer 0 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE0_b;
  } ;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IOM uint32_t CTRL1;                       /*!< This includes the Control bit fields for timer 1.                         */

    struct {
      __IOM uint32_t TMR1EN     : 1;            /*!< Counter/Timer 1 Enable bit.                                               */
      __IOM uint32_t TMR1CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR1POL0   : 1;            /*!< Counter/Timer 1 output 0 polarity.                                        */
      __IOM uint32_t TMR1POL1   : 1;            /*!< Counter/Timer 1 output 1 polarity.                                        */
      __IOM uint32_t TMR1FN     : 4;            /*!< Counter/Timer 1 Function Select.                                          */
      __IOM uint32_t TMR1CLK    : 8;            /*!< Counter/Timer 1 Clock Select.                                             */
      __IOM uint32_t TMR1TMODE  : 2;            /*!< Counter/Timer 1 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR1LMT    : 8;            /*!< Counter/Timer 1 Pattern Limit Count.                                      */
    } CTRL1_b;
  } ;

  union {
    __IOM uint32_t TIMER1;                      /*!< This register holds the running time or event count for timer
                                                     1.                                                                        */

    struct {
      __IOM uint32_t TIMER1     : 32;           /*!< Counter/Timer 1                                                           */
    } TIMER1_b;
  } ;

  union {
    __IOM uint32_t TMR1CMP0;                    /*!< This contains the Compare limits for timer 1. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR1CMP0   : 32;           /*!< Counter/Timer 1 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR1CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR1CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

