AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TMR1CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR1CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE1;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR1TRIGSEL : 8;           /*!< Counter/Timer 1 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE1_b;
  } ;
  __IM  uint32_t  RESERVED6[3];

  union {
    __IOM uint32_t CTRL2;                       /*!< This includes the Control bit fields for timer 2.                         */

    struct {
      __IOM uint32_t TMR2EN     : 1;            /*!< Counter/Timer 2 Enable bit.                                               */
      __IOM uint32_t TMR2CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR2POL0   : 1;            /*!< Counter/Timer 2 output 0 polarity.                                        */
      __IOM uint32_t TMR2POL1   : 1;            /*!< Counter/Timer 2 output 1 polarity.                                        */
      __IOM uint32_t TMR2FN     : 4;            /*!< Counter/Timer 2 Function Select.                                          */
      __IOM uint32_t TMR2CLK    : 8;            /*!< Counter/Timer 2 Clock Select.                                             */
      __IOM uint32_t TMR2TMODE  : 2;            /*!< Counter/Timer 2 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR2LMT    : 8;            /*!< Counter/Timer 2 Pattern Limit Count.                                      */
    } CTRL2_b;
  } ;

  union {
    __IOM uint32_t TIMER2;                      /*!< This register holds the running time or event count for timer
                                                     2.                                                                        */

    struct {
      __IOM uint32_t TIMER2     : 32;           /*!< Counter/Timer 2                                                           */
    } TIMER2_b;
  } ;

  union {
    __IOM uint32_t TMR2CMP0;                    /*!< This contains the Compare limits for timer 2. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR2CMP0   : 32;           /*!< Counter/Timer 2 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR2CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR2CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR2CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR2CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE2;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR2TRIGSEL : 8;           /*!< Counter/Timer 2 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE2_b;
  } ;
  __IM  uint32_t  RESERVED7[3];

  union {
    __IOM uint32_t CTRL3;                       /*!< This includes the Control bit fields for timer 3.                         */

    struct {
      __IOM uint32_t TMR3EN     : 1;            /*!< Counter/Timer 3 Enable bit.                                               */
      __IOM uint32_t TMR3CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR3POL0   : 1;            /*!< Counter/Timer 3 output 0 polarity.                                        */
      __IOM uint32_t TMR3POL1   : 1;            /*!< Counter/Timer 3 output 1 polarity.                                        */
      __IOM uint32_t TMR3FN     : 4;            /*!< Counter/Timer 3 Function Select.                                          */
      __IOM uint32_t TMR3CLK    : 8;            /*!< Counter/Timer 3 Clock Select.                                             */
      __IOM uint32_t TMR3TMODE  : 2;            /*!< Counter/Timer 3 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR3LMT    : 8;            /*!< Counter/Timer 3 Pattern Limit Count.                                      */
    } CTRL3_b;
  } ;

  union {
    __IOM uint32_t TIMER3;                      /*!< This register holds the running time or event count for timer
                                                     3.                                                                        */

    struct {
      __IOM uint32_t TIMER3     : 32;           /*!< Counter/Timer 3                                                           */
    } TIMER3_b;
  } ;

  union {
    __IOM uint32_t TMR3CMP0;                    /*!< This contains the Compare limits for timer 3. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

