AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TMR3CMP0   : 32;           /*!< Counter/Timer 3 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR3CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR3CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR3CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR3CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE3;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR3TRIGSEL : 8;           /*!< Counter/Timer 3 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE3_b;
  } ;
  __IM  uint32_t  RESERVED8[3];

  union {
    __IOM uint32_t CTRL4;                       /*!< This includes the Control bit fields for timer 4.                         */

    struct {
      __IOM uint32_t TMR4EN     : 1;            /*!< Counter/Timer 4 Enable bit.                                               */
      __IOM uint32_t TMR4CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR4POL0   : 1;            /*!< Counter/Timer 4 output 0 polarity.                                        */
      __IOM uint32_t TMR4POL1   : 1;            /*!< Counter/Timer 4 output 1 polarity.                                        */
      __IOM uint32_t TMR4FN     : 4;            /*!< Counter/Timer 4 Function Select.                                          */
      __IOM uint32_t TMR4CLK    : 8;            /*!< Counter/Timer 4 Clock Select.                                             */
      __IOM uint32_t TMR4TMODE  : 2;            /*!< Counter/Timer 4 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR4LMT    : 8;            /*!< Counter/Timer 4 Pattern Limit Count.                                      */
    } CTRL4_b;
  } ;

  union {
    __IOM uint32_t TIMER4;                      /*!< This register holds the running time or event count for timer
                                                     4.                                                                        */

    struct {
      __IOM uint32_t TIMER4     : 32;           /*!< Counter/Timer 4                                                           */
    } TIMER4_b;
  } ;

  union {
    __IOM uint32_t TMR4CMP0;                    /*!< This contains the Compare limits for timer 4. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR4CMP0   : 32;           /*!< Counter/Timer 4 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR4CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR4CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR4CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR4CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE4;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR4TRIGSEL : 8;           /*!< Counter/Timer 4 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE4_b;
  } ;
  __IM  uint32_t  RESERVED9[3];

  union {
    __IOM uint32_t CTRL5;                       /*!< This includes the Control bit fields for timer 5.                         */

    struct {
      __IOM uint32_t TMR5EN     : 1;            /*!< Counter/Timer 5 Enable bit.                                               */
      __IOM uint32_t TMR5CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR5POL0   : 1;            /*!< Counter/Timer 5 output 0 polarity.                                        */
      __IOM uint32_t TMR5POL1   : 1;            /*!< Counter/Timer 5 output 1 polarity.                                        */
      __IOM uint32_t TMR5FN     : 4;            /*!< Counter/Timer 5 Function Select.                                          */
      __IOM uint32_t TMR5CLK    : 8;            /*!< Counter/Timer 5 Clock Select.                                             */
      __IOM uint32_t TMR5TMODE  : 2;            /*!< Counter/Timer 5 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR5LMT    : 8;            /*!< Counter/Timer 5 Pattern Limit Count.                                      */
    } CTRL5_b;
  } ;

  union {
    __IOM uint32_t TIMER5;                      /*!< This register holds the running time or event count for timer
                                                     5.                                                                        */

