AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TIMER5     : 32;           /*!< Counter/Timer 5                                                           */
    } TIMER5_b;
  } ;

  union {
    __IOM uint32_t TMR5CMP0;                    /*!< This contains the Compare limits for timer 5. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR5CMP0   : 32;           /*!< Counter/Timer 5 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR5CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR5CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR5CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR5CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE5;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR5TRIGSEL : 8;           /*!< Counter/Timer 5 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE5_b;
  } ;
  __IM  uint32_t  RESERVED10[3];

  union {
    __IOM uint32_t CTRL6;                       /*!< This includes the Control bit fields for timer 6.                         */

    struct {
      __IOM uint32_t TMR6EN     : 1;            /*!< Counter/Timer 6 Enable bit.                                               */
      __IOM uint32_t TMR6CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR6POL0   : 1;            /*!< Counter/Timer 6 output 0 polarity.                                        */
      __IOM uint32_t TMR6POL1   : 1;            /*!< Counter/Timer 6 output 1 polarity.                                        */
      __IOM uint32_t TMR6FN     : 4;            /*!< Counter/Timer 6 Function Select.                                          */
      __IOM uint32_t TMR6CLK    : 8;            /*!< Counter/Timer 6 Clock Select.                                             */
      __IOM uint32_t TMR6TMODE  : 2;            /*!< Counter/Timer 6 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR6LMT    : 8;            /*!< Counter/Timer 6 Pattern Limit Count.                                      */
    } CTRL6_b;
  } ;

  union {
    __IOM uint32_t TIMER6;                      /*!< This register holds the running time or event count for timer
                                                     6.                                                                        */

    struct {
      __IOM uint32_t TIMER6     : 32;           /*!< Counter/Timer 6                                                           */
    } TIMER6_b;
  } ;

  union {
    __IOM uint32_t TMR6CMP0;                    /*!< This contains the Compare limits for timer 6. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR6CMP0   : 32;           /*!< Counter/Timer 6 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR6CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR6CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR6CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR6CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE6;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR6TRIGSEL : 8;           /*!< Counter/Timer 6 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE6_b;
  } ;
  __IM  uint32_t  RESERVED11[3];

  union {
    __IOM uint32_t CTRL7;                       /*!< This includes the Control bit fields for timer 7.                         */

    struct {
      __IOM uint32_t TMR7EN     : 1;            /*!< Counter/Timer 7 Enable bit.                                               */
      __IOM uint32_t TMR7CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR7POL0   : 1;            /*!< Counter/Timer 7 output 0 polarity.                                        */
      __IOM uint32_t TMR7POL1   : 1;            /*!< Counter/Timer 7 output 1 polarity.                                        */
      __IOM uint32_t TMR7FN     : 4;            /*!< Counter/Timer 7 Function Select.                                          */
      __IOM uint32_t TMR7CLK    : 8;            /*!< Counter/Timer 7 Clock Select.                                             */
      __IOM uint32_t TMR7TMODE  : 2;            /*!< Counter/Timer 7 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR7LMT    : 8;            /*!< Counter/Timer 7 Pattern Limit Count.                                      */
    } CTRL7_b;
  } ;

  union {
    __IOM uint32_t TIMER7;                      /*!< This register holds the running time or event count for timer
                                                     7.                                                                        */

