AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TIMER7     : 32;           /*!< Counter/Timer 7                                                           */
    } TIMER7_b;
  } ;

  union {
    __IOM uint32_t TMR7CMP0;                    /*!< This contains the Compare limits for timer 7. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR7CMP0   : 32;           /*!< Counter/Timer 7 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR7CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR7CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR7CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR7CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE7;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR7TRIGSEL : 8;           /*!< Counter/Timer 7 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE7_b;
  } ;
  __IM  uint32_t  RESERVED12[3];

  union {
    __IOM uint32_t CTRL8;                       /*!< This includes the Control bit fields for timer 8.                         */

    struct {
      __IOM uint32_t TMR8EN     : 1;            /*!< Counter/Timer 8 Enable bit.                                               */
      __IOM uint32_t TMR8CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR8POL0   : 1;            /*!< Counter/Timer 8 output 0 polarity.                                        */
      __IOM uint32_t TMR8POL1   : 1;            /*!< Counter/Timer 8 output 1 polarity.                                        */
      __IOM uint32_t TMR8FN     : 4;            /*!< Counter/Timer 8 Function Select.                                          */
      __IOM uint32_t TMR8CLK    : 8;            /*!< Counter/Timer 8 Clock Select.                                             */
      __IOM uint32_t TMR8TMODE  : 2;            /*!< Counter/Timer 8 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR8LMT    : 8;            /*!< Counter/Timer 8 Pattern Limit Count.                                      */
    } CTRL8_b;
  } ;

  union {
    __IOM uint32_t TIMER8;                      /*!< This register holds the running time or event count for timer
                                                     8.                                                                        */

    struct {
      __IOM uint32_t TIMER8     : 32;           /*!< Counter/Timer 8                                                           */
    } TIMER8_b;
  } ;

  union {
    __IOM uint32_t TMR8CMP0;                    /*!< This contains the Compare limits for timer 8. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR8CMP0   : 32;           /*!< Counter/Timer 8 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR8CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR8CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR8CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR8CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE8;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR8TRIGSEL : 8;           /*!< Counter/Timer 8 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE8_b;
  } ;
  __IM  uint32_t  RESERVED13[3];

  union {
    __IOM uint32_t CTRL9;                       /*!< This includes the Control bit fields for timer 9.                         */

    struct {
      __IOM uint32_t TMR9EN     : 1;            /*!< Counter/Timer 9 Enable bit.                                               */
      __IOM uint32_t TMR9CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR9POL0   : 1;            /*!< Counter/Timer 9 output 0 polarity.                                        */
      __IOM uint32_t TMR9POL1   : 1;            /*!< Counter/Timer 9 output 1 polarity.                                        */
      __IOM uint32_t TMR9FN     : 4;            /*!< Counter/Timer 9 Function Select.                                          */
      __IOM uint32_t TMR9CLK    : 8;            /*!< Counter/Timer 9 Clock Select.                                             */
      __IOM uint32_t TMR9TMODE  : 2;            /*!< Counter/Timer 9 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR9LMT    : 8;            /*!< Counter/Timer 9 Pattern Limit Count.                                      */
    } CTRL9_b;
  } ;

  union {
    __IOM uint32_t TIMER9;                      /*!< This register holds the running time or event count for timer
                                                     9.                                                                        */

