AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TIMER9     : 32;           /*!< Counter/Timer 9                                                           */
    } TIMER9_b;
  } ;

  union {
    __IOM uint32_t TMR9CMP0;                    /*!< This contains the Compare limits for timer 9. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR9CMP0   : 32;           /*!< Counter/Timer 9 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR9CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR9CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR9CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR9CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE9;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR9TRIGSEL : 8;           /*!< Counter/Timer 9 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE9_b;
  } ;
  __IM  uint32_t  RESERVED14[3];

  union {
    __IOM uint32_t CTRL10;                      /*!< This includes the Control bit fields for timer 10.                        */

    struct {
      __IOM uint32_t TMR10EN    : 1;            /*!< Counter/Timer 10 Enable bit.                                              */
      __IOM uint32_t TMR10CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR10POL0  : 1;            /*!< Counter/Timer 10 output 0 polarity.                                       */
      __IOM uint32_t TMR10POL1  : 1;            /*!< Counter/Timer 10 output 1 polarity.                                       */
      __IOM uint32_t TMR10FN    : 4;            /*!< Counter/Timer 10 Function Select.                                         */
      __IOM uint32_t TMR10CLK   : 8;            /*!< Counter/Timer 10 Clock Select.                                            */
      __IOM uint32_t TMR10TMODE : 2;            /*!< Counter/Timer 10 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR10LMT   : 8;            /*!< Counter/Timer 10 Pattern Limit Count.                                     */
    } CTRL10_b;
  } ;

  union {
    __IOM uint32_t TIMER10;                     /*!< This register holds the running time or event count for timer
                                                     10.                                                                       */

    struct {
      __IOM uint32_t TIMER10    : 32;           /*!< Counter/Timer 10                                                          */
    } TIMER10_b;
  } ;

  union {
    __IOM uint32_t TMR10CMP0;                   /*!< This contains the Compare limits for timer 10. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR10CMP0  : 32;           /*!< Counter/Timer 10 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR10CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR10CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR10CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR10CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE10;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR10TRIGSEL : 8;          /*!< Counter/Timer 10 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE10_b;
  } ;
  __IM  uint32_t  RESERVED15[3];

  union {
    __IOM uint32_t CTRL11;                      /*!< This includes the Control bit fields for timer 11.                        */

    struct {
      __IOM uint32_t TMR11EN    : 1;            /*!< Counter/Timer 11 Enable bit.                                              */
      __IOM uint32_t TMR11CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR11POL0  : 1;            /*!< Counter/Timer 11 output 0 polarity.                                       */
      __IOM uint32_t TMR11POL1  : 1;            /*!< Counter/Timer 11 output 1 polarity.                                       */
      __IOM uint32_t TMR11FN    : 4;            /*!< Counter/Timer 11 Function Select.                                         */
      __IOM uint32_t TMR11CLK   : 8;            /*!< Counter/Timer 11 Clock Select.                                            */
      __IOM uint32_t TMR11TMODE : 2;            /*!< Counter/Timer 11 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR11LMT   : 8;            /*!< Counter/Timer 11 Pattern Limit Count.                                     */
    } CTRL11_b;
  } ;

  union {
    __IOM uint32_t TIMER11;                     /*!< This register holds the running time or event count for timer
                                                     11.                                                                       */

