AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TIMER11    : 32;           /*!< Counter/Timer 11                                                          */
    } TIMER11_b;
  } ;

  union {
    __IOM uint32_t TMR11CMP0;                   /*!< This contains the Compare limits for timer 11. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR11CMP0  : 32;           /*!< Counter/Timer 11 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR11CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR11CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR11CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR11CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE11;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR11TRIGSEL : 8;          /*!< Counter/Timer 11 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE11_b;
  } ;
  __IM  uint32_t  RESERVED16[3];

  union {
    __IOM uint32_t CTRL12;                      /*!< This includes the Control bit fields for timer 12.                        */

    struct {
      __IOM uint32_t TMR12EN    : 1;            /*!< Counter/Timer 12 Enable bit.                                              */
      __IOM uint32_t TMR12CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR12POL0  : 1;            /*!< Counter/Timer 12 output 0 polarity.                                       */
      __IOM uint32_t TMR12POL1  : 1;            /*!< Counter/Timer 12 output 1 polarity.                                       */
      __IOM uint32_t TMR12FN    : 4;            /*!< Counter/Timer 12 Function Select.                                         */
      __IOM uint32_t TMR12CLK   : 8;            /*!< Counter/Timer 12 Clock Select.                                            */
      __IOM uint32_t TMR12TMODE : 2;            /*!< Counter/Timer 12 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR12LMT   : 8;            /*!< Counter/Timer 12 Pattern Limit Count.                                     */
    } CTRL12_b;
  } ;

  union {
    __IOM uint32_t TIMER12;                     /*!< This register holds the running time or event count for timer
                                                     12.                                                                       */

    struct {
      __IOM uint32_t TIMER12    : 32;           /*!< Counter/Timer 12                                                          */
    } TIMER12_b;
  } ;

  union {
    __IOM uint32_t TMR12CMP0;                   /*!< This contains the Compare limits for timer 12. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR12CMP0  : 32;           /*!< Counter/Timer 12 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR12CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR12CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR12CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR12CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE12;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR12TRIGSEL : 8;          /*!< Counter/Timer 12 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE12_b;
  } ;
  __IM  uint32_t  RESERVED17[3];

  union {
    __IOM uint32_t CTRL13;                      /*!< This includes the Control bit fields for timer 13.                        */

    struct {
      __IOM uint32_t TMR13EN    : 1;            /*!< Counter/Timer 13 Enable bit.                                              */
      __IOM uint32_t TMR13CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR13POL0  : 1;            /*!< Counter/Timer 13 output 0 polarity.                                       */
      __IOM uint32_t TMR13POL1  : 1;            /*!< Counter/Timer 13 output 1 polarity.                                       */
      __IOM uint32_t TMR13FN    : 4;            /*!< Counter/Timer 13 Function Select.                                         */
      __IOM uint32_t TMR13CLK   : 8;            /*!< Counter/Timer 13 Clock Select.                                            */
      __IOM uint32_t TMR13TMODE : 2;            /*!< Counter/Timer 13 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR13LMT   : 8;            /*!< Counter/Timer 13 Pattern Limit Count.                                     */
    } CTRL13_b;
  } ;

  union {
    __IOM uint32_t TIMER13;                     /*!< This register holds the running time or event count for timer
                                                     13.                                                                       */

