AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TIMER13    : 32;           /*!< Counter/Timer 13                                                          */
    } TIMER13_b;
  } ;

  union {
    __IOM uint32_t TMR13CMP0;                   /*!< This contains the Compare limits for timer 13. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR13CMP0  : 32;           /*!< Counter/Timer 13 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR13CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR13CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR13CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR13CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE13;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR13TRIGSEL : 8;          /*!< Counter/Timer 13 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE13_b;
  } ;
  __IM  uint32_t  RESERVED18[3];

  union {
    __IOM uint32_t CTRL14;                      /*!< This includes the Control bit fields for timer 14.                        */

    struct {
      __IOM uint32_t TMR14EN    : 1;            /*!< Counter/Timer 14 Enable bit.                                              */
      __IOM uint32_t TMR14CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR14POL0  : 1;            /*!< Counter/Timer 14 output 0 polarity.                                       */
      __IOM uint32_t TMR14POL1  : 1;            /*!< Counter/Timer 14 output 1 polarity.                                       */
      __IOM uint32_t TMR14FN    : 4;            /*!< Counter/Timer 14 Function Select.                                         */
      __IOM uint32_t TMR14CLK   : 8;            /*!< Counter/Timer 14 Clock Select.                                            */
      __IOM uint32_t TMR14TMODE : 2;            /*!< Counter/Timer 14 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR14LMT   : 8;            /*!< Counter/Timer 14 Pattern Limit Count.                                     */
    } CTRL14_b;
  } ;

  union {
    __IOM uint32_t TIMER14;                     /*!< This register holds the running time or event count for timer
                                                     14.                                                                       */

    struct {
      __IOM uint32_t TIMER14    : 32;           /*!< Counter/Timer 14                                                          */
    } TIMER14_b;
  } ;

  union {
    __IOM uint32_t TMR14CMP0;                   /*!< This contains the Compare limits for timer 14. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR14CMP0  : 32;           /*!< Counter/Timer 14 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR14CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR14CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR14CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR14CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE14;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR14TRIGSEL : 8;          /*!< Counter/Timer 14 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE14_b;
  } ;
  __IM  uint32_t  RESERVED19[3];

  union {
    __IOM uint32_t CTRL15;                      /*!< This includes the Control bit fields for timer 15.                        */

    struct {
      __IOM uint32_t TMR15EN    : 1;            /*!< Counter/Timer 15 Enable bit.                                              */
      __IOM uint32_t TMR15CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR15POL0  : 1;            /*!< Counter/Timer 15 output 0 polarity.                                       */
      __IOM uint32_t TMR15POL1  : 1;            /*!< Counter/Timer 15 output 1 polarity.                                       */
      __IOM uint32_t TMR15FN    : 4;            /*!< Counter/Timer 15 Function Select.                                         */
      __IOM uint32_t TMR15CLK   : 8;            /*!< Counter/Timer 15 Clock Select.                                            */
      __IOM uint32_t TMR15TMODE : 2;            /*!< Counter/Timer 15 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR15LMT   : 8;            /*!< Counter/Timer 15 Pattern Limit Count.                                     */
    } CTRL15_b;
  } ;

  union {
    __IOM uint32_t TIMER15;                     /*!< This register holds the running time or event count for timer
                                                     15.                                                                       */

