AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TIMER15    : 32;           /*!< Counter/Timer 15                                                          */
    } TIMER15_b;
  } ;

  union {
    __IOM uint32_t TMR15CMP0;                   /*!< This contains the Compare limits for timer 15. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR15CMP0  : 32;           /*!< Counter/Timer 15 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR15CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR15CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR15CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR15CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE15;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR15TRIGSEL : 8;          /*!< Counter/Timer 15 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE15_b;
  } ;
} TIMER_Type;                                   /*!< Size = 1012 (0x3f4)                                                       */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial UART (UART0)
  */

typedef struct {                                /*!< UART0 Structure                                                           */

  union {
    __IOM uint32_t DR;                          /*!< UART Data                                                                 */

    struct {
      __IOM uint32_t DATA       : 8;            /*!< Receive (read) data character. Transmit (write) data character.           */
      __IOM uint32_t FEDATA     : 1;            /*!< Framing error. When set to 1, it indicates that the received
                                                     character did not have a valid stop bit (a valid stop bit
                                                     is 1). In FIFO mode, this error is associated with the
                                                     character at the top of the FIFO.                                         */
      __IOM uint32_t PEDATA     : 1;            /*!< Parity error. When set to 1, it indicates that the parity of
                                                     the received data character does not match the parity that
                                                     the EPS and SPS bits in the Line Control Register, UARTLCRH
                                                     select. In FIFO mode, this error is associated with the
                                                     character at the top of the FIFO.                                         */
      __IOM uint32_t BEDATA     : 1;            /*!< Break error. This bit is set to 1 if a break condition was detected,
                                                     indicating that the received data input was held LOW for
                                                     longer than a full-word transmission time (defined as start,
                                                     data, parity and stop bits). In FIFO mode, this error is
                                                     associated with the character at the top of the FIFO. When
                                                     a break occurs, only one 0 character is loaded into the
                                                     FIFO. The next character is only enabled after the receive
                                                     data input goes to a 1 (marking state), and the next valid
                                                     start bit is received.                                                    */
      __IOM uint32_t OEDATA     : 1;            /*!< Overrun error. This bit is set to 1 if data is received and
                                                     the receive FIFO is already full. This is cleared to 0
                                                     once there is an empty space in the FIFO and a new character
                                                     can be written to it.                                                     */
            uint32_t            : 20;
    } DR_b;
  } ;

  union {
    __IOM uint32_t RSR;                         /*!< UART Status                                                               */

    struct {
      __IOM uint32_t FESTAT     : 1;            /*!< Framing error. When set to 1, it indicates that the received
                                                     character did not have a valid stop bit (a valid stop bit
                                                     is 1). This bit is cleared to 0 by a write to UARTECR.
                                                     In FIFO mode, this error is associated with the character
                                                     at the top of the FIFO.                                                   */
      __IOM uint32_t PESTAT     : 1;            /*!< Parity error. When set to 1, it indicates that the parity of
                                                     the received data character does not match the parity that
                                                     the EPS and SPS bits in the Line Control Register, UARTLCRH
                                                     select. This bit is cleared to 0 by a write to UARTECR.
                                                     In FIFO mode, this error is associated with the character
                                                     at the top of the FIFO.                                                   */
      __IOM uint32_t BESTAT     : 1;            /*!< Break error. This bit is set to 1 if a break condition was detected,
                                                     indicating that the received data input was held LOW for
                                                     longer than a full-word transmission time (defined as start,
                                                     data, parity, and stop bits). This bit is cleared to 0
                                                     after a write to UARTECR. In FIFO mode, this error is associated
                                                     with the character at the top of the FIFO. When a break
                                                     occurs, only one 0 character is loaded into the FIFO. The
                                                     next character is only enabled after the receive data input
                                                     goes to a 1 (marking state) and the next valid start bit
                                                     is received.                                                              */
      __IOM uint32_t OESTAT     : 1;            /*!< Overrun error. This bit is set to 1 if data is received and
                                                     the FIFO is already full. This bit is cleared to 0 by a
                                                     write to UARTECR. The FIFO contents remain valid because
                                                     no more data is written when the FIFO is full, only the
                                                     contents of the shift register are overwritten. The CPU
                                                     must now read the data, to empty the FIFO.                                */
            uint32_t            : 28;
    } RSR_b;
  } ;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t FR;                          /*!< Flags                                                                     */

