AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t TXCMPMIC   : 1;            /*!< This bit holds the modem TXCMP interrupt clear.                           */
      __IOM uint32_t CTSMIC     : 1;            /*!< This bit holds the nUARTCTS modem interrupt clear. Clears the
                                                     UARTCTSINTR interrupt.                                                    */
      __IOM uint32_t DCDMIC     : 1;            /*!< This bit holds the nUARTDCD modem interrupt clear. Clears the
                                                     UARTDCDINTR interrupt.                                                    */
      __IOM uint32_t DSRMIC     : 1;            /*!< This bit holds the nUARTDSR modem interrupt clear. Clears the
                                                     UARTDSRINTR interrupt.                                                    */
      __IOM uint32_t RXIC       : 1;            /*!< This bit holds the receive interrupt clear. Clears the UARTRXINTR
                                                     interrupt.                                                                */
      __IOM uint32_t TXIC       : 1;            /*!< This bit holds the transmit interrupt clear. Clears the UARTTXINTR
                                                     interrupt.                                                                */
      __IOM uint32_t RTIC       : 1;            /*!< This bit holds the receive timeout interrupt clear. Clears the
                                                     UARTRTINTR interrupt.                                                     */
      __IOM uint32_t FEIC       : 1;            /*!< This bit holds the framing error interrupt clear. Clears the
                                                     UARTFEINTR interrupt.                                                     */
      __IOM uint32_t PEIC       : 1;            /*!< This bit holds the parity error interrupt clear. Clears the
                                                     UARTPEINTR interrupt.                                                     */
      __IOM uint32_t BEIC       : 1;            /*!< This bit holds the break error interrupt clear. Clears the UARTBEINTR
                                                     interrupt.                                                                */
      __IOM uint32_t OEIC       : 1;            /*!< This bit holds the overrun interrupt clear. Clears the UARTOEINTR
                                                     interrupt.                                                                */
            uint32_t            : 21;
    } IEC_b;
  } ;
} UART0_Type;                                   /*!< Size = 72 (0x48)                                                          */



/* =========================================================================================================================== */
/* ================                                          USBPHY                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief USBPHY device register descriptions. (USBPHY)
  */

typedef struct {                                /*!< USBPHY Structure                                                          */

  union {
    __IOM uint32_t REG00;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF43       : 2;            /*!< BG observation enable signal. Active low. When enabled, vref
                                                     400mV can be observed through USB0PP/USB0PN                               */
      __IOM uint32_t BF75       : 3;            /*!< Manually set the Rx Clock phase select. These bits will tune
                                                     the HS RX path sample timing between digital and analog
                                                     inside PHY: 3'b000 represents the earliest phase 3'b111
                                                     represents the latest phase The delay associated with each
                                                     step is 256ps                                                             */
            uint32_t            : 24;
    } REG00_b;
  } ;

  union {
    __IOM uint32_t REG04;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< Manually set the Tx Clock phase select. These bits will tune
                                                     the HS TX path sample timing between digital and analog
                                                     inside PHY 3'b000 represents the earliest phase 3'b111
                                                     represents the latest phase The delay associated with each
                                                     step is 256ps                                                             */
      __IOM uint32_t BF43       : 2;            /*!< Squelch detector bias current tuning, 2'b00 represents the minimum
                                                     bias current 2'b11 represents the maximum bias current                    */
      __IOM uint32_t BF55       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF76       : 2;            /*!< disconnect detector bias current tuning                                   */
            uint32_t            : 24;
    } REG04_b;
  } ;

  union {
    __IOM uint32_t REG08;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF30       : 4;            /*!< 2'b00 represents the minimum bias current 2'b11 represents the
                                                     maximum bias current Rx squelch trigger point configures.
                                                     Allows tuning of the squelch trigger point in order to
                                                     compensate for package and board level parasitic. 4'b0000:112.5mV
                                                     4'b0001:150mV 4'b0010:87.5mV 4'b0011:162.5mV 4'b0100:100mV
                                                     4'b0101:137.5mV 4'b0110:75mV 4'b0111:150mV 4'b1000:125mV
                                                     4'b1001:162.5mV 4'b1010:100mV 4'b1011:175mV 4'b1100:150mV(default)
                                                     4'b1101:187.5mV 4'b1110:125mV 4'b1111:200mV                               */
      __IOM uint32_t BF64       : 3;            /*!< HS eye height tuning 3'b000:400mV(default) 3'b001:475mV 3'b010:350mV
                                                     3'b011:500mV 3'b100:412.5mV 3'b101:425mV 3'b110:437.5mV
                                                     3'b111:450mV                                                              */
      __IOM uint32_t BF77       : 1;            /*!< digital squelch filter select, this bit is used to filter the
                                                     glitch on the HS RX squelch signal. 1: 1 clock cycle filter
                                                     0: 2 clock cycle fitter                                                   */
            uint32_t            : 24;
    } REG08_b;
  } ;

  union {
    __IOM uint32_t REG0C;                       /*!< Register description here                                                 */

