AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t BF10       : 2;            /*!< BG output voltage reference adjust, normally these bits are
                                                     recommended to be kept as the default values. 00: standard
                                                     center level around 1.25v output, recommended 01: relative
                                                     higher output 1x: relative higher output                                  */
      __IOM uint32_t BF62       : 5;            /*!< 45ohm HS ODT value tuning and FS/LS driver strength tuning 5'b11111:
                                                     smallest HS ODT value and largest FS/LS driver strength
                                                     and fastest FS/LS slew rate 5'b10000: biggest HS ODT value
                                                     and smallest FS/LS driver strength and slowest FS/LS slew
                                                     rate                                                                      */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG0C_b;
  } ;

  union {
    __IOM uint32_t REG10;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Bypass squelch trigger point configure in chirp modes , active
                                                     high, keep the default value is strongly recommended .
                                                     1: Bypass squelch trigger point configure in chirp modes
                                                     , 0: squelch trigger point set to 250mV in chirp modes.                   */
      __IOM uint32_t BF11       : 1;            /*!< Turn off LS/FS differential receiver in suspend mode, active
                                                     low 1: keep the LS/FS differential receiver , pin fss_rxrcv
                                                     will toggling according to the DP/DM state 0: turn off
                                                     the LS/FS differential receiver, pin fss_rxrcv will not
                                                     toggling according to the DP/DM state                                     */
      __IOM uint32_t BF22       : 1;            /*!< Half bit pre-emphasis enable. Active high 1: half bit pre-emphasize
                                                     mode, recommended 0: full bit pre-emphasize mode                          */
      __IOM uint32_t BF33       : 1;            /*!< Single ended disconnect detection enable, active high. 1: enable
                                                     Single ended disconnect detection 0: disenable Single ended
                                                     disconnect detection                                                      */
      __IOM uint32_t BF74       : 4;            /*!< HOST disconnect detection trigger point. Only valid in host
                                                     mode. Allows compensation for package and board level parasitics
                                                     which tend to drop in the input voltage. 4'b0000:625mV
                                                     4'b0001:675mV 4'b0010:612.5mV 4'b0011:575mV 4'b0100:550mV
                                                     4'b0101:600mV (default) 4'b0110:537.5mV 4'b0111:500mV 4'b1000:600mV
                                                     4'b1001:650mV 4'b1010:587.5mV 4'b1011:550mV 4'b1100:575mV
                                                     4'b1101:625mV 4'b1110:562.5mV 4'b1111:525mV                               */
            uint32_t            : 24;
    } REG10_b;
  } ;

  union {
    __IOM uint32_t REG14;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Dflop output select signal delay compared with digital clock
                                                     enable signal 1'b0:3 clocks 1'b1:2 clocks                                 */
      __IOM uint32_t BF11       : 1;            /*!< PLL bandwidth option 1'b0 default 1'b1 increases the PLL bandwidth        */
      __IOM uint32_t BF42       : 3;            /*!< Tx HS pre-emphasis strength 3'b111 represents the strongest
                                                     , 3'b000 the weakest                                                      */
      __IOM uint32_t BF55       : 1;            /*!< PLL feedback divider ratio option.                                        */
      __IOM uint32_t BF66       : 1;            /*!< BF66 field description needed.                                            */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG14_b;
  } ;

  union {
    __IOM uint32_t REG18;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< HS receiver bias current tuning. 2'b00 represents the minimum
                                                     bias current 2'b11 represents the maximum bias current                    */
      __IOM uint32_t BF22       : 1;            /*!< Clk60m, clk12m and clk48m enable. 1'b0:disables the clocks 1'b1:enables
                                                     the clocks                                                                */
      __IOM uint32_t BF73       : 5;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG18_b;
  } ;

  union {
    __IOM uint32_t REG1C;                       /*!< Register description here                                                 */

