AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP0RSTART : 8;            /*!< Writing 0x69 to DSP0RSTRT restarts the watchdog timer. This
                                                     is a write only register. Reading this register will return
                                                     0.                                                                        */
            uint32_t            : 24;
    } DSP0RSTRT_b;
  } ;

  union {
    __IOM uint32_t DSP0TLOCK;                   /*!< This register locks the watch dog timer. Once it is locked,
                                                     the configuration register (DSP0CFG) for watch dog timer
                                                     cannot be written to and the timer is automatically enabled
                                                     (WDTEN is set).                                                           */

    struct {
      __IOM uint32_t DSP0LOCK   : 8;            /*!< Writing 0xa7 locks the watchdog timer. Once locked, the WDTCFG
                                                     reg cannot be written and WDTEN is set.                                   */
            uint32_t            : 24;
    } DSP0TLOCK_b;
  } ;

  union {
    __IOM uint32_t DSP0COUNT;                   /*!< This register holds the current count for the watch dog timer.
                                                     This is a read only register. SW cannot set the value in
                                                     the counter, but can reset it.                                            */

    struct {
      __IOM uint32_t DSP0COUNT  : 8;            /*!< Read-Only current value of the WDT counter                                */
            uint32_t            : 24;
    } DSP0COUNT_b;
  } ;

  union {
    __IOM uint32_t DSP1CFG;                     /*!< This is the configuration register for the DSP1 watch dog timer.
                                                     It controls the enable, interrupt set, clocks for the timer,
                                                     the compare values for the counters to trigger a reset
                                                     or interrupt. This register can only be written to if the
                                                     associated DSP1TLOCK is not set.                                          */

    struct {
      __IOM uint32_t DSP1WDTEN  : 1;            /*!< This bitfield enables the WDT. Setting the lock implicitly sets
                                                     the WTDEN bit as well.                                                    */
      __IOM uint32_t DSP1INTEN  : 1;            /*!< This bitfield enables the DSP1 WDT interrupt. Note : This bit
                                                     must be set before the interrupt status bit will reflect
                                                     a watchdog timer expiration. The IER interrupt register
                                                     must also be enabled for a WDT interrupt to be sent to
                                                     the NVIC.                                                                 */
      __IOM uint32_t DSP1RESEN  : 1;            /*!< This bitfield enables the DSP1 reset.                                     */
      __IOM uint32_t DSP1PMRESEN : 1;           /*!< This bitfield enables the DSP1 Power Controller (PM) reset.
                                                     This needs to be set together with the DSP1WDTEN bit to
                                                     allow the reset to trigger.                                               */
            uint32_t            : 4;
      __IOM uint32_t DSP1RESVAL : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog reset for the DSP logic. This will cause a software
                                                     reset to the DSP core if the RESEN bit is set and optionally
                                                     interrupt the CPU.                                                        */
      __IOM uint32_t DSP1INTVAL : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog interrupt.                                                     */
      __IOM uint32_t DSP1PMRESVAL : 8;          /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog reset. This will cause a software reset to the
                                                     DSP Power Management logic if the PMRESEN bit is set and
                                                     optionally interrupt the CPU.                                             */
    } DSP1CFG_b;
  } ;

  union {
    __IOM uint32_t DSP1RSTRT;                   /*!< This register will restart the watchdog timer. Writing a special
                                                     key value into this register will result in the watch dog
                                                     timer being reset, so that the count will start again.
                                                     It is expected that the software will periodically write
                                                     to this register to indicate that the system is functional.
                                                     The watch dog timer can continue running when the system
                                                     is in deep sleep, and the interrupt will trigger the wake.
                                                     After the wake, the core can reset the watch dog timer.                   */

    struct {
      __IOM uint32_t DSP1RSTART : 8;            /*!< Writing 0xd2 to DSP1RSTRT restarts the watchdog timer. This
                                                     is a write only register. Reading this register will return
                                                     0.                                                                        */
            uint32_t            : 24;
    } DSP1RSTRT_b;
  } ;

  union {
    __IOM uint32_t DSP1TLOCK;                   /*!< This register locks the watch dog timer. Once it is locked,
                                                     the configuration register (DSP1CFG) for watch dog timer
                                                     cannot be written to and the timer is automatically enabled
                                                     (WDTEN is set).                                                           */

