AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
    struct {
      __IOM uint32_t DSP1LOCK   : 8;            /*!< Writing 0x4e locks the watchdog timer. Once locked, the WDTCFG
                                                     reg cannot be written and WDTEN is set.                                   */
            uint32_t            : 24;
    } DSP1TLOCK_b;
  } ;

  union {
    __IOM uint32_t DSP1COUNT;                   /*!< This register holds the current count for the watch dog timer.
                                                     This is a read only register. SW cannot set the value in
                                                     the counter, but can reset it.                                            */

    struct {
      __IOM uint32_t DSP1COUNT  : 8;            /*!< Read-Only current value of the WDT counter                                */
            uint32_t            : 24;
    } DSP1COUNT_b;
  } ;
  __IM  uint32_t  RESERVED[116];

  union {
    __IOM uint32_t WDTIEREN;                    /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
      __IOM uint32_t DSPRESETINT : 1;           /*!< Indicates that one of the DSP timers has issued a reset or pmreset
                                                     to the DSP core. This is used to interrupt the main CPU.                  */
            uint32_t            : 30;
    } WDTIEREN_b;
  } ;

  union {
    __IOM uint32_t WDTIERSTAT;                  /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
      __IOM uint32_t DSPRESETINT : 1;           /*!< Indicates that one of the DSP timers has issued a reset or pmreset
                                                     to the DSP core. This is used to interrupt the main CPU.                  */
            uint32_t            : 30;
    } WDTIERSTAT_b;
  } ;

  union {
    __IOM uint32_t WDTIERCLR;                   /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
      __IOM uint32_t DSPRESETINT : 1;           /*!< Indicates that one of the DSP timers has issued a reset or pmreset
                                                     to the DSP core. This is used to interrupt the main CPU.                  */
            uint32_t            : 30;
    } WDTIERCLR_b;
  } ;

  union {
    __IOM uint32_t WDTIERSET;                   /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
      __IOM uint32_t DSPRESETINT : 1;           /*!< Indicates that one of the DSP timers has issued a reset or pmreset
                                                     to the DSP core. This is used to interrupt the main CPU.                  */
            uint32_t            : 30;
    } WDTIERSET_b;
  } ;

  union {
    __IOM uint32_t DSP0IEREN;                   /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< DSP0 Watchdog Timer Interrupt.                                            */
            uint32_t            : 31;
    } DSP0IEREN_b;
  } ;

  union {
    __IOM uint32_t DSP0IERSTAT;                 /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< DSP0 Watchdog Timer Interrupt.                                            */
            uint32_t            : 31;
    } DSP0IERSTAT_b;
  } ;

  union {
    __IOM uint32_t DSP0IERCLR;                  /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< DSP0 Watchdog Timer Interrupt.                                            */
            uint32_t            : 31;
    } DSP0IERCLR_b;
  } ;

  union {
    __IOM uint32_t DSP0IERSET;                  /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< DSP0 Watchdog Timer Interrupt.                                            */
            uint32_t            : 31;
    } DSP0IERSET_b;
  } ;

  union {
    __IOM uint32_t DSP1IEREN;                   /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

