AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* ============================================  AUDADC SL4CFG PRMODE4 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL4CFG_PRMODE4                                                     */
  AUDADC_SL4CFG_PRMODE4_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL4CFG_PRMODE4_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL4CFG_PRMODE4_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL4CFG_PRMODE4_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL4CFG_PRMODE4_Enum;

/* =============================================  AUDADC SL4CFG CHSEL4 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL4CFG_CHSEL4                                                      */
  AUDADC_SL4CFG_CHSEL4_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL4CFG_CHSEL4_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL4CFG_CHSEL4_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL4CFG_CHSEL4_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL4CFG_CHSEL4_Enum;

/* ==============================================  AUDADC SL4CFG WCEN4 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL4CFG_WCEN4                                                       */
  AUDADC_SL4CFG_WCEN4_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 4.                              */
  AUDADC_SL4CFG_WCEN4_WCDIS            = 0,     /*!< WCDIS : Disable the window compare for slot 4.                            */
} AUDADC_SL4CFG_WCEN4_Enum;

/* ==============================================  AUDADC SL4CFG SLEN4 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL4CFG_SLEN4                                                       */
  AUDADC_SL4CFG_SLEN4_SLEN             = 1,     /*!< SLEN : Enable slot 4 for AUDADC conversions.                              */
  AUDADC_SL4CFG_SLEN4_SLDIS            = 0,     /*!< SLDIS : Disable slot 4 for AUDADC conversions.                            */
} AUDADC_SL4CFG_SLEN4_Enum;

/* ========================================================  SL5CFG  ========================================================= */
/* =============================================  AUDADC SL5CFG ADSEL5 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL5CFG_ADSEL5                                                      */
  AUDADC_SL5CFG_ADSEL5_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL5CFG_ADSEL5_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL5CFG_ADSEL5_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL5CFG_ADSEL5_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL5CFG_ADSEL5_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL5CFG_ADSEL5_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL5CFG_ADSEL5_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL5CFG_ADSEL5_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL5CFG_ADSEL5_Enum;

/* ============================================  AUDADC SL5CFG PRMODE5 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL5CFG_PRMODE5                                                     */
  AUDADC_SL5CFG_PRMODE5_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL5CFG_PRMODE5_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL5CFG_PRMODE5_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL5CFG_PRMODE5_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL5CFG_PRMODE5_Enum;

/* =============================================  AUDADC SL5CFG CHSEL5 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL5CFG_CHSEL5                                                      */
  AUDADC_SL5CFG_CHSEL5_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL5CFG_CHSEL5_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL5CFG_CHSEL5_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL5CFG_CHSEL5_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL5CFG_CHSEL5_Enum;

/* ==============================================  AUDADC SL5CFG WCEN5 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL5CFG_WCEN5                                                       */
  AUDADC_SL5CFG_WCEN5_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 5.                              */
  AUDADC_SL5CFG_WCEN5_WCDIS            = 0,     /*!< WCDIS : Disable the window compare for slot 5.                            */
} AUDADC_SL5CFG_WCEN5_Enum;

/* ==============================================  AUDADC SL5CFG SLEN5 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL5CFG_SLEN5                                                       */
  AUDADC_SL5CFG_SLEN5_SLEN             = 1,     /*!< SLEN : Enable slot 5 for AUDADC conversions.                              */
  AUDADC_SL5CFG_SLEN5_SLDIS            = 0,     /*!< SLDIS : Disable slot 5 for AUDADC conversions.                            */
} AUDADC_SL5CFG_SLEN5_Enum;

/* ========================================================  SL6CFG  ========================================================= */
/* =============================================  AUDADC SL6CFG ADSEL6 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL6CFG_ADSEL6                                                      */
  AUDADC_SL6CFG_ADSEL6_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL6CFG_ADSEL6_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL6CFG_ADSEL6_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL6CFG_ADSEL6_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL6CFG_ADSEL6_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL6CFG_ADSEL6_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL6CFG_ADSEL6_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL6CFG_ADSEL6_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL6CFG_ADSEL6_Enum;

/* ============================================  AUDADC SL6CFG PRMODE6 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL6CFG_PRMODE6                                                     */
  AUDADC_SL6CFG_PRMODE6_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL6CFG_PRMODE6_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL6CFG_PRMODE6_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL6CFG_PRMODE6_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL6CFG_PRMODE6_Enum;

/* =============================================  AUDADC SL6CFG CHSEL6 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL6CFG_CHSEL6                                                      */
  AUDADC_SL6CFG_CHSEL6_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL6CFG_CHSEL6_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL6CFG_CHSEL6_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL6CFG_CHSEL6_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL6CFG_CHSEL6_Enum;

