AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* ===============================================  AUDADC INTEN ZXCA [8..8]  ================================================ */
typedef enum {                                  /*!< AUDADC_INTEN_ZXCA                                                         */
  AUDADC_INTEN_ZXCA_ZXCAINT            = 1,     /*!< ZXCAINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
} AUDADC_INTEN_ZXCA_Enum;

/* ===============================================  AUDADC INTEN DERR [7..7]  ================================================ */
typedef enum {                                  /*!< AUDADC_INTEN_DERR                                                         */
  AUDADC_INTEN_DERR_DMAERROR           = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTEN_DERR_Enum;

/* ===============================================  AUDADC INTEN DCMP [6..6]  ================================================ */
typedef enum {                                  /*!< AUDADC_INTEN_DCMP                                                         */
  AUDADC_INTEN_DCMP_DMACOMPLETE        = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTEN_DCMP_Enum;

/* ===============================================  AUDADC INTEN WCINC [5..5]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_WCINC                                                        */
  AUDADC_INTEN_WCINC_WCINCINT          = 1,     /*!< WCINCINT : Window comparator voltage incursion interrupt.                 */
} AUDADC_INTEN_WCINC_Enum;

/* ===============================================  AUDADC INTEN WCEXC [4..4]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_WCEXC                                                        */
  AUDADC_INTEN_WCEXC_WCEXCINT          = 1,     /*!< WCEXCINT : Window comparator voltage excursion interrupt.                 */
} AUDADC_INTEN_WCEXC_Enum;

/* =============================================  AUDADC INTEN FIFOOVR2 [3..3]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_FIFOOVR2                                                     */
  AUDADC_INTEN_FIFOOVR2_FIFOFULLINT    = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTEN_FIFOOVR2_Enum;

/* =============================================  AUDADC INTEN FIFOOVR1 [2..2]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_FIFOOVR1                                                     */
  AUDADC_INTEN_FIFOOVR1_FIFO75INT      = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTEN_FIFOOVR1_Enum;

/* ==============================================  AUDADC INTEN SCNCMP [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_SCNCMP                                                       */
  AUDADC_INTEN_SCNCMP_SCNCMPINT        = 1,     /*!< SCNCMPINT : AUDADC scan complete interrupt.                               */
} AUDADC_INTEN_SCNCMP_Enum;

/* ==============================================  AUDADC INTEN CNVCMP [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_CNVCMP                                                       */
  AUDADC_INTEN_CNVCMP_CNVCMPINT        = 1,     /*!< CNVCMPINT : AUDADC conversion complete interrupt.                         */
} AUDADC_INTEN_CNVCMP_Enum;

/* ========================================================  INTSTAT  ======================================================== */
/* =============================================  AUDADC INTSTAT SATCB [11..11]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_SATCB                                                      */
  AUDADC_INTSTAT_SATCB_SATCBINT        = 1,     /*!< SATCBINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
} AUDADC_INTSTAT_SATCB_Enum;

/* =============================================  AUDADC INTSTAT SATCA [10..10]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_SATCA                                                      */
  AUDADC_INTSTAT_SATCA_SATCAINT        = 1,     /*!< SATCAINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
} AUDADC_INTSTAT_SATCA_Enum;

/* ==============================================  AUDADC INTSTAT ZXCB [9..9]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_ZXCB                                                       */
  AUDADC_INTSTAT_ZXCB_ZXCBINT          = 1,     /*!< ZXCBINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
} AUDADC_INTSTAT_ZXCB_Enum;

/* ==============================================  AUDADC INTSTAT ZXCA [8..8]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_ZXCA                                                       */
  AUDADC_INTSTAT_ZXCA_ZXCAINT          = 1,     /*!< ZXCAINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
} AUDADC_INTSTAT_ZXCA_Enum;

