AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* ==============================================  AUDADC INTSTAT DERR [7..7]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_DERR                                                       */
  AUDADC_INTSTAT_DERR_DMAERROR         = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTSTAT_DERR_Enum;

/* ==============================================  AUDADC INTSTAT DCMP [6..6]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_DCMP                                                       */
  AUDADC_INTSTAT_DCMP_DMACOMPLETE      = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTSTAT_DCMP_Enum;

/* ==============================================  AUDADC INTSTAT WCINC [5..5]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_WCINC                                                      */
  AUDADC_INTSTAT_WCINC_WCINCINT        = 1,     /*!< WCINCINT : Window comparator voltage incursion interrupt.                 */
} AUDADC_INTSTAT_WCINC_Enum;

/* ==============================================  AUDADC INTSTAT WCEXC [4..4]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_WCEXC                                                      */
  AUDADC_INTSTAT_WCEXC_WCEXCINT        = 1,     /*!< WCEXCINT : Window comparator voltage excursion interrupt.                 */
} AUDADC_INTSTAT_WCEXC_Enum;

/* ============================================  AUDADC INTSTAT FIFOOVR2 [3..3]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_FIFOOVR2                                                   */
  AUDADC_INTSTAT_FIFOOVR2_FIFOFULLINT  = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTSTAT_FIFOOVR2_Enum;

/* ============================================  AUDADC INTSTAT FIFOOVR1 [2..2]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_FIFOOVR1                                                   */
  AUDADC_INTSTAT_FIFOOVR1_FIFO75INT    = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTSTAT_FIFOOVR1_Enum;

/* =============================================  AUDADC INTSTAT SCNCMP [1..1]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_SCNCMP                                                     */
  AUDADC_INTSTAT_SCNCMP_SCNCMPINT      = 1,     /*!< SCNCMPINT : AUDADC scan complete interrupt.                               */
} AUDADC_INTSTAT_SCNCMP_Enum;

/* =============================================  AUDADC INTSTAT CNVCMP [0..0]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_CNVCMP                                                     */
  AUDADC_INTSTAT_CNVCMP_CNVCMPINT      = 1,     /*!< CNVCMPINT : AUDADC conversion complete interrupt.                         */
} AUDADC_INTSTAT_CNVCMP_Enum;

/* ========================================================  INTCLR  ========================================================= */
/* =============================================  AUDADC INTCLR SATCB [11..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_SATCB                                                       */
  AUDADC_INTCLR_SATCB_SATCBINT         = 1,     /*!< SATCBINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
} AUDADC_INTCLR_SATCB_Enum;

/* =============================================  AUDADC INTCLR SATCA [10..10]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_SATCA                                                       */
  AUDADC_INTCLR_SATCA_SATCAINT         = 1,     /*!< SATCAINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
} AUDADC_INTCLR_SATCA_Enum;

/* ===============================================  AUDADC INTCLR ZXCB [9..9]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_ZXCB                                                        */
  AUDADC_INTCLR_ZXCB_ZXCBINT           = 1,     /*!< ZXCBINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
} AUDADC_INTCLR_ZXCB_Enum;

/* ===============================================  AUDADC INTCLR ZXCA [8..8]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_ZXCA                                                        */
  AUDADC_INTCLR_ZXCA_ZXCAINT           = 1,     /*!< ZXCAINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
} AUDADC_INTCLR_ZXCA_Enum;

/* ===============================================  AUDADC INTCLR DERR [7..7]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_DERR                                                        */
  AUDADC_INTCLR_DERR_DMAERROR          = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTCLR_DERR_Enum;

/* ===============================================  AUDADC INTCLR DCMP [6..6]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_DCMP                                                        */
  AUDADC_INTCLR_DCMP_DMACOMPLETE       = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTCLR_DCMP_Enum;

/* ==============================================  AUDADC INTCLR WCINC [5..5]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_WCINC                                                       */
  AUDADC_INTCLR_WCINC_WCINCINT         = 1,     /*!< WCINCINT : Window comparator voltage incursion interrupt.                 */
} AUDADC_INTCLR_WCINC_Enum;

/* ==============================================  AUDADC INTCLR WCEXC [4..4]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_WCEXC                                                       */
  AUDADC_INTCLR_WCEXC_WCEXCINT         = 1,     /*!< WCEXCINT : Window comparator voltage excursion interrupt.                 */
} AUDADC_INTCLR_WCEXC_Enum;

/* =============================================  AUDADC INTCLR FIFOOVR2 [3..3]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTCLR_FIFOOVR2                                                    */
  AUDADC_INTCLR_FIFOOVR2_FIFOFULLINT   = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTCLR_FIFOOVR2_Enum;

/* =============================================  AUDADC INTCLR FIFOOVR1 [2..2]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTCLR_FIFOOVR1                                                    */
  AUDADC_INTCLR_FIFOOVR1_FIFO75INT     = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTCLR_FIFOOVR1_Enum;

/* ==============================================  AUDADC INTCLR SCNCMP [1..1]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_SCNCMP                                                      */
  AUDADC_INTCLR_SCNCMP_SCNCMPINT       = 1,     /*!< SCNCMPINT : AUDADC scan complete interrupt.                               */
} AUDADC_INTCLR_SCNCMP_Enum;

