AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* ==============================================  AUDADC INTCLR CNVCMP [0..0]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_CNVCMP                                                      */
  AUDADC_INTCLR_CNVCMP_CNVCMPINT       = 1,     /*!< CNVCMPINT : AUDADC conversion complete interrupt.                         */
} AUDADC_INTCLR_CNVCMP_Enum;

/* ========================================================  INTSET  ========================================================= */
/* =============================================  AUDADC INTSET SATCB [11..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_SATCB                                                       */
  AUDADC_INTSET_SATCB_SATCBINT         = 1,     /*!< SATCBINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
} AUDADC_INTSET_SATCB_Enum;

/* =============================================  AUDADC INTSET SATCA [10..10]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_SATCA                                                       */
  AUDADC_INTSET_SATCA_SATCAINT         = 1,     /*!< SATCAINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
} AUDADC_INTSET_SATCA_Enum;

/* ===============================================  AUDADC INTSET ZXCB [9..9]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_ZXCB                                                        */
  AUDADC_INTSET_ZXCB_ZXCBINT           = 1,     /*!< ZXCBINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
} AUDADC_INTSET_ZXCB_Enum;

/* ===============================================  AUDADC INTSET ZXCA [8..8]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_ZXCA                                                        */
  AUDADC_INTSET_ZXCA_ZXCAINT           = 1,     /*!< ZXCAINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
} AUDADC_INTSET_ZXCA_Enum;

/* ===============================================  AUDADC INTSET DERR [7..7]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_DERR                                                        */
  AUDADC_INTSET_DERR_DMAERROR          = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTSET_DERR_Enum;

/* ===============================================  AUDADC INTSET DCMP [6..6]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_DCMP                                                        */
  AUDADC_INTSET_DCMP_DMACOMPLETE       = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTSET_DCMP_Enum;

/* ==============================================  AUDADC INTSET WCINC [5..5]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_WCINC                                                       */
  AUDADC_INTSET_WCINC_WCINCINT         = 1,     /*!< WCINCINT : Window comparator voltage incursion interrupt.                 */
} AUDADC_INTSET_WCINC_Enum;

/* ==============================================  AUDADC INTSET WCEXC [4..4]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_WCEXC                                                       */
  AUDADC_INTSET_WCEXC_WCEXCINT         = 1,     /*!< WCEXCINT : Window comparator voltage excursion interrupt.                 */
} AUDADC_INTSET_WCEXC_Enum;

/* =============================================  AUDADC INTSET FIFOOVR2 [3..3]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSET_FIFOOVR2                                                    */
  AUDADC_INTSET_FIFOOVR2_FIFOFULLINT   = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTSET_FIFOOVR2_Enum;

/* =============================================  AUDADC INTSET FIFOOVR1 [2..2]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSET_FIFOOVR1                                                    */
  AUDADC_INTSET_FIFOOVR1_FIFO75INT     = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTSET_FIFOOVR1_Enum;

/* ==============================================  AUDADC INTSET SCNCMP [1..1]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_SCNCMP                                                      */
  AUDADC_INTSET_SCNCMP_SCNCMPINT       = 1,     /*!< SCNCMPINT : AUDADC scan complete interrupt.                               */
} AUDADC_INTSET_SCNCMP_Enum;

/* ==============================================  AUDADC INTSET CNVCMP [0..0]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_CNVCMP                                                      */
  AUDADC_INTSET_CNVCMP_CNVCMPINT       = 1,     /*!< CNVCMPINT : AUDADC conversion complete interrupt.                         */
} AUDADC_INTSET_CNVCMP_Enum;

