AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* ============================================  CLKGEN HFADJ HFWARMUP [20..20]  ============================================= */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFWARMUP                                                     */
  CLKGEN_HFADJ_HFWARMUP_1SEC           = 0,     /*!< 1SEC : Autoadjust XT warmup period = 1-2 seconds                          */
  CLKGEN_HFADJ_HFWARMUP_2SEC           = 1,     /*!< 2SEC : Autoadjust XT warmup period = 2-4 seconds                          */
} CLKGEN_HFADJ_HFWARMUP_Enum;

/* ==============================================  CLKGEN HFADJ HFADJCK [1..3]  ============================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJCK                                                      */
  CLKGEN_HFADJ_HFADJCK_4SEC            = 0,     /*!< 4SEC : Autoadjust repeat period = 4 seconds                               */
  CLKGEN_HFADJ_HFADJCK_16SEC           = 1,     /*!< 16SEC : Autoadjust repeat period = 16 seconds                             */
  CLKGEN_HFADJ_HFADJCK_32SEC           = 2,     /*!< 32SEC : Autoadjust repeat period = 32 seconds                             */
  CLKGEN_HFADJ_HFADJCK_64SEC           = 3,     /*!< 64SEC : Autoadjust repeat period = 64 seconds                             */
  CLKGEN_HFADJ_HFADJCK_128SEC          = 4,     /*!< 128SEC : Autoadjust repeat period = 128 seconds                           */
  CLKGEN_HFADJ_HFADJCK_256SEC          = 5,     /*!< 256SEC : Autoadjust repeat period = 256 seconds                           */
  CLKGEN_HFADJ_HFADJCK_512SEC          = 6,     /*!< 512SEC : Autoadjust repeat period = 512 seconds                           */
  CLKGEN_HFADJ_HFADJCK_1024SEC         = 7,     /*!< 1024SEC : Autoadjust repeat period = 1024 seconds                         */
} CLKGEN_HFADJ_HFADJCK_Enum;

/* ==============================================  CLKGEN HFADJ HFADJEN [0..0]  ============================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJEN                                                      */
  CLKGEN_HFADJ_HFADJEN_DIS             = 0,     /*!< DIS : Disable the HFRC adjustment                                         */
  CLKGEN_HFADJ_HFADJEN_EN              = 1,     /*!< EN : Enable the HFRC adjustment                                           */
} CLKGEN_HFADJ_HFADJEN_Enum;

/* ======================================================  CLOCKENSTAT  ====================================================== */
/* ========================================  CLKGEN CLOCKENSTAT CLOCKENSTAT [0..31]  ========================================= */
typedef enum {                                  /*!< CLKGEN_CLOCKENSTAT_CLOCKENSTAT                                            */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_PERIPH_ALL_XTAL_EN = 16777216,/*!< PERIPH_ALL_XTAL_EN : [24] Clock enable for PERIPH_ALL_XTAL_EN */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_PERIPH_ALL_HFRC_EN = 33554432,/*!< PERIPH_ALL_HFRC_EN : [25] Clock enable for PERIPH_ALL_HFRC_EN */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_HFADJEN = 67108864,/*!< HFADJEN : [26] HFRC Adjust enabled                                    */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_HFRC_EN_HFADJ = 134217728,/*!< HFRC_EN_HFADJ : [27] HFRC HFADJ enabled                        */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_nOSEL = 268435456,/*!< nOSEL : [28] ~OSEL                                                     */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_clkout_xtal_en = 536870912,/*!< clkout_xtal_en : [29] XTAL clkout enabled                     */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_clkout_hfrc_en = 1073741824,/*!< clkout_hfrc_en : [30] HFRC clkout enabled                    */
} CLKGEN_CLOCKENSTAT_CLOCKENSTAT_Enum;

/* =====================================================  CLOCKEN2STAT  ====================================================== */
/* =======================================  CLKGEN CLOCKEN2STAT CLOCKEN2STAT [0..31]  ======================================== */
typedef enum {                                  /*!< CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT                                          */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_ADC_CLKEN = 1,/*!< ADC_CLKEN : [0] Clock enable for the ADC.                                */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_ACTIVITY_CLKEN = 2,/*!< APBDMA_ACTIVITY_CLKEN : [1] Clock enable for the APBDMA ACTIVITY */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_AOH_CLKEN = 4,/*!< APBDMA_AOH_CLKEN : [2] Clock enable for the APBDMA AOH DOMAIN     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_AOL_CLKEN = 8,/*!< APBDMA_AOL_CLKEN : [3] Clock enable for the APBDMA AOL DOMAIN     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_APB_CLKEN = 16,/*!< APBDMA_APB_CLKEN : [4] Clock enable for the APBDMA_APB           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_AUD_CLKEN = 32,/*!< APBDMA_AUD_CLKEN : [5] Clock enable for the APBDMA_AUD           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_CRYPTO_CLKEN = 64,/*!< APBDMA_CRYPTO_CLKEN : [6] Clock enable for the APBDMA_HCPA    */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DBG_CLKEN = 128,/*!< APBDMA_DBG_CLKEN : [7] Clock enable for the APBDMA_DBG          */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DISP_CLKEN = 256,/*!< APBDMA_DISP_CLKEN : [8] Clock enable for the APBDMA_DISP       */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DISPPHY_CLKEN = 512,/*!< APBDMA_DISPPHY_CLKEN : [9] Clock enable for the APBDMA_DISPPHY */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DSPA_CLKEN = 1024,/*!< APBDMA_DSPA_CLKEN : [10] Clock enable for the APBDMA_DSPA     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_GFX_CLKEN = 2048,/*!< APBDMA_GFX_CLKEN : [11] Clock enable for the APBDMA_GFX        */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_HSPA_CLKEN = 4096,/*!< APBDMA_HSPA_CLKEN : [12] Clock enable for the APBDMA_HSPA     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_HSPB_CLKEN = 8192,/*!< APBDMA_HSPB_CLKEN : [13] Clock enable for the APBDMA_HSPB     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_HSPC_CLKEN = 16384,/*!< APBDMA_HSPC_CLKEN : [14] Clock enable for the APBDMA_HSPC    */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_IOS_CLKEN = 32768,/*!< APBDMA_IOS_CLKEN : [15] Clock enable for the APBDMA_IOS       */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_MSPI0_CLKEN = 65536,/*!< APBDMA_MSPI0_CLKEN : [16] Clock enable for the APBDMA_MSPI0 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_MSPI1_CLKEN = 131072,/*!< APBDMA_MSPI1_CLKEN : [17] Clock enable for the APBDMA_MSPI1 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_MSPI2_CLKEN = 262144,/*!< APBDMA_MSPI2_CLKEN : [18] Clock enable for the APBDMA_MSPI2 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_SDIO_CLKEN = 524288,/*!< APBDMA_SDIO_CLKEN : [19] Clock enable for the APBDMA_SDIO   */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_USB_CLKEN = 1048576,/*!< APBDMA_USB_CLKEN : [20] Clock enable for the APBDMA_USB     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_AUDADC_CLKEN = 2097152,/*!< AUDADC_CLKEN : [21] Clock enable for the AUDADC                 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_CM4_TPIU_CLKEN = 4194304,/*!< CM4_TPIU_CLKEN : [22] Clock enable for the CM4_TPIU           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DBG_TPIU_CLKEN = 8388608,/*!< DBG_TPIU_CLKEN : [23] Clock enable for the DBG_TPIU           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DBG_TS_CLKEN = 16777216,/*!< DBG_TS_CLKEN : [24] Clock enable for the DBG_TS                */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DISP_CLK_CLKEN = 33554432,/*!< DISP_CLK_CLKEN : [25] Clock enable for the DISP_CLK          */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DPHY_PLL_REF_CLKEN = 67108864,/*!< DPHY_PLL_REF_CLKEN : [26] Clock enable for the DPHY_PLL_REF */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S0_CLKEN = 134217728,/*!< DSP_I2S0_CLKEN : [27] Clock enable for the DSP_I2S0         */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S0_REFCLK_CLKEN = 268435456,/*!< DSP_I2S0_REFCLK_CLKEN : [28] Clock enable for the DSP_I2S0_REFCLK */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S1_CLKEN = 536870912,/*!< DSP_I2S1_CLKEN : [29] Clock enable for the DSP_I2S1         */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S1_REFCLK_CLKEN = 1073741824,/*!< DSP_I2S1_REFCLK_CLKEN : [30] Clock enable for the DSP_I2S1_REFCLK */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_MILLI_CLKEN = -2147483648,/*!< DSP_MILLI_CLKEN : [31] Clock enable for the DSP_MILLI    */
} CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_Enum;

/* =====================================================  CLOCKEN3STAT  ====================================================== */
/* =======================================  CLKGEN CLOCKEN3STAT CLOCKEN3STAT [0..31]  ======================================== */
typedef enum {                                  /*!< CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT                                          */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM0_CLKEN = 1,/*!< DSP_PDM0_CLKEN : [0] Clock enable for the DSP_PDM0                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM1_CLKEN = 2,/*!< DSP_PDM1_CLKEN : [1] Clock enable for the DSP_PDM1                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM2_CLKEN = 4,/*!< DSP_PDM2_CLKEN : [2] Clock enable for the DSP_PDM2                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM3_CLKEN = 8,/*!< DSP_PDM3_CLKEN : [3] Clock enable for the DSP_PDM3                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_I3C0_REFCLK_CLKEN = 16,/*!< I3C0_REFCLK_CLKEN : [4] Clock enable for the I3C0_REFCLK        */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_I3C1_REFCLK_CLKEN = 32,/*!< I3C1_REFCLK_CLKEN : [5] Clock enable for the I3C1_REFCLK        */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC0_CLKEN = 64,/*!< IOMSTRIFC0_CLKEN : [6] Clock enable for the IOMSTRIFC0           */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC1_CLKEN = 128,/*!< IOMSTRIFC1_CLKEN : [7] Clock enable for the IO MASTER 1 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC2_CLKEN = 256,/*!< IOMSTRIFC2_CLKEN : [8] Clock enable for the IO MASTER 2 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC3_CLKEN = 512,/*!< IOMSTRIFC3_CLKEN : [9] Clock enable for the IO MASTER 3 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC4_CLKEN = 1024,/*!< IOMSTRIFC4_CLKEN : [10] Clock enable for the IO MASTER 4 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC5_CLKEN = 2048,/*!< IOMSTRIFC5_CLKEN : [11] Clock enable for the IO MASTER 5 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC6_CLKEN = 4096,/*!< IOMSTRIFC6_CLKEN : [12] Clock enable for the IO MASTER 6 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC7_CLKEN = 8192,/*!< IOMSTRIFC7_CLKEN : [13] Clock enable for the IO MASTER 7 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RSTGEN_CLKEN = 16384,/*!< RSTGEN_CLKEN : [14] Clock enable for the RSTGEN                   */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RSTGEN_POS_CLKEN = 32768,/*!< RSTGEN_POS_CLKEN : [15] Clock enable for the RSTGEN           */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RTC_CLKEN = 65536,/*!< RTC_CLKEN : [16] Clock enable for the RTC                            */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_SDIO_XIN_CLKEN = 131072,/*!< SDIO_XIN_CLKEN : [17] Clock enable for the SDIO_XIN            */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART0HF_CLKEN = 262144,/*!< UART0HF_CLKEN : [18] Clock enable for the UART0 HF              */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART1HF_CLKEN = 524288,/*!< UART1HF_CLKEN : [19] Clock enable for the UART1 HF              */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART2HF_CLKEN = 1048576,/*!< UART2HF_CLKEN : [20] Clock enable for the UART2 HF             */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART3HF_CLKEN = 2097152,/*!< UART3HF_CLKEN : [21] Clock enable for the UART3 HF             */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_USB_REFCLK_CLKEN = 4194304,/*!< USB_REFCLK_CLKEN : [22] Clock enable for the USB_REFCLK     */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_WDT_CLKEN = 8388608,/*!< WDT_CLKEN : [23] Clock enable for the WDT                          */
} CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_Enum;

/* =========================================================  MISC  ========================================================== */
/* ===========================================  CLKGEN MISC PWRONCLKENDISP [6..6]  =========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENDISP                                                */
  CLKGEN_MISC_PWRONCLKENDISP_DISPCLKENRST = 0,  /*!< DISPCLKENRST : Enable Display Clock to run during reset                   */
  CLKGEN_MISC_PWRONCLKENDISP_DEFEATURE = 1,     /*!< DEFEATURE : Revert to revA behavior. Disable display clock from
                                                     running during reset.                                                     */
} CLKGEN_MISC_PWRONCLKENDISP_Enum;

/* ==============================================  CLKGEN MISC FRCHFRC2 [5..5]  ============================================== */
typedef enum {                                  /*!< CLKGEN_MISC_FRCHFRC2                                                      */
  CLKGEN_MISC_FRCHFRC2_NOFRC           = 0,     /*!< NOFRC : Do not force HFRC2 on; stops in deep sleep mode.                  */
  CLKGEN_MISC_FRCHFRC2_FRC             = 1,     /*!< FRC : Force HFRC2 on; runs in deep sleep mode.                            */
} CLKGEN_MISC_FRCHFRC2_Enum;

