AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* =========================================  DC LAYER2MODE LAYER2COLORMODE [0..4]  ========================================== */
typedef enum {                                  /*!< DC_LAYER2MODE_LAYER2COLORMODE                                             */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_LUTBLE = 0,/*!< LAYER2_LUTBLE : 8-bit color palette look-up table (LUT8)                */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_RGBX5551 = 1,/*!< LAYER2_RGBX5551 : 16-bit RGBX5551 color format                        */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_RGBX8888 = 2,/*!< LAYER2_RGBX8888 : 32-bit RGBX8888 color format                        */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_RGB332 = 4,/*!< LAYER2_RGB332 : 8-bit RGB332 color format                               */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_RGB565 = 5,/*!< LAYER2_RGB565 : 16-bit RGB565 color format                              */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_XRGB8888 = 6,/*!< LAYER2_XRGB8888 : 32-bit XRGB8888 color format                        */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_L8 = 7,  /*!< LAYER2_L8 : L8 Grayscale/Palette format                                   */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_L1 = 8,  /*!< LAYER2_L1 : L1 Grayscale/Palette format                                   */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_L4 = 9,  /*!< LAYER2_L4 : L4 Grayscale/Palette format                                   */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_YUYV = 10,/*!< LAYER2_YUYV : YUYV color format                                          */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_RGB = 11,/*!< LAYER2_RGB : 24-bit RGB color format                                      */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_YUY2 = 12,/*!< LAYER2_YUY2 : YUY2 color format                                          */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_ABGR8888 = 13,/*!< LAYER2_ABGR8888 : 32-bit ABGR8888 color format                       */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_BGRA8888 = 14,/*!< LAYER2_BGRA8888 : 32-bit BGRA8888 color format                       */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_VIDEO420 = 16,/*!< LAYER2_VIDEO420 : Video 420 Mode                                     */
  DC_LAYER2MODE_LAYER2COLORMODE_LAYER2_TRILIN420 = 17,/*!< LAYER2_TRILIN420 : Trilinear 420 Video Mode                         */
} DC_LAYER2MODE_LAYER2COLORMODE_Enum;

/* =====================================================  LAYER2STARTXY  ===================================================== */
/* =====================================================  LAYER2SIZEXY  ====================================================== */
/* ======================================================  LAYER2ADDR  ======================================================= */
/* =====================================================  LAYER2STRIDE  ====================================================== */
/* ======================================  DC LAYER2STRIDE LAYER2AXIFIFOTHLD [19..20]  ======================================= */
typedef enum {                                  /*!< DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD                                         */
  DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD_LAYER2_BURST_HALF_SZ = 0,/*!< LAYER2_BURST_HALF_SZ : half fifo (default)                   */
  DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD_LAYER2_BURST_2 = 1,/*!< LAYER2_BURST_2 : 2 burst-size                                      */
  DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD_LAYER2_BURST_4 = 2,/*!< LAYER2_BURST_4 : 4 burst-size                                      */
  DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD_LAYER2_BURST_8 = 3,/*!< LAYER2_BURST_8 : 8 burst-size                                      */
} DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD_Enum;

/* ======================================  DC LAYER2STRIDE LAYER2AXIBURSTBITS [16..18]  ====================================== */
typedef enum {                                  /*!< DC_LAYER2STRIDE_LAYER2AXIBURSTBITS                                        */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_DEF = 0,/*!< LAYER2_BEATS_DEF : 16-beats (default)                           */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_2 = 1,/*!< LAYER2_BEATS_2 : 2-beats                                          */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_4 = 2,/*!< LAYER2_BEATS_4 : 4-beats                                          */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_8 = 3,/*!< LAYER2_BEATS_8 : 8-beats                                          */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_16 = 4,/*!< LAYER2_BEATS_16 : 16-beats (CHECK mistake?)                      */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_32 = 5,/*!< LAYER2_BEATS_32 : 32-beats (AXI4 only)                           */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_64 = 6,/*!< LAYER2_BEATS_64 : 64-beats (AXI4 only)                           */
  DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_LAYER2_BEATS_128 = 7,/*!< LAYER2_BEATS_128 : 128-beats (AXI4 only)                        */
} DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_Enum;

/* ======================================================  LAYER2RESXY  ====================================================== */
/* =====================================================  LAYER2SCALEX  ====================================================== */
/* =====================================================  LAYER2SCALEY  ====================================================== */
/* ======================================================  LAYER3MODE  ======================================================= */
/* ==========================================  DC LAYER3MODE LAYER3DBLEND [12..15]  ========================================== */
typedef enum {                                  /*!< DC_LAYER3MODE_LAYER3DBLEND                                                */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DBLACK_BLEND = 0,/*!< LAYER3_DBLACK_BLEND : blend black                                    */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DWHITE_BLEND = 1,/*!< LAYER3_DWHITE_BLEND : blend white                                    */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DALBHAS_BLEND = 2,/*!< LAYER3_DALBHAS_BLEND : blend alpha source                           */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DALPHAG_BLEND = 3,/*!< LAYER3_DALPHAG_BLEND : blend alpha global                           */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DALPHASG_BLEND = 4,/*!< LAYER3_DALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DINVERT_BLEND_SRC = 5,/*!< LAYER3_DINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DINVERT_GLOBAL_BLEND = 6,/*!< LAYER3_DINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DINVERTSG_BLEND = 7,/*!< LAYER3_DINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DALPHA_BLEND = 10,/*!< LAYER3_DALPHA_BLEND : blend alpha destination                       */
  DC_LAYER3MODE_LAYER3DBLEND_LAYER3_DINVERT_BLEND_DST = 13,/*!< LAYER3_DINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER3MODE_LAYER3DBLEND_Enum;

/* ==========================================  DC LAYER3MODE LAYER3SBLEND [8..11]  =========================================== */
typedef enum {                                  /*!< DC_LAYER3MODE_LAYER3SBLEND                                                */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SBLACKBLEND = 0,/*!< LAYER3SBLACKBLEND : layer 3 black blend register. blend black          */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SWHITEBLEND = 1,/*!< LAYER3SWHITEBLEND : blend white                                        */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SALBHASBLEND = 2,/*!< LAYER3SALBHASBLEND : blend alpha source                               */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SALPHAGBLEND = 3,/*!< LAYER3SALPHAGBLEND : blend alpha global                               */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SALPHASGBLEND = 4,/*!< LAYER3SALPHASGBLEND : blend alpha source and alpha global            */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3_SINVERT_BLEND_SRC = 5,/*!< LAYER3_SINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SINVERTGLOBALBLEND = 6,/*!< LAYER3SINVERTGLOBALBLEND : blend inverted global                */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SINVERTSGBLEND = 7,/*!< LAYER3SINVERTSGBLEND : blend inverted source and inverted global    */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3SALPHABLEND = 10,/*!< LAYER3SALPHABLEND : blend alpha destination                           */
  DC_LAYER3MODE_LAYER3SBLEND_LAYER3_SINVERT_BLEND_DST = 13,/*!< LAYER3_SINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER3MODE_LAYER3SBLEND_Enum;

