AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* ======================================================  CPUMBINTSET  ====================================================== */
/* ======================================================  CPUMBINTCLR  ====================================================== */
/* =====================================================  CPUMBINTSTAT  ====================================================== */
/* =====================================================  CPUCPUMBDATA  ====================================================== */
/* =====================================================  DSP0CPUMBDATA  ===================================================== */
/* =====================================================  DSP1CPUMBDATA  ===================================================== */
/* =====================================================  DSP0MBINTSET  ====================================================== */
/* =====================================================  DSP0MBINTCLR  ====================================================== */
/* =====================================================  DSP0MBINTSTAT  ===================================================== */
/* =====================================================  CPUDSP0MBDATA  ===================================================== */
/* ====================================================  DSP0DSP0MBDATA  ===================================================== */
/* ====================================================  DSP1DSP0MBDATA  ===================================================== */
/* =====================================================  DSP1MBINTSET  ====================================================== */
/* =====================================================  DSP1MBINTCLR  ====================================================== */
/* =====================================================  DSP1MBINTSTAT  ===================================================== */
/* =====================================================  CPUDSP1MBDATA  ===================================================== */
/* ====================================================  DSP0DSP1MBDATA  ===================================================== */
/* ====================================================  DSP1DSP1MBDATA  ===================================================== */
/* ======================================================  DSP0CONTROL  ====================================================== */
/* ==========================================  DSP DSP0CONTROL DSP0IDMATRIG [4..5]  ========================================== */
typedef enum {                                  /*!< DSP_DSP0CONTROL_DSP0IDMATRIG                                              */
  DSP_DSP0CONTROL_DSP0IDMATRIG_XTRIG   = 3,     /*!< XTRIG : Trigger is disabled until a cross trigger pulse is asserted.
                                                     This will allow another source (determined by the XTRIGSRC
                                                     register) to allow the DMA descriptor chain to proceed.                   */
  DSP_DSP0CONTROL_DSP0IDMATRIG_SSTEP   = 2,     /*!< SSTEP : Trigger is disabled until a trigger pulse (PULSE in
                                                     IDMATRIG register) is asserted. This will allow a single
                                                     step in the DMA descriptor chain to be enabled until next
                                                     completion.                                                               */
  DSP_DSP0CONTROL_DSP0IDMATRIG_AON     = 1,     /*!< AON : Trigger is always enabled. With this set, any trigger
                                                     out will immediately generate a trigger in                                */
  DSP_DSP0CONTROL_DSP0IDMATRIG_DISABLE = 0,     /*!< DISABLE : Trigger is disabled. This will pause the iDMA indefinitely
                                                     until enabled.                                                            */
} DSP_DSP0CONTROL_DSP0IDMATRIG_Enum;

/* =====================================================  DSP0RESETVEC  ====================================================== */
/* ======================================================  DSP0IRQMASK  ====================================================== */
/* =====================================================  DSP0WAKEMASK  ====================================================== */
/* ==================================================  DSP0RAWIRQSTAT31to0  ================================================== */
/* =================================================  DSP0RAWIRQSTAT63to32  ================================================== */
/* =================================================  DSP0RAWIRQSTAT95to64  ================================================== */
/* =====================================================  DSP0L2LVLINT  ====================================================== */
/* =====================================================  DSP0L3LVLINT  ====================================================== */
/* =====================================================  DSP0L4LVLINT  ====================================================== */
/* =====================================================  DSP0L5LVLINT  ====================================================== */
/* ====================================================  DSP0IDMATRIGCTL  ==================================================== */
/* ==================================================  DSP0INTORMASK31TO0A  ================================================== */
/* =================================================  DSP0INTORMASK63TO32A  ================================================== */
/* =================================================  DSP0INTORMASK95TO64A  ================================================== */
/* ==================================================  DSP0INTORMASK31to0B  ================================================== */
/* =================================================  DSP0INTORMASK63TO32B  ================================================== */
/* =================================================  DSP0INTORMASK95TO64B  ================================================== */
/* ===================================================  DSP0INTENIRQ31TO0  =================================================== */
/* ==================================================  DSP0INTENIRQ63TO32  =================================================== */
/* ==================================================  DSP0INTENIRQ95TO64  =================================================== */
/* ======================================================  DSP1CONTROL  ====================================================== */
/* ==========================================  DSP DSP1CONTROL DSP1IDMATRIG [4..5]  ========================================== */
typedef enum {                                  /*!< DSP_DSP1CONTROL_DSP1IDMATRIG                                              */
  DSP_DSP1CONTROL_DSP1IDMATRIG_XTRIG   = 3,     /*!< XTRIG : Trigger is disabled until a cross trigger pulse is asserted.
                                                     This will allow another source (determined by the XTRIGSRC
                                                     register) to allow the DMA descriptor chain to proceed.                   */
  DSP_DSP1CONTROL_DSP1IDMATRIG_SSTEP   = 2,     /*!< SSTEP : Trigger is disabled until a trigger pulse (PULSE in
                                                     IDMATRIG register) is asserted. This will allow a single
                                                     step in the DMA descriptor chain to be enabled until next
                                                     completion.                                                               */
  DSP_DSP1CONTROL_DSP1IDMATRIG_AON     = 1,     /*!< AON : Trigger is always enabled. With this set, any trigger
                                                     out will immediately generate a trigger in                                */
  DSP_DSP1CONTROL_DSP1IDMATRIG_DISABLE = 0,     /*!< DISABLE : Trigger is disabled. This will pause the iDMA indefinitely
                                                     until enabled.                                                            */
} DSP_DSP1CONTROL_DSP1IDMATRIG_Enum;

/* =====================================================  DSP1RESETVEC  ====================================================== */
/* ======================================================  DSP1IRQMASK  ====================================================== */
/* =====================================================  DSP1WAKEMASK  ====================================================== */
/* ==================================================  DSP1RAWIRQSTAT31to0  ================================================== */
/* =================================================  DSP1RAWIRQSTAT63to32  ================================================== */
/* =================================================  DSP1RAWIRQSTAT95to64  ================================================== */
/* =====================================================  DSP1L2LVLINT  ====================================================== */
/* =====================================================  DSP1L3LVLINT  ====================================================== */
/* =====================================================  DSP1L4LVLINT  ====================================================== */
/* =====================================================  DSP1L5LVLINT  ====================================================== */
/* ====================================================  DSP1IDMATRIGCTL  ==================================================== */
/* ==================================================  DSP1INTORMASK31TO0A  ================================================== */
/* =================================================  DSP1INTORMASK63TO32A  ================================================== */
/* =================================================  DSP1INTORMASK95TO64A  ================================================== */
/* ==================================================  DSP1INTORMASK31to0B  ================================================== */
/* =================================================  DSP1INTORMASK63TO32B  ================================================== */
/* =================================================  DSP1INTORMASK95TO64B  ================================================== */
/* ===================================================  DSP1INTENIRQ31TO0  =================================================== */
/* ==================================================  DSP1INTENIRQ63TO32  =================================================== */
/* ==================================================  DSP1INTENIRQ95TO64  =================================================== */


/* =========================================================================================================================== */
/* ================                                           FPIO                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  RD0  ========================================================== */
/* ==========================================================  RD1  ========================================================== */
/* ==========================================================  RD2  ========================================================== */
/* ==========================================================  RD3  ========================================================== */
/* ==========================================================  WT0  ========================================================== */
/* ==========================================================  WT1  ========================================================== */
/* ==========================================================  WT2  ========================================================== */
/* ==========================================================  WT3  ========================================================== */
/* =========================================================  WTS0  ========================================================== */
/* =========================================================  WTS1  ========================================================== */
/* =========================================================  WTS2  ========================================================== */
/* =========================================================  WTS3  ========================================================== */
/* =========================================================  WTC0  ========================================================== */
/* =========================================================  WTC1  ========================================================== */
/* =========================================================  WTC2  ========================================================== */
/* =========================================================  WTC3  ========================================================== */
/* ==========================================================  EN0  ========================================================== */
/* ==========================================================  EN1  ========================================================== */
/* ==========================================================  EN2  ========================================================== */
/* ==========================================================  EN3  ========================================================== */
/* =========================================================  ENS0  ========================================================== */
/* =========================================================  ENS1  ========================================================== */
/* =========================================================  ENS2  ========================================================== */
/* =========================================================  ENS3  ========================================================== */
/* =========================================================  ENC0  ========================================================== */
/* =========================================================  ENC1  ========================================================== */
/* =========================================================  ENC2  ========================================================== */
/* =========================================================  ENC3  ========================================================== */


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  PINCFG0  ======================================================== */
/* =============================================  GPIO PINCFG0 NCEPOL0 [22..22]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG0_NCEPOL0                                                      */
  GPIO_PINCFG0_NCEPOL0_LOW             = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG0_NCEPOL0_HIGH            = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG0_NCEPOL0_Enum;

