AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* =======================================  SDIO INTSTAT COMMANDENDBITERROR [18..18]  ======================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_COMMANDENDBITERROR                                           */
  SDIO_INTSTAT_COMMANDENDBITERROR_NOERROR = 0,  /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_COMMANDENDBITERROR_ERROR = 1,    /*!< ERROR : Timeout                                                           */
} SDIO_INTSTAT_COMMANDENDBITERROR_Enum;

/* =========================================  SDIO INTSTAT COMMANDCRCERROR [17..17]  ========================================= */
typedef enum {                                  /*!< SDIO_INTSTAT_COMMANDCRCERROR                                              */
  SDIO_INTSTAT_COMMANDCRCERROR_NOERROR = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_COMMANDCRCERROR_ERROR   = 1,     /*!< ERROR : End Bit Error Generated                                           */
} SDIO_INTSTAT_COMMANDCRCERROR_Enum;

/* =======================================  SDIO INTSTAT COMMANDTIMEOUTERROR [16..16]  ======================================= */
typedef enum {                                  /*!< SDIO_INTSTAT_COMMANDTIMEOUTERROR                                          */
  SDIO_INTSTAT_COMMANDTIMEOUTERROR_NOERROR = 0, /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_COMMANDTIMEOUTERROR_ERROR = 1,   /*!< ERROR : CRC Error Generated                                               */
} SDIO_INTSTAT_COMMANDTIMEOUTERROR_Enum;

/* =========================================  SDIO INTSTAT ERRORINTERRUPT [15..15]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_ERRORINTERRUPT                                               */
  SDIO_INTSTAT_ERRORINTERRUPT_NOERROR  = 0,     /*!< NOERROR : No Error.                                                       */
  SDIO_INTSTAT_ERRORINTERRUPT_ERROR    = 1,     /*!< ERROR : Error.                                                            */
} SDIO_INTSTAT_ERRORINTERRUPT_Enum;

/* ==========================================  SDIO INTSTAT BOOTTERMINATE [14..14]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_BOOTTERMINATE                                                */
  SDIO_INTSTAT_BOOTTERMINATE_OK        = 0,     /*!< OK : Boot operation is not terminated.                                    */
  SDIO_INTSTAT_BOOTTERMINATE_BOOTTERM  = 1,     /*!< BOOTTERM : Boot operation is terminated                                   */
} SDIO_INTSTAT_BOOTTERMINATE_Enum;

/* ===========================================  SDIO INTSTAT BOOTACKRCV [13..13]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSTAT_BOOTACKRCV                                                   */
  SDIO_INTSTAT_BOOTACKRCV_NOACK        = 0,     /*!< NOACK : Boot ack is not received.                                         */
  SDIO_INTSTAT_BOOTACKRCV_ACK          = 1,     /*!< ACK : Boot ack is received.                                               */
} SDIO_INTSTAT_BOOTACKRCV_Enum;

/* ==========================================  SDIO INTSTAT RETUNINGEVENT [12..12]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_RETUNINGEVENT                                                */
  SDIO_INTSTAT_RETUNINGEVENT_RETUNE    = 1,     /*!< RETUNE : ReTuning should be performed                                     */
  SDIO_INTSTAT_RETUNINGEVENT_NORETUNE  = 0,     /*!< NORETUNE : ReTuning is not required                                       */
} SDIO_INTSTAT_RETUNINGEVENT_Enum;

/* ===========================================  SDIO INTSTAT CARDINTERRUPT [8..8]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_CARDINTERRUPT                                                */
  SDIO_INTSTAT_CARDINTERRUPT_NOINT     = 0,     /*!< NOINT : No Card Interrupt                                                 */
  SDIO_INTSTAT_CARDINTERRUPT_INT       = 1,     /*!< INT : Generate Card Interrupt                                             */
} SDIO_INTSTAT_CARDINTERRUPT_Enum;

/* ============================================  SDIO INTSTAT CARDREMOVAL [7..7]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSTAT_CARDREMOVAL                                                  */
  SDIO_INTSTAT_CARDREMOVAL_STABLE      = 0,     /*!< STABLE : Card State Stable or Debouncing                                  */
  SDIO_INTSTAT_CARDREMOVAL_REMOVED     = 1,     /*!< REMOVED : Card Removed                                                    */
} SDIO_INTSTAT_CARDREMOVAL_Enum;

/* ===========================================  SDIO INTSTAT CARDINSERTION [6..6]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_CARDINSERTION                                                */
  SDIO_INTSTAT_CARDINSERTION_STABLE    = 0,     /*!< STABLE : Card State Stable or Debouncing                                  */
  SDIO_INTSTAT_CARDINSERTION_INSERTED  = 1,     /*!< INSERTED : Card Inserted                                                  */
} SDIO_INTSTAT_CARDINSERTION_Enum;

/* ==========================================  SDIO INTSTAT BUFFERREADREADY [5..5]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_BUFFERREADREADY                                              */
  SDIO_INTSTAT_BUFFERREADREADY_NOREADY = 0,     /*!< NOREADY : Not Ready to read Buffer.                                       */
  SDIO_INTSTAT_BUFFERREADREADY_READY   = 1,     /*!< READY : Ready to read Buffer.                                             */
} SDIO_INTSTAT_BUFFERREADREADY_Enum;

/* =========================================  SDIO INTSTAT BUFFERWRITEREADY [4..4]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_BUFFERWRITEREADY                                             */
  SDIO_INTSTAT_BUFFERWRITEREADY_NOTREADY = 0,   /*!< NOTREADY : Not Ready to Write Buffer.                                     */
  SDIO_INTSTAT_BUFFERWRITEREADY_READY  = 1,     /*!< READY : Ready to Write Buffer.                                            */
} SDIO_INTSTAT_BUFFERWRITEREADY_Enum;

/* ===========================================  SDIO INTSTAT DMAINTERRUPT [3..3]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSTAT_DMAINTERRUPT                                                 */
  SDIO_INTSTAT_DMAINTERRUPT_NOINT      = 0,     /*!< NOINT : No DMA Interrupt                                                  */
  SDIO_INTSTAT_DMAINTERRUPT_INT        = 1,     /*!< INT : DMA Interrupt is Generated                                          */
} SDIO_INTSTAT_DMAINTERRUPT_Enum;

