AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* =============================================  SDIO AUTO SIGNALVOLT [19..19]  ============================================= */
typedef enum {                                  /*!< SDIO_AUTO_SIGNALVOLT                                                      */
  SDIO_AUTO_SIGNALVOLT_1_8V            = 1,     /*!< 1_8V : 1.8V Signaling                                                     */
  SDIO_AUTO_SIGNALVOLT_3_3V            = 0,     /*!< 3_3V : 3.3V Signaling                                                     */
} SDIO_AUTO_SIGNALVOLT_Enum;

/* =============================================  SDIO AUTO UHSMODESEL [16..18]  ============================================= */
typedef enum {                                  /*!< SDIO_AUTO_UHSMODESEL                                                      */
  SDIO_AUTO_UHSMODESEL_SDR12           = 0,     /*!< SDR12 : UHS-I mode SDR12                                                  */
  SDIO_AUTO_UHSMODESEL_SDR25           = 1,     /*!< SDR25 : UHS-I mode SDR25                                                  */
  SDIO_AUTO_UHSMODESEL_SDR50           = 2,     /*!< SDR50 : UHS-I mode SDR50                                                  */
  SDIO_AUTO_UHSMODESEL_SDR104          = 3,     /*!< SDR104 : UHS-I mode SDR104                                                */
  SDIO_AUTO_UHSMODESEL_DDR50           = 4,     /*!< DDR50 : UHS-I mode DDR50                                                  */
} SDIO_AUTO_UHSMODESEL_Enum;

/* ===========================================  SDIO AUTO NOTAUTOCMD12ERR [7..7]  ============================================ */
typedef enum {                                  /*!< SDIO_AUTO_NOTAUTOCMD12ERR                                                 */
  SDIO_AUTO_NOTAUTOCMD12ERR_NOERROR    = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_AUTO_NOTAUTOCMD12ERR_ERROR      = 1,     /*!< ERROR : Not Issued                                                        */
} SDIO_AUTO_NOTAUTOCMD12ERR_Enum;

/* ==============================================  SDIO AUTO CMDIDXERR [4..4]  =============================================== */
typedef enum {                                  /*!< SDIO_AUTO_CMDIDXERR                                                       */
  SDIO_AUTO_CMDIDXERR_NOERROR          = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_AUTO_CMDIDXERR_ERROR            = 1,     /*!< ERROR : Error                                                             */
} SDIO_AUTO_CMDIDXERR_Enum;

/* ==============================================  SDIO AUTO CMDENDERR [3..3]  =============================================== */
typedef enum {                                  /*!< SDIO_AUTO_CMDENDERR                                                       */
  SDIO_AUTO_CMDENDERR_NOERROR          = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_AUTO_CMDENDERR_ERROR            = 1,     /*!< ERROR : End Bit Error Generated                                           */
} SDIO_AUTO_CMDENDERR_Enum;

/* ==============================================  SDIO AUTO CMDCRCERR [2..2]  =============================================== */
typedef enum {                                  /*!< SDIO_AUTO_CMDCRCERR                                                       */
  SDIO_AUTO_CMDCRCERR_NOERROR          = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_AUTO_CMDCRCERR_ERROR            = 1,     /*!< ERROR : CRC Error Generated                                               */
} SDIO_AUTO_CMDCRCERR_Enum;

/* ===============================================  SDIO AUTO CMDTOERR [1..1]  =============================================== */
typedef enum {                                  /*!< SDIO_AUTO_CMDTOERR                                                        */
  SDIO_AUTO_CMDTOERR_NOERROR           = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_AUTO_CMDTOERR_ERROR             = 1,     /*!< ERROR : Timeout                                                           */
} SDIO_AUTO_CMDTOERR_Enum;

/* =============================================  SDIO AUTO CMD12NOTEXEC [0..0]  ============================================= */
typedef enum {                                  /*!< SDIO_AUTO_CMD12NOTEXEC                                                    */
  SDIO_AUTO_CMD12NOTEXEC_EXECUTED      = 0,     /*!< EXECUTED : Executed                                                       */
  SDIO_AUTO_CMD12NOTEXEC_NOTEXECUTED   = 1,     /*!< NOTEXECUTED : Not Executed                                                */
} SDIO_AUTO_CMD12NOTEXEC_Enum;

/* =====================================================  CAPABILITIES0  ===================================================== */
/* =========================================  SDIO CAPABILITIES0 SLOTTYPE [30..31]  ========================================== */
typedef enum {                                  /*!< SDIO_CAPABILITIES0_SLOTTYPE                                               */
  SDIO_CAPABILITIES0_SLOTTYPE_REMOVABLE = 0,    /*!< REMOVABLE : Removable card slot                                           */
  SDIO_CAPABILITIES0_SLOTTYPE_EMBEDDED = 1,     /*!< EMBEDDED : Embedded Slot for One Device                                   */
  SDIO_CAPABILITIES0_SLOTTYPE_SHARED   = 2,     /*!< SHARED : Shared Bus Slot                                                  */
} SDIO_CAPABILITIES0_SLOTTYPE_Enum;

/* =========================================  SDIO CAPABILITIES0 ASYNCINT [29..29]  ========================================== */
typedef enum {                                  /*!< SDIO_CAPABILITIES0_ASYNCINT                                               */
  SDIO_CAPABILITIES0_ASYNCINT_SUPPORTED = 1,    /*!< SUPPORTED : Asynchronous Interrupt Supported                              */
  SDIO_CAPABILITIES0_ASYNCINT_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : Asynchronous Interrupt Not Supported                       */
} SDIO_CAPABILITIES0_ASYNCINT_Enum;

/* =========================================  SDIO CAPABILITIES0 SYSBUS64 [28..28]  ========================================== */
typedef enum {                                  /*!< SDIO_CAPABILITIES0_SYSBUS64                                               */
  SDIO_CAPABILITIES0_SYSBUS64_SUPPORTED = 1,    /*!< SUPPORTED : Supports 64 bit system address                                */
  SDIO_CAPABILITIES0_SYSBUS64_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : Does not support 64 bit system address                     */
} SDIO_CAPABILITIES0_SYSBUS64_Enum;

/* ==========================================  SDIO CAPABILITIES0 VOLT18V [26..26]  ========================================== */
typedef enum {                                  /*!< SDIO_CAPABILITIES0_VOLT18V                                                */
  SDIO_CAPABILITIES0_VOLT18V_NOTSUPPORTED = 0,  /*!< NOTSUPPORTED : 1.8 V Not Supported                                        */
  SDIO_CAPABILITIES0_VOLT18V_SUPPORTED = 1,     /*!< SUPPORTED : 1.8 V Supported                                               */
} SDIO_CAPABILITIES0_VOLT18V_Enum;

/* ==========================================  SDIO CAPABILITIES0 VOLT30V [25..25]  ========================================== */
typedef enum {                                  /*!< SDIO_CAPABILITIES0_VOLT30V                                                */
  SDIO_CAPABILITIES0_VOLT30V_NOTSUPPORTED = 0,  /*!< NOTSUPPORTED : 3.0 V Not Supported                                        */
  SDIO_CAPABILITIES0_VOLT30V_SUPPORTED = 1,     /*!< SUPPORTED : 3.0 V Supported                                               */
} SDIO_CAPABILITIES0_VOLT30V_Enum;

/* ==========================================  SDIO CAPABILITIES0 VOLT33V [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO_CAPABILITIES0_VOLT33V                                                */
  SDIO_CAPABILITIES0_VOLT33V_NOTSUPPORTED = 0,  /*!< NOTSUPPORTED : 3.3 V Not Supported                                        */
  SDIO_CAPABILITIES0_VOLT33V_SUPPORTED = 1,     /*!< SUPPORTED : 3.3 V Supported                                               */
} SDIO_CAPABILITIES0_VOLT33V_Enum;

