AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4b.h
/* =============================================  TIMER AUXEN TMR14EN [14..14]  ============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR14EN                                                       */
  TIMER_AUXEN_TMR14EN_DIS              = 0,     /*!< DIS : Disable TIMER14.                                                    */
  TIMER_AUXEN_TMR14EN_EN               = 1,     /*!< EN : Enable TIMER14.                                                      */
} TIMER_AUXEN_TMR14EN_Enum;

/* =============================================  TIMER AUXEN TMR13EN [13..13]  ============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR13EN                                                       */
  TIMER_AUXEN_TMR13EN_DIS              = 0,     /*!< DIS : Disable TIMER13.                                                    */
  TIMER_AUXEN_TMR13EN_EN               = 1,     /*!< EN : Enable TIMER13.                                                      */
} TIMER_AUXEN_TMR13EN_Enum;

/* =============================================  TIMER AUXEN TMR12EN [12..12]  ============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR12EN                                                       */
  TIMER_AUXEN_TMR12EN_DIS              = 0,     /*!< DIS : Disable TIMER12.                                                    */
  TIMER_AUXEN_TMR12EN_EN               = 1,     /*!< EN : Enable TIMER12.                                                      */
} TIMER_AUXEN_TMR12EN_Enum;

/* =============================================  TIMER AUXEN TMR11EN [11..11]  ============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR11EN                                                       */
  TIMER_AUXEN_TMR11EN_DIS              = 0,     /*!< DIS : Disable TIMER11.                                                    */
  TIMER_AUXEN_TMR11EN_EN               = 1,     /*!< EN : Enable TIMER11.                                                      */
} TIMER_AUXEN_TMR11EN_Enum;

/* =============================================  TIMER AUXEN TMR10EN [10..10]  ============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR10EN                                                       */
  TIMER_AUXEN_TMR10EN_DIS              = 0,     /*!< DIS : Disable TIMER10.                                                    */
  TIMER_AUXEN_TMR10EN_EN               = 1,     /*!< EN : Enable TIMER10.                                                      */
} TIMER_AUXEN_TMR10EN_Enum;

/* ==============================================  TIMER AUXEN TMR09EN [9..9]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR09EN                                                       */
  TIMER_AUXEN_TMR09EN_DIS              = 0,     /*!< DIS : Disable TIMER09.                                                    */
  TIMER_AUXEN_TMR09EN_EN               = 1,     /*!< EN : Enable TIMER09.                                                      */
} TIMER_AUXEN_TMR09EN_Enum;

/* ==============================================  TIMER AUXEN TMR08EN [8..8]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR08EN                                                       */
  TIMER_AUXEN_TMR08EN_DIS              = 0,     /*!< DIS : Disable TIMER08.                                                    */
  TIMER_AUXEN_TMR08EN_EN               = 1,     /*!< EN : Enable TIMER08.                                                      */
} TIMER_AUXEN_TMR08EN_Enum;

/* ==============================================  TIMER AUXEN TMR07EN [7..7]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR07EN                                                       */
  TIMER_AUXEN_TMR07EN_DIS              = 0,     /*!< DIS : Disable TIMER07.                                                    */
  TIMER_AUXEN_TMR07EN_EN               = 1,     /*!< EN : Enable TIMER07.                                                      */
} TIMER_AUXEN_TMR07EN_Enum;

/* ==============================================  TIMER AUXEN TMR06EN [6..6]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR06EN                                                       */
  TIMER_AUXEN_TMR06EN_DIS              = 0,     /*!< DIS : Disable TIMER06.                                                    */
  TIMER_AUXEN_TMR06EN_EN               = 1,     /*!< EN : Enable TIMER06.                                                      */
} TIMER_AUXEN_TMR06EN_Enum;

/* ==============================================  TIMER AUXEN TMR05EN [5..5]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR05EN                                                       */
  TIMER_AUXEN_TMR05EN_DIS              = 0,     /*!< DIS : Disable TIMER05.                                                    */
  TIMER_AUXEN_TMR05EN_EN               = 1,     /*!< EN : Enable TIMER05.                                                      */
} TIMER_AUXEN_TMR05EN_Enum;

/* ==============================================  TIMER AUXEN TMR04EN [4..4]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR04EN                                                       */
  TIMER_AUXEN_TMR04EN_DIS              = 0,     /*!< DIS : Disable TIMER04.                                                    */
  TIMER_AUXEN_TMR04EN_EN               = 1,     /*!< EN : Enable TIMER04.                                                      */
} TIMER_AUXEN_TMR04EN_Enum;

/* ==============================================  TIMER AUXEN TMR03EN [3..3]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR03EN                                                       */
  TIMER_AUXEN_TMR03EN_DIS              = 0,     /*!< DIS : Disable TIMER03.                                                    */
  TIMER_AUXEN_TMR03EN_EN               = 1,     /*!< EN : Enable TIMER03.                                                      */
} TIMER_AUXEN_TMR03EN_Enum;

/* ==============================================  TIMER AUXEN TMR02EN [2..2]  =============================================== */
typedef enum {                                  /*!< TIMER_AUXEN_TMR02EN                                                       */
  TIMER_AUXEN_TMR02EN_DIS              = 0,     /*!< DIS : Disable TIMER02.                                                    */
  TIMER_AUXEN_TMR02EN_EN               = 1,     /*!< EN : Enable TIMER02.                                                      */
} TIMER_AUXEN_TMR02EN_Enum;

